{"title": "resolucao_cepec_2011_1023(Sistemas de Informação)", "paragraphs": ["MINISTÉRIO DA EDUCAÇÃO UNIVERSIDADE FEDERAL DE GOIÁS RESOLUÇÃO – CEPEC N° 1023 Fixa o currículo pleno do Curso de Graduação em Sistemas de Informação – Bacharelado, para alunos ingressos a partir do ano letivo de 2009.", "O CONSELHO DE ENSINO, PESQUISA, EXTENSÃO E CULTURA DA UNIVERSIDADE FEDERAL DE GOIÁS, no uso de suas atribuições legais, estatutárias e regimentais, reunido em sessão plenária realizada no dia 8 de abril de 2011, tendo em vista o que consta do processo n° 23070.011337/2008-80 e considerando:", "a) o Regulamento Geral dos Cursos de Graduação – RGCG da UFG, Resolução CONSUNI No 06/2002;b) as Diretrizes Curriculares Nacionais para os cursos da área de computação e informática do MEC;c) a Lei de Diretrizes e Base – LDB (Lei 9.394/96);d) a responsabilidade social com a qualidade e competência dos profissionais formandos pela Universidade;e) a Resolução CONSUNI Nº 11/2004, que altera dispositivos da Resolução CONSUNI No 06/2002.", "RESOLVE:Art. 1º Fixar o currículo pleno do Curso de Graduação em Sistemas de Informação – Bacharelado, do Instituto de Informática – INF, para alunos ingressos a partir do ano letivo de 2009.", "Parágrafo único. Ao graduado será conferido o grau de Bacharel em Sistemas de Informação.Art. 2º O Curso de Graduação em Sistemas de Informação – Bacharelado visa formar profissionais empreendedores, aptos a aprender de forma autônoma e contínua novas tecnologias da informação e comunicação (TIC) e aplicá-las na solução de problemas de empresas e organizações.Art. 3º O egresso do Curso de Graduação em Sistemas de Informação – Bacharelado, deverá ser capaz de:", "I. contribuir para a implantação de modelos automatizados, de modo a tornar empresas mais dinâmicas e competitivas, agilizando tomadas de decisão;II. absorver e implantar novas tecnologias, desenvolvendo novas soluções para as diversas áreas de negócio da empresa;III. analisar, projetar, desenvolver, implantar e gerenciar sistemas de informação;IV. organizar o armazenamento de grandes volumes de informação e sua recuperação, estabelecendo uma relação de comunicação segura;V. trabalhar em equipes multidisciplinares, em consonância com a dinâmica das empresas modernas;VI. usar a criatividade e o raciocínio crítico no desempenho de suas atividades profissionais dentro da sociedade;VII. ter uma visão humanística consciente e crítica do impacto de sua atuação profissional na sociedade.", "Art. 4º O currículo do Curso de Graduação em Sistemas de Informação – Bacharelado, a ser cursado em turno preferencialmente noturno, é constituído por um conjunto de disciplinas obrigatórias e optativas, e atividades complementares, assim distribuídas:I - disciplinas do Núcleo Comum: mil e oitenta e oitenta e oito (1088) horas;II - disciplinas do Núcleo Específico: mil quinhentas e trinta e seis (1536) horas;III - disciplinas do Núcleo Livre: cento e sessenta (160) horas;IV - Atividades Complementares: duzentas e dezesseis (216) horas;V - carga horária total: três mil (3000) horas.", "§ 1º As Atividades Complementares têm por objetivo proporcionar oportunidades de participação do aluno em outros setores do conhecimento que não façam parte do currículo pleno, e serão desenvolvidas ao longo do curso sob a forma de participação em conferências, palestras, seminários, encontros científicos, minicursos, projetos de pesquisa e extensão, além de outras atividades científicas, artísticas e culturais reconhecidas pela Coordenadoria do Curso.", "§ 2º O Curso de Graduação em Sistemas de Informação – Bacharelado, poderá utilizar para suas aulas método não presencial, na forma da legislação em vigor.Art. 5º O currículo pleno do Curso de Graduação em Sistemas de Informação - Bacharelado será integralizado segundo as condições a seguir:", "I - o aluno deverá perfazer a carga horária prevista no Art 4º desta Resolução;II - duração mínima de oito semestres letivos;III - participação efetiva em atividades acadêmicas, em pesquisa e extensão, com o desenvolvimento de monografia ao final do curso;IV - tempo máximo para a integralização curricular de quatorze (14) semestres.", "Art. 6º A cada semestre letivo, os alunos deverão se matricular, observando:I - a carga horária semanal máxima de trinta (30) horas;II - a carga horária semanal mínima de quatorze (14) horas-aula ou o complemento necessário para integralização curricular;de acordo com o título II, Art 7º, § 2º do Regulamento Geral de Cursos de Graduação – RGCG;III - o limite de vagas nas disciplinas;IV - a ausência de sobreposição de horárias das aula.", "Art. 7º Os programas das disciplinas deverão ser elaborados com observância das ementas, objetivos, habilidades e competências, conforme Projeto Pedagógico do Curso.Art. 8º Integram esta Resolução o Anexo I – Relação de Disciplinas, com as respectivas cargas horárias e unidades acadêmicas responsáveis por ministrá-las; o Anexo II – Ementas das Disciplinas; e o Anexo III – Sugestão de Fluxo para as Disciplinas da Matriz Curricular.", "Art. 9º Esta Resolução entra em vigor nesta data, revogando-se as disposições em contrário.Goiânia, 8 de abril de 2011 Prof. Edward Madureira Brasil - Presidente - ANEXO I DA RESOLUÇÃO – CEPEC Nº 1023", "MATRIZ CURRICULAR DO CURSO DE GRADUAÇÃO EM SISTEMAS DE INFORMAÇÃO CHS PRÉ- NATU NÚCL UNIDADE DISCIPLINA CHT REQUI REZA EO TEO PRA SITOS RESPONSÁVEL", "1 Aplicações Distribuídas 64 3 1 OBR NE INF 2 Arquitetura de Computadores 64 3 1 - OBR NC INF 3 Arquitetura de Software 64 2 2 - OBR NC INF 4 Auditoria de Sistemas 64 4 0 - OBR NE INF 5 Banco de Dados 1 64 2 2 - OBR NE INF 6 Banco de Dados 2 64 3 1 5 OBR NE INF 7 Comunicação Empresarial 64 4 0 - OBR NE FACOMB 8 Construção de Software 64 0 4 - OBR NE INF 9 Direito 64 4 0 - OBR NE FD 10 Empreendedorismo 64 2 2 29 OBR NE INF 11 Engenharia de Requisitos 64 4 0 - OBR NC INF 12 Engenharia de Software 64 4 0 - OBR NC INF 13 Estruturas de Dados 64 2 2 - OBR NC INF 14 Ética, Computador e Sociedade 32 2 0 - OBR NC INF 15 Fundamentos em Contabilidade 64 4 0 - OBR NE EA 16 Gerência de Projetos 1 64 3 1 - OBR NE INF 17 Gerência de Projetos 2 64 0 4 16 OBR NE INF 18 Gestão de Pessoas 64 4 0 - OBR NE FACE 19 Gestão em Tecnologia da Informação 64 4 0 29 OBR NE INF 20 Interação Homem-Computador 64 2 2 OBR NE INF 21 Introdução à Programação 64 0 4 - OBR NC INF 22 Introdução aos Sistemas de 64 4 0 - OBR NE INF Informação 23 Lógica 64 4 0 - OBR NC INF 24 Manutenção de Software 64 3 1 12 OBR NC INF 25 Matemática Discreta 64 4 0 - OBR NC INF 26 Matemática Financeira 64 4 0 - OBR NE IME 27 Projeto Final de Curso 1 32 2 - OBR NE INF 28 Projeto Final de Curso 2 32 2 27 OBR NE INF 29 Planejamento Estratégico 64 4 0 - OBR NE FACE 30 Programação Imperativa 64 2 2 21 OBR NC INF 31 Programação Orientada a Objetos 96 2 4 21 OBR NC INF 32 Programação para Web 96 1 5 31 OBR NC INF 33 Projetos de Software 64 4 0 - OBR NC INF 34 Qualidade de Software 64 4 0 - OBR NC INF 35 Redes de Computadores 64 3 1 - OBR NE INF 36 Segurança em Sistemas de Informação 64 3 1 - OBR NE INF 37 Sistemas Operacionais 96 4 2 - OBR NC INF 38 Teoria Geral da Administração 64 4 0 - OBR NE FACE 39 Tópicos 1 64 2 2 - OBR NE INF 40 Tópicos 2 64 2 2 - OBR NE INF 41 Tópicos 3 64 2 2 - OPT NE INF 42 Linguagem Brasileira de Sinais 64 4 0 - OPT NE FL - Libras Carga Horária Total (NC +NE) 2688 ANEXO II DA RESOLUÇÃO – CEPEC Nº 1023", "EMENTÁRIO DAS DISCIPLINAS 1. Aplicações Distribuídas Ementa: Introduzir os conceitos fundamentais de sistemas distribuídos, a caracterização de sistemas de computação distribuída, aplicações distribuídas (características e aspectos de projeto), objetivos básicos de sistemas distribuídos (transparência, abertura, escalabilidade etc). Estudar e dominar os princípios e aplicações dos principais modelos de sistemas distribuídos: sistemas cliente/servidor e sistemas multi-camadas; sistemas peer-to-peer.Compreender a teoria e prática de objetos distribuídos: interface x implementação; objetos remotos; chamadas de métodos remotos (RMI). Estudar os princípios e uso dos principais serviços de sistemas distribuídos: serviços de nomes; compartilhamento de documentos/recursos distribuídos (ex.: WWW e sistemas de trabalho cooperativo).Princípio e implementação de SOA – Arquiteturas Orientadas a Serviço; Utilização de web services.", "2. Arquitetura de Computadores Ementa: Visão geral dos computadores modernos. Evolução da arquitetura dos computadores. Sistemas de numeração e aritmética binária. Memória e representação de dados e instruções. Processador, ciclo de instrução, formatos, endereçamento, e programação em linguagem de montagem. Dispositivos de entrada e saída. Sistemas de interconexão (barramentos). Interfaceamento e técnicas de entrada e saída. Hierarquia de memória.Paralelismo ao nível de instrução. Arquiteturas paralelas.", "3. Arquitetura de Software Ementa: Conceitos de arquitetura de Software, estilo, estrutura, requisitos, análise de arquitetura. Projeto Arquitetural, Avaliação Arquitetura. Modelo de arquitetura em camadas – MVC (model – Viewcontroller), MDA (model drive architecture). Ferramentas.", "4. Auditoria de Sistemas Ementa: Auditoria de sistemas: conceituação, planejamento, controle interno, ponto de controle, produtos gerados, função do auditor e técnicas de auditoria de sistemas. Gerência de projetos: conceituação de projeto, modelo pmi, gerência da qualidade, proposta, ciclo de vida, estrutura organizacional, atuação do gerente de projeto, gerência de escopo, tempo e custo, ferramentas de gerencia de projeto e estimativas.", "5. Banco de Dados 1 Ementa: Sistemas de bancos de dados. Projeto de banco de dados. Modelo entidade- relacionamento. Modelo relacional. Álgebra relacional. Normalização. SQL.6. Banco de Dados 2 Ementa: Programação de Banco de Dados. Funções, gatilhos e procedimentos armazenados.Organização de Dados e Estruturas de Armazenamento. Transações. Controle de concorrência. Recuperação após falhas. Segurança.", "7. Comunicação Empresarial Ementa: A comunicação nas organizações suas funções e fases; o volume de riqueza da informação nas organizações; as redes e os canais de comunicação nas organizações; comunicação empresarial e o processo de gestão; comunicações internas nas organizações em uma nova abordagem:endomarketing; comunicação e liderança; comunicação interpessoal nas organizações: conhecimento, habilidade e atitude; comunicação verbal e não-verbal; barreiras da comunicação.8. Construção de Software Ementa: Definição de construção de software. Pré-requisitos para a construção. Boas práticas para definição dos requisitos. Arquitetura de software e seus componentes. Escolha da linguagem de programação. Convenções de programação. Principais práticas de construção de software. Projeto de software (conceitos, práticas, níveis e abordagens comuns). Formas de acoplamento. Classes e pacotes. Rotinas (métodos). Projeto de software em nível de rotina.Motivos para se criar uma rotina. Bons nomes para uma rotina. Tamanho adequado de uma rotina. Programação defensiva. Problemas gerais no uso de variáveis. Nomes adequados para variáveis. Tipos de dados fundamentais. Estruturas. Ponteiros e referências. Dados globais.Organizando código linear. Sentenças de decisão. Sentenças de iteração. Pesquisas em tabelas.Expressões lógicas. Blocos. Instruções nulas e aninhamentos profundos. Estruturas de controle e complexidade. Qualidade de software. Construção colaborativa. Testes de desenvolvedor. Depuração. Refatoração. Estratégias e técnicas de otimização de código.Relação entre tamanho do código e construção. Gerenciando a construção. Integração.Ferramentas de programação. Leiaute e estilo.", "9. Direito Ementa: O Direito como ciência, valor, poder, norma e fato social. Capacidade das pessoas, Noção de Direito das Obrigações, Regras gerais dos Contratos. Direito autoral e legislação de proteção ao software.", "10. Empreendedorismo Ementa: O perfil do empreendedor. Estudo de mecanismos e procedimentos para lançamento de uma empresa no mercado. Inovação tecnológica na geração de novos produtos e negócios.Sistemas de Gerenciamento, técnicas de negociação e legislação específica. Marketing e competitividade. Sistema de Produção. Sistema de Recursos Humanos. Constituição, tributação e legalização de empresa. Avaliação de desempenho empresarial. Análise de Casos.Elaboração de plano de negócios.", "11. Engenharia de Requisitos Ementa: Introdução ao Ciclo de Vida do Sistema de Software e ao Processo de Desenvolvimento de Software - Fase Requisitos; Conceitos sobre Requisitos; Requisitos de Sistema e Requisitos de Software (Funcionais e Não-Funcionais); Técnicas de Levantamento de Requisitos (Joint Application Development); Gerência de Requisitos; CASE para Requisitos; Documentação da Visão.", "12. Engenharia de Software Ementa: Caracterização de software enquanto produto e processo. Gerência de projetos de software: planejamento; métricas; análise e gerência de riscos e acompanhamento de projetos.Controle de qualidade de software. Gerência de configuração de software. Engenharia de sistemas. Análise e projeto de software. Ferramentas de apoio ao desenvolvimento de software. Noções de tópicos avançados em engenharia de software (métodos formais, reengenharia e outros). Técnicas e ferramentas CASE.", "13. Estruturas de Dados Ementa: Estudo de estruturas de dados básicas, seus conceitos e operações. Estudo de Listas Lineares, compreensão de seu uso como Pilhas e Filas e de implementações usando vetores, listas lineares encadeadas, listas duplamente encadeadas, listas circulares e listas com descritores. Estudo dos conceitos de Árvores Binárias, dos algoritmos de caminhamentos e da sua aplicação como fila de prioridade. Estudo de Árvores de Pesquisa: árvores binárias balanceadas, árvore B. Estudo de Tabelas de Dispersão.14. Ética, computador e Sociedade Ementa: Conceitos de ética e critérios para tomadas de decisões éticas. Códigos de ética profissional. Computadores: campos de aplicação. Aspectos sociais e econômicos de sua utilização. Aspectos estratégicos do controle de tecnologia. Estudos de casos.", "15. Fundamentos em Contabilidade Ementa: Contabilidade: Conceito, objeto, objetivo, campo de aplicação, usuários e finalidades, técnicas contábeis e evolução contábil. Patrimônio: Ativo, Passivo, Situação Líquida, Receitas e Despesas. Demonstrações Contábeis: relatórios obrigatórios e não obrigatórios; estrutura e interpretação. Processo de contabilização e escrituração: livros contábeis, lançamentos, operações comerciais e inventários. Princípios contábeis: abordagem inicial. A contabilidade na tomada de decisões.", "16. Gerência de Projetos 1 Ementa: Definição de Gerenciamento de Projetos. O Ciclo de Vida de um Projeto. As Fases do Ciclo de Vida do Projeto. Desempenho, Custo e Tempo em Projetos. Principais Áreas do Gerenciamento de Projetos. Preparando a Organização para Projetos. O Gerente de Projetos e suas Interfaces. Fluxograma do Projeto. Ferramentas Computacionais de Gerenciamento de Projetos.", "17. Gerência de Projetos 2 Ementa: Gerência de escopo (planejamento, definição, WBS, verificação e controle de escopo). Gerência de tempo (definição de atividades, sequenciamento de atividades, estimativa de recursos, estimativa de duração, desenvolvimento de cronograma e controle de cronograma). Gerência de custos (estimativas, orçamento e controle). Gerência de qualidade (planejamento, garantia da qualidade e controle de qualidade). Gerência de recursos humanos (planejamento, adquirir equipe de projeto, desenvolver a equipe de projeto e gerenciar a equipe de projeto). Gerência de comunicação (planejamento, distribuição da informação, relato de desempenho e gerenciar interessados). Gerência de riscos (planejamento, identificação de riscos, análise qualitativa e quantitativa de riscos, planejamento de resposta a riscos, controle e monitoramento de riscos). Gerência de aquisições (planejamento, planejamento de contratos, requisitar respostas de fornecedores, selecionar fornecedores, administração de contratos e fechamento de contrato. Gerência de integração (desenvolver carta de projeto, desenvolver escopo preliminar, desenvolver plano de gerência de projeto, dirigir e gerenciar a execução de projetos, monitorar e controlar atividades de projeto, controle de mudanças e fechamento do projeto). Estabelecer relações com o MPS.BR. Gerência de aquisições deve ser observada da perspectiva do Guia de Aquisições de Software e Serviços Correlatos (MPS.BR).", "18. Gestão de Pessoas Ementa: Um resgate conceitual e histórico dos modelos de gestão de pessoas. Os processos na área de gestão de pessoas: Recrutamento e Seleção; Cargos e Salários; Treinamento e Desenvolvimento (T&D); Plano de Carreira; Avaliação de Desempenho; Benefícios Sociais;Saúde e Segurança no Trabalho. Perspectivas e tendências da gestão de pessoas.", "19. Gestão em Tecnologia da Informação Ementa: Áreas estratégias para Gestão de TI. Alinhamento de Estratégias de TI e do Negócio.Critérios para controle da Informação. Processos de Gestão de TI. Tipos de recursos em TI.Modelos de Gestão de TI. Controle de Processos de TI. Indicadores e métricas para gestão de TI. Maturidade e capacitação de processos de TI. Planejamento e organização da área de TI.Aquisição e Implementação de serviços de TI. Entrega e suporte a serviços de TI.Monitoramento e avaliação de resultados de TI.20. Interação Homem-Computador Ementa: Fatores humanos em software interativo: teoria, princípios e regras básicas. Estilos interativos: linguagens de comandos, manipulação direta. Dispositivos de interação. Padrões para interface. Usabilidade: definição e métodos para avaliação.", "21. Introdução à Programação Ementa: Lógica de programação; constantes; tipos de dados primitivos; variáveis; atribuição;expressões aritméticas e lógicas; estruturas de decisão; estruturas de controle; estruturas de dados homogêneas e heterogêneas: vetores (arrays) e matrizes. Desenvolvimento de algoritmos.Transcrição de algoritmos para uma linguagem de programação. Desenvolvimento de pequenos programas.", "22. Introdução aos Sistemas de Informação Ementa: Projeto Pedagógico do curso de Sistemas de Informação. Características do profissional de sistemas de informação e carreiras de sistemas de informação. Conceituação de computador, informática e software. Histórico da computação e de sistemas de informação.Conceitos, objetivos, tipos, funções, organização e componentes dos sistemas de informação.Sistemas de informação empresariais, empresa digital, tipos de sistemas de informação empresariais. Infra-estrutura de tecnologia de informação: hardware e software, bancos de dados, telecomunicações, Internet e redes. Aplicações de sistemas de informação: sistemas integrados, comércio eletrônico, gestão do conhecimento e sistemas de apoio à decisão.Desenvolvimento e gerenciamento de sistemas de informação. Aspectos de segurança, éticos e sociais.", "23. Lógica Ementa: Lógica Proposicional. Proposições e conectivos. Operações Lógicas sobre proposições. Construção de tabelas-verdade. Tautologias, contradições e contingências.Implicação Lógica. Equivalência Lógica. Álgebra das proposições. Métodos para determinação da validade de fórmulas da Lógica Proposicional. Demonstração condicional e demonstração indireta. Lógica de Predicados.", "24. Manutenção de Software Ementa: Conceitos básicos sobre manutenção de software. Manutenabilidade. Processos de Manutenção. Gestão da manutenção de software (processo, planejamento, gestão de configuração, gestão de riscos). Teste de software e teste de regressão. Compreensão de programas. Engenharia reversa. Reengenharia. Ferramentas aplicadas à manutenção.", "25. Matemática Discreta Ementa: Princípios dos números naturais, inteiros, racionais e reais. Conjuntos: interseção, união, complemento, produto. Figuras de Venn. Noção de relação e de função. Classificação de funções. Técnicas de demonstração. Recursão e Relação de Recorrência. Matrizes. Sistema de equações lineares e solução. Grafos e dígrafos.", "26. Matemática Financeira Ementa: Juros e capitalização simples. Capitalização composta. Desconto e taxas de desconto.Séries de pagamento. Métodos de avaliação de fluxos de caixa. Taxas de juros.Sistemas de amortização. Operações realizadas no sistema financeiro brasileiro.27. Projeto Final de Curso 1 Ementa: Apresentação de critérios e metodologias para elaboração de proposta e desenvolvimento de projeto de pesquisa formulado sobre tema de livre escolha, que venha a incorporar conhecimentos teóricos e tecnológicos relevantes para a área de Computação.28. Projeto Final de Curso 2 Ementa: Disciplina que dá continuidade à PFC1. Consiste no desenvolvimento do projeto de pesquisa e elaboração de monografia final.", "29. Planejamento Estratégico Ementa: Gestão estratégica: conceitos, requisitos, vantagens e processo; Definição das filosofias, políticas e diretrizes superiores. Definição de objetivos, estratégia, e tomada de decisão. Fatores Críticos de Sucesso. Análise do ambiente interno e externo da organização.Análise de recursos, requisitos, cenários e tendências. Processo de elaboração e implementação do planejamento estratégico. Planejamento estratégico versus análise competitiva. Estruturas e modelos para formulação de estratégias. Estratégias competitivas modernas. BSC (Balanced Scorecard) como instrumento de gestão estratégica. Mapeamentos de estratégias para ações. Indicadores de Desempenho.", "30. Programação Imperativa Ementa: Estudo dos conceitos da linguagens de programação imperativa e de seus paradigmas. Ambiente integrado de desenvolvimento (edição, compilação, depuração, empacotamento e distribuição). Estrutura de dados homogêneas e heterogêneas na programação imperativa. Alocação estática e dinâmica. Modularização (passagem de parâmetros, procedimentos e funções recursivas e não recursivas). Manipulação de Arquivos.Estudos de caso de aplicações desenvolvidas com a programação imperativa.", "31. Programação Orientada a Objetos Ementa: Paradigma de orientação a objetos. Linguagens orientadas a objetos. Abstração e tipos abstratos. Classes, métodos, encapsulamento, interface. Mensagens, instâncias e inicialização. Herança e composição. A combinação de herança e composição. Polimorfismo:variáveis polimórficas, sobrecarga, construtores. Ambiente integrado de desenvolvimento (IDE): conceituação e utilização. Implementação de programas em Java. Introdução a objetos em Java: encapsulamento, classes, métodos, objetos, mensagens, construtores, composição, herança, polimorfismo. Estudos de caso de aplicações desenvolvidas com a linguagem de programação Java.", "32. Programação para Web Ementa: Paradigma e padrões de desenvolvimento de aplicações para a Web. Interface gráfica do usuário (GUI - Graphical User Interface) em ambiente Web. Plataforma Java para desenvolvimento de aplicações para a Web. Visão geral e Arquitetura de Servlets. Linguagem para conteúdo web dinâmico na arquitetura Java (JSP – Java Server Pages). Tratamento de Eventos em Java no ambiente Web. Acesso a Banco de dados em ambiente WEB (JDBC - Java Database Connectivity). Estudos de caso de aplicações desenvolvidas com a linguagem Java para web.", "33. Projetos de Software Ementa: Definição de projeto. Questões fundamentais (persistência dos dados, exceções e outras). Contexto de projeto em vários modelos de desenvolvimento de software (ciclos de vida). Princípios de projeto (encapsulamento de informações, coesão e acoplamento).Interação entre projeto e requisitos. Atributos qualitativos em um projeto (confiabilidade, usabilidade, manutenibilidade, testabilidade, desempenho, segurança, tolerância a falhas e outros). Compromissos (custo-benefício). Relação entre arquitetura de software e projeto de software. Projeto orientado a objetos. Projeto funcional. Noção de projeto baseado em estrutura de dados e projeto orientado a aspectos. Projeto orientado por responsabilidade.Projeto por contratos. Métodos de projeto de software. Padrões de projeto. Reutilização.Projeto de componentes. Projeto de interfaces entre componentes e sistemas. Notações de projeto. Ferramentas de suporte a projeto (análise estática, avaliação dinâmica e outras).Medidas de atributos de projeto (acoplamento, coesão e outras). Métricas de projeto (principais métricas, interpretação).", "34. Qualidade de Software Ementa: Visão geral de qualidade. Processo de software. Produto de Software. Qualidade de produto de software. Avaliação de qualidade de produto de software. Norma ISO 9126 para qualidade de produto. Avaliação de qualidade de processo de software. Melhoria de processo de software. Modelos Capability Maturity Model (CMM), Software Process Improvement and Capability Determination (SPICE) e Melhoria de Processo de Software Brasileiro (MPS.Br) para avaliação e melhoria de processo de software. Norma ISO 9000-3 -\"Diretrizes para Aplicação da ISO 9001 ao Desenvolvimento, Fornecimento e Manutenção de Software\" .Planejamento para melhoria de processo de software: gerenciamento de configuração, garantia de qualidade, planejamento e acompanhamento de projetos, gerenciamento de requisitos, gerenciamento de subcontratados.", "35. Rede de Computadores Ementa: Fundamentos: arquitetura de redes de computadores e modelos de referência (OSI e TCP/IP); serviços e protocolos de comunicação; desempenho de redes de computadores (atraso, perda e largura de banda); arquitetura geral da Internet. Camada de Aplicações:interface de programação de aplicações; prática de programação de aplicações em rede; a Web e o protocolo HTTP; serviço de transferência de arquivos (FTP); correio eletrônico (SMTP e protocolos de acesso ao correio); serviço de nomes (DNS); aplicações e redes peer-to-peer (P2P) e redes sobrepostas (overlay networks). Camada de Transporte: tipos de serviço da camada de transporte; multiplexação e demultiplexação; transporte orientado a conexões;transferência confiável de dados; controle de congestionamento; protocolos de transporte da Internet (UDP e TCP). Camada de Rede: comutação de pacotes; redes de datagramas e de circuitos virtuais; princípios de roteamento unicast e multicast; interconexão de redes; o protocolo IP. Camada de Enlace: enquadramento de dados; detecção e correção de erros;protocolos de acesso múltiplo; endereçamento na camada de enlace; redes Ethernet;comutadores e interconexão de redes; protocolo ponto-a-ponto (PPP); virtualização de enlaces (ATM e MPLS). Tópicos avançados: redes sem fio; redes e aplicações multimídia; segurança em redes; gerenciamento de redes.", "36. Segurança em Sistemas de Informação Ementa: Introdução a Segurança; Ameaças e Ataques; Estratégias de ataques e defesas;Vulnerabilidades em softwares, serviços e protocolos; Segurança nos serviços Internet;Técnicas de varredura; Técnicas de análise de vulnerabilidade; NAT; PROXY;Relacionamento das Aplicações com os Mecanismos de Segurança; Tipos e Arquitetura de Proteção; Firewalls; Políticas de Segurança, Criptografia; Normas de segurança; Gestão de riscos de Segurança; Conceitos de auditoria. Auditoria de sistemas e a área de SI. Avaliação de integridade e segurança de dados, de efetividade e de eficiência. Softwares de auditoria.", "37. Sistemas Operacionais Ementa: Conceitos de Hardware e Software ; Tipos de Sistemas Operacionais; Sistemas Multiprogramáveis; Estrutura do Sistema Operacional; Processo; Comunicação entre processos; Gerência do Processador; Gerência de Memória; Gerência de Dispositivos;Sistemas de Arquivos; Estudos de casos de sistemas operacionais atuais.38. Teoria Geral da Administração Ementa: Evolução do pensamento administrativo – as escolas de administração. A natureza da ação administrativa. Processos administrativos – planejamento, organização, direção e controle. Tendências da administração.", "39. Tópicos 1 Ementa: Abordagens de conteúdos ou temas relacionados à área computacional. A ementa e o plano de ensino serão definidos e aprovados de acordo com os conteúdos e temas propostos.40. Tópicos 2 Ementa: Abordagens de conteúdos ou temas relacionados à área computacional. A ementa e o plano de ensino serão definidos e aprovados de acordo com os conteúdos e temas propostos.", "41. Tópicos 3 Ementa: Abordagens de conteúdos ou temas relacionados à área computacional. A ementa e o plano de ensino serão definidos e aprovados de acordo com os conteúdos e temas propostos.42. Linguagem Brasileira de Sinais - Libras Ementa: Introdução às práticas de compreensão e produção em LIBRAS através do uso de estruturas e funções comunicativas elementares. Concepções sobre a Língua de Sinais. O surdo e a sociedade.ANEXO III DA RESOLUÇÃO – CEPEC Nº 1023", "SUGESTÃO DE FLUXO CURRICULAR 1º Período CHS Nature- Nú- Unidade Disciplina CHT Pré-requisito(s) za cleo Responsável TEO PRA", "Arquitetura de Computadores 64 3 1 - OBR NC INF Introdução à Programação 64 0 4 - OBR NC INF Introdução aos Sistemas de Informação 64 4 0 - OBR NE INF Lógica 64 4 0 - OBR NC INF Teoria Geral da Administração 64 4 0 - OBR NE FACE Carga Horária do Período: 320", "2º Período CHS CHT Nature- Nú- Unidade Disciplina Pré-requisito(s) za cleo Responsável TEO PRA", "Engenharia de Requisitos 64 4 0 - OBR NC INF Engenharia de Software 64 4 0 - OBR NC INF Fundamentos em Contabilidade 64 4 0 - OBR NE FACE Matemática Discreta 64 4 0 - OBR NC INF Programação Imperativa 64 2 2 Introdução à Programação OBR NC INF Carga Horária do Período: 320", "3º Período CHS Nature- Nú- Unidade Disciplina CHT Pré-requisito(s) za cleo Responsável TEO PRA", "Matemática Financeira 64 4 0 - OBR NE IME Estruturas de Dados 64 2 2 - OBR NC INF Programação Orientada a Objetos 96 2 4 Introdução à Programação OBR NC INF Sistemas Operacionais 96 4 2 - OBR NC INF Carga Horária do Período: 320 4º Período", "CHT CHS Nature- Nú- Unidade Disciplina Pré-requisito(s) Responsável za cleo TEO PRA", "Banco de Dados 1 64 2 2 OBR NE INF Ética, Computador e Sociedade 32 2 0 OBR NC INF Planejamento Estratégico 64 4 0 OBR NE FACE Programação para Web 96 1 5 Prog. Orientada a Objetos OBR NC INF Projeto de Software 64 4 0 OBR NC INF Carga Horária do Período: 320", "5º Período CHS Nature- Nú- Unidade Disciplina CHT Pré-requisito(s) Responsável za cleo TEO PRA", "Banco de Dados 2 64 3 1 Banco de Dados I OBR NE INF Construção de Software 64 0 4 OBR NE INF Gerência de Projetos 1 64 3 1 OBR NE INF Qualidade de Software 64 4 0 OBR NC INF Redes de Computadores 64 3 1 OBR NE INF Carga Horária do Período: 320", "6º Período CHS Nature- Nú- Unidade Disciplina Pré-requisito(s) Responsável CHT za cleo TEO PRA", "Aplicações Distribuídas 64 3 1 OBR NE INF Auditoria de Sistemas 64 4 0 OBR NE INF Gerência de Projetos 2 64 0 4 Gerência de Projetos I OBR NE INF Arquitetura de Software 64 4 0 OBR NC INF Gestão em Tecnologia da Informação 64 4 0 Planejamento Estratégico OBR NE INF Carga Horária do Período: 320 7º Período CHS Nature- Nú- Unidade Disciplina CHT Pré-requisito(s) Responsável za cleo TEO PRA", "Empreendedorismo 64 2 2 Planejamento Estratégico OBR NE INF Comunicação Empresarial 64 4 0 OBR NE FACOMB Interação Homem-Computador 64 2 2 OBR NE INF PFC1 32 OBR NE INF Segurança em Sistemas de Informação 64 3 1 OBR NE INF Tópicos 1 64 2 2 OBR NE INF Carga Horária do Período: 352", "8º Período CHS Natu- Nú- Unidade Disciplina CHT Pré-requisito(s) Responsável reza cleo TEO PRA", "Direito 64 4 0 OBR NE FD Gestão de Pessoas 64 4 0 OBR NE FACE Manutenção de Software 64 3 1 Engenharia de Software OBR NC INF PFC2 32 PFC1 OBR NE INF Tópicos 2 64 2 2 OBR NE INF Tópicos 3 64 2 2 OPT NE INF Linguagem Brasileira de Sinais - Libras 64 4 0 OPT NC FL Carga Horária do Período: 352", "Disciplinas Horas Porcentagem Núcleo Comum (NC) 1088 36,30% Núcleo Específico (NE) - Obrigatória 1536 51,20% Núcleo Específico (NE) - Optativa 64 2,10% Núcleo Livre (NL) 160 5,30% Atividades complementares 152 5120,00% Carga Horária Total 3000 100,00%", "Legenda CHT Carga horária total NC Disciplina do Núcleo Comum CHS Carga horária semanal NE Disciplina do Núcleo Específico TEO Carga didática teórica NL Disciplina do Núcleo Livre PRA Carga didática Prática OBR Disciplina Obrigatória OPT Disciplina Optativa"]}