{"title": "Resolucao_CEPEC_2017_1561(Ciência da Computação)", "paragraphs": ["SERVIÇO PÚBLICO FEDERAL UNIVERSIDADE FEDERAL DE GOIÁS RESOLUÇÃO – CEPEC Nº 1561 Aprova o Projeto Pedagógico do Curso de Graduação em Ciência da Computação, grau acadêmico Bacharelado, modalidade presencial, do Instituto de Informática da Regional Goiânia, para os alunos ingressos a partir de 2017.", "O VICE-REITOR, NO EXERCÍCIO DA REITORIA DA UNIVERSIDADE FEDERAL DE GOIÁS, AD REFERENDUM DO CONSELHO DE ENSINO, PESQUISA, EXTENSÃO E CULTURA, no uso de suas atribuições legais, estatutárias e regimentais, tendo em vista o que consta do processo nº 23070.012169/2016-64, e considerando:a) a Lei de Diretrizes e Bases da Educação Nacional - LDB (Lei 9.394/96);b) as Diretrizes Curriculares Nacionais para os Cursos de Graduação em Computação (Parecer CNE/CES Nº 136/2012;c) a Resolução CNE/CES para os Cursos de Computação;d) o Estatuto e o Regimento Geral da UFG;e) o Regulamento Geral dos Cursos de Graduação da UFG,", "R E S O LV E :Art. 1º Aprovar o Projeto Pedagógico do Curso de Graduação em Ciência da Computação, grau acadêmico Bacharelado, modalidade presencial, do Instituto de Informática – INF, Regional Goiânia da Universidade Federal de Goiás, na forma do Anexo a esta Resolução.", "Art. 2º Esta Resolução entra em vigor nesta data, com efeito para os alunos ingressos a partir do ano letivo de 2017, revogando-se as disposições em contrário.Goiânia, 7 de maio de 2018.Profª. Sandramara Matias Chaves - Vice-Reitora no exercício da Reitoria - ANEXO À RESOLUÇÃO – CEPEC Nº 1561", "PROJETO PEDAGÓGICO DO CURSO DE GRADUAÇÃO EM CIÊNCIA DA COMPUTAÇÃO - BACHARELADO UNIVERSIDADE FEDERAL DE GOIÁS Reitores no período:Prof. Orlando Afonso Valle do Amaral Prof. Edward Madureira Brasil", "Vice-Reitores no período:Prof. Manoel Rodrigues Chaves Profª. Sandramara Matias Chaves INSTITUTO DE INFORMÁTICA", "Diretores no período:Prof. Eduardo Simões de Albuquerque Prof. Sérgio Teixeira de Carvalho Vice-Diretores no período:Prof. Sérgio Teixeira de Carvalho Prof. Vinícius Sebba Patto", "Coordenadoras do Curso no período:Profª. Taciana Novo Kudo Profª. Elisângela Silva Dias Núcleo Docente Estruturante do Curso:Prof. Gustavo Teodoro Laureano Prof. Hebert Coelho da Silva Prof. Hugo Alexandre Dantas do Nascimento Prof. Leonardo Andrade Ribeiro Profa. Taciana Novo Kudo Prof. Thierson Couto Rosa (Presidente) Prof. Wellington Santos Martins", "Goiânia - GO 2016/2018 2 SUMÁRIO", "1 APRESENTAÇÃO DO PROJETO 4 2 EXPOSIÇÃO DE MOTIVOS 5 3 OBJETIVOS 6 3.1 Objetivo Geral 6 3.2 Objetivos Específicos 6 4 PRINCÍPIOS NORTEADORES PARA A FORMAÇÃO DO PROFISSIONAL 6 4.1 A Prática Profissional 7 4.2 A Formação Técnica 7 4.3 A Formação Ética e a Função Social do Profissional 8 4.4 A Interdisciplinaridade 8 4.5 A Articulação entre Teoria e Prática 9 5 EXPECTATIVA DA FORMAÇÃO DO PROFISSIONAL 9 5.1 Perfil do Curso 9 5.2 Perfil do Egresso 9 5.2.1 Características Gerais do Egresso 9 5.2.2 Competências do Egresso 10 5.2.3 Habilidades do Egresso 10 6 ESTRUTURA CURRICULAR 11 6.1 Matriz Curricular11 6.2 Componentes Curriculares Com Ementas e Bibliografias Básicas e Complementares 16 6.3 Sugestão de Fluxo Curricular 39 6.4 Atividades Complementares 41 7 POLÍTICA E GESTÃO DE ESTÁGIO CURRICULAR 41 8 TRABALHO DE CONCLUSÃO DE CURSO41 9 INTEGRAÇÃO ENSINO, PESQUISA E EXTENSÃO 42 9.1 Pesquisa 42 9.2 Pós-Graduação43 9.3 Extensão 43 10 METODOLOGIAS DE ENSINO E APRENDIZAGEM 44 11 SISTEMA DE AVALIAÇÃO DO PROJETO DE CURSO44 12 POLÍTICA DE QUALIFICAÇÃO DOCENTE E TÉCNICO-ADMINISTRATIVO DA UNIDADE ACADÊMICA 45 13 REQUISITOS LEGAIS E NORMATIVOS 45 13.1 Diretrizes Curriculares Nacionais do Curso 46 13.2 Diretrizes Curriculares Nacionais para Educação das Relações Étnico-Raciais e para o Ensino de História e Cultura Afro-Brasileira e Indígena 46 13.3 Disciplina LIBRAS 47 13.4 Políticas de Educação Ambiental 47 13.5 Diretrizes Nacionais para Educação em Direitos Humanos 48 13.6 Proteção dos Direitos da Pessoa com Transtornos do Espectro Autista 48", "3 1 APRESENTAÇÃO DO PROJETO O curso de Bacharelado em Ciências da Computação (BCC) do Instituto de Informática (INF) foi criado em 1983, com a primeira turma ingressante em 1984, e reconhecido pela portaria 431 do Ministério de Educação (MEC) em 1988. É o curso de Computação mais antigo da Universidade Federal de Goiás (UFG). O BCC influenciou a criação dos cursos de bacharelado em Ciência Computação nos Campi de Catalão e de Jataí da UFG, os quais, posteriormente, se tornaram cursos independentes. Também serviu de base para a criação do Programa de Pós-Graduação do INF em 2004 e para criação em 2008 dos cursos de Bacharelado em Sistemas de Informação e de Bacharelado em Engenharia de Software do INF.Atualmente, o BCC conta com uma oferta regular de 80 vagas por ano, sendo 40 vagas no primeiro semestre e 40 vagas no segundo semestre. A forma de ingresso no curso é através do Sistema de Seleção Unificada (SiSU) do Ministério da Educação (MEC). O curso tem obtido nota cinco no ENADE nas avaliações de 2008, 2011 e 2014 e nota quatro de Conceito Preliminar de Curso (CPC) do MEC em 2014.Este documento apresenta o novo Projeto Pedagógico de Curso do BCC. O documento faz a exposição dos objetivos do curso, dos princípios norteadores da profissão, perfil do egresso, a estrutura curricular, política de estágio, trabalho de conclusão de curso, integração entre ensino, pesquisa e extensão, as formas de avaliações adotadas no processo de ensino, além dos requisitos legais e normativos exigidos pelo MEC e orientados pela Pró- Reitoria de Graduação da UFG.O presente Projeto Pedagógico de Curso foi elaborado pelo Núcleo Docente Estruturante (NDE) do BCC, com a colaboração dos demais docentes do INF. Ele atualiza a visão pedagógica e finalística do curso, com maior ênfase na formação científica e no embasamento teórico, ao mesmo tempo em que conecta o curso às tendências modernas da Computação e às áreas de pesquisa acadêmica do INF. A estrutura curricular proposta neste PPC é composta por disciplinas específicas à formação em Ciência da Computação e por núcleos livres e disciplinas optativas que dão flexibilidade e formação aprofundada em áreas de interesse do aluno.", "Área de Conhecimento:Ciências Exatas e da Terra.Modalidade:Presencial.Nome do Curso:Bacharelado em Ciências da Computação.Grau Acadêmico:Bacharelado.Título a ser Conferido:Bacharel.Unidade Responsável pelo Curso:Instituto de Informática - INF.Carga Horária do Curso:3.332 horas.Turno de Funcionamento:Integral.", "4 Número de Vagas:80 vagas anuais, sendo 40 no primeiro semestre e 40 no segundo.Duração do Curso em Semestres (quantidade mínima e máxima em conformidade com a Resolução CNE/CES N2#2 02, de 18 de junho de 2007):O curso está organizado em 9 semestres (4 anos e meio), podendo ser concluído em um mínimo de 8 semestres (4 anos) e um máximo 17 semestres (8 anos e meio).Forma de Ingresso ao Curso:SiSU.", "2 EXPOSIÇÃO DE MOTIVOS A necessidade de reformulação do Projeto Pedagógico de Curso do BCC teve sua origem em alguns pontos considerados muito importantes, os quais são apresentados a seguir. necessidade de adequação do Projeto Pedagógico de Curso do BCC às Diretrizes Curriculares Nacionais (DCN) para os cursos de graduação em Computação aprovadas em 08 de Março de 2012--o Parecer CNE/CES N2#2 136/2012 do Ministério da Educação propõe carga horária mínima de 3.200 h para os cursos de Bacharelado em Ciência da Computação e o projeto pedagógico em vigor, adotado desde 2008, define o total de 3008h, o que atendia ao Parecer CNE/CES N2#2 8/2007, mas não atende ao novo parecer supracitado. Além disso, as referidas diretrizes indicam a necessidade de formação básica mais aprofundada em Matemática e em fundamentos de Computação para os cursos de bacharelado em Ciência da Computação, necessidades estas que o presente projeto visa atender; necessidade de adequação do conteúdo da Matriz Curricular aos conteúdos cobrados no Exame Nacional de Desempenho dos Estudantes (ENADE). Em uma análise detalhada, verificou-se a necessidade de modificação nas ementas das disciplinas da área de Matemática e Estatística que não contemplam conteúdos cobrados no ENADE. Além disso, existe a necessidade de inclusão da disciplina de Interação Humano-Computador (IHC), que atualmente não faz parte da Matriz Curricular; oportunidade de melhor definição do Perfil do Egresso de Ciência da Computação frente à nova conjuntura do INF, após o Programa de Reestruturação e Expansão das Universidades Federais (Reuni). O referido programa permitiu a criação de dois novos cursos no INF: Bacharelado em Engenharia de Software e Bacharelado em Sistemas de Informação. Com isso, surgiu a oportunidade de melhor adequar a Matriz Curricular e os Objetivos do Curso de Ciência da Computação ao perfil do egresso desejado (cientista da Computação), que inclui sólida formação em Computação e Matemática para contribuir com o desenvolvimento científico e tecnológico da Computação como atividade fim; adequação da Matriz Curricular com relação à iniciativa do INF de criar um Núcleo Básico Comum de disciplinas para os bacharelados em Ciência da Computação, Sistemas de Informação e Engenharia de Software. As Diretrizes Curriculares Nacionais para os cursos de graduação em Computação definem um conjunto de conteúdos básicos comuns que todos os cursos da área de computação devem ter. Visando adequar os seus cursos a esse conjunto de conteúdos, o INF formou uma comissão que definiu um conjunto de disciplinas básicas, denominado Núcleo Básico Comum, que os três cursos do Instituto deverão ter.Assim, também se justifica a necessidade de reformulação para que a Matriz do BCC seja adequada a esse conjunto de disciplinas;", "5  atualização do curso frente às novas tendências na área de computação. Após uma análise detalhada na Matriz Curricular atual, foi verificada a necessidade de inserção de conteúdos relacionados a novas tendências na área de Computação, como Processamento Paralelo e Interação Humano-Computador, dentre outros; introdução de um elenco de disciplinas optativas na grade curricular do BCC. A inclusão de disciplinas optativas é uma reivindicação que tem sido feita pelos alunos do curso e que pode ser atendida atualmente graças ao renovado quadro de docentes do INF com formação especializada em diferentes subáreas da Computação.", "Os motivos apresentados acima nortearam a elaboração do novo Projeto Pedagógico de Curso para o BCC.3 OBJETIVOS 3.1 Objetivo Geral O curso de BCC do INF tem por objetivo maior a formação de profissionais destinados a acelerar o desenvolvimento do Brasil, auxiliando o país a superar os seus diversos problemas e a colocá-lo na vanguarda do desenvolvimento científico e tecnológico por meio do avanço e da aplicação da Computação. Para tanto, o curso visa formar profissionais com sólidos conhecimentos em Computação, com visão crítica e espírito empreendedor.", "3.2 Objetivos Específicos  formar competências abrangendo diversos aspectos da Computação através do estímulo ao desenvolvimento de habilidades teóricas e práticas; fomentar autodisciplina, independência, e iniciativa para execução de projetos e consecução de metas propostas, assim como para aprimoramento e renovação do conhecimento de maneira autônoma e contínua; incentivar o perfil investigativo e criativo do estudante para pesquisa, produção e difusão do conhecimento científico-tecnológico; desenvolver no estudante espírito crítico, empreendedor e de liderança, assim como capacidade de trabalho colaborativo e interdisciplinar; aprimorar a habilidade de comunicação oral e escrita e de leitura, inclusive de textos na língua inglesa; estimular o engajamento do estudante no processo de ensino-aprendizagem; promover no estudante uma postura comprometida com a ética profissional, responsabilidade social e com o desenvolvimento do País.", "4 PRINCÍPIOS NORTEADORES PARA A FORMAÇÃO DO PROFISSIONAL O Projeto Pedagógico procura enquadrar-se na atual Lei de Diretrizes e Bases da Educação Nacional (Lei No 9394 de 20 de dezembro de 1996), e em particular no artigo 43 que trata das finalidades da educação superior. Sendo assim, busca: estimular o desenvolvimento do espírito científico e do pensamento reflexivo; formar profissionais aptos para a participação no desenvolvimento da sociedade brasileira;", "6  promover a divulgação de conhecimentos culturais, científicos e técnicos que constituem patrimônio da humanidade; estimular o gerenciamento das habilidades de administrar problemas da atualidade, em particular os nacionais e regionais.", "Este Projeto Pedagógico de Curso também leva em consideração as linhas gerais contidas na DCN para cursos de graduação em Computação mencionada anteriormente, bem como os currículos de referência da Sociedade Brasileira de Computação (SBC) de 2005 e da Association for Computer Machinery (ACM) de 2013 e a Portaria INEP N2#2 238, de 02/06/2014 que estabelece um conjunto de conteúdos, competências e habilidades esperados do aluno da área de Computação no ENADE. O presente Projeto Pedagógico está em conformidade com o Regulamento Geral dos Cursos de Graduação (RGCG) da UFG, aprovado pela Resolução CEPEC No 1122 de 09/11/2012.", "4.1 A Prática Profissional O profissional com embasamento teórico, científico e tecnológico em Ciência da Computação deve ter condições de aplicar esse conhecimento na solução de problemas de diversas áreas e também de se adaptar profissionalmente à constante evolução de sua própria área. O egresso do Curso pode prosseguir na vida acadêmica, através de programas de mestrado e doutorado, bem como atuar como pesquisador, participando de projetos de pesquisa científica e desenvolvimento tecnológico. As empresas que têm a Computação como atividade fim ou atividade meio constituem também área de atuação desse profissional. O egresso do curso de BCC pode atuar também como um agente transformador do mercado, propondo novas tecnologias ou aperfeiçoando as existentes, desenvolvendo projetos na área de Computação e Informática, ou atuando em cargos de gerência. Portanto, esse profissional está apto a atuar em diversos segmentos da sociedade pertinentes à Computação e à Informática. Podem atuar, ainda, como docente em instituições de ensino, como servidor público em diversos cargos de nível superior, e como empresário e empreendedor do setor de Informática.", "4.2 A Formação Técnica A construção de uma sólida formação técnico-científica concede uma visão sistêmica e crítica ao Bacharel em Ciências da Computação egresso e permite sua atuação na fronteira do conhecimento para contribuir com o desenvolvimento científico e tecnológico da Computação e com a sua aplicação no avanço de outras áreas. O egresso deve ser capaz de se adaptar com facilidade às frequentes modificações tecnológicas, caracterizadas pelo dinamismo da área de Ciência da Computação.A formação técnica do Bacharel em Ciências da Computação é composta por uma base caracterizada por disciplinas científicas e conteúdos tecnológicos específicos.As disciplinas de base científica são organizadas de forma a abranger o conhecimento das matérias nas áreas de Matemática, Estatística, Física, Eletrônica, Metodologia Científica, Computação e Sociedade, e fundamentos de computação.As disciplinas de base tecnológica estão relacionadas ao estudo de matérias relativas à formação profissional em Engenharia de Software, Banco de Dados, Redes de Computadores, Inteligência Computacional, Processamento Gráfico, Interação Humano- Computador, Computação Aplicada, e Sistemas de Computação.", "7 4.3 A Formação Ética e a Função Social do Profissional Durante o curso, o estudante deverá adquirir uma postura ética, aprendendo a trabalhar tanto individualmente quanto em equipe e entendo a importância de aplicar seus conhecimentos para o bem estar da sociedade, valorizando questões sociais, ambientais e culturais, além de questões políticas e econômicas. O futuro bacharel será preparado ainda para manter-se sempre atualizado e dominar novas tecnologias, assim como criar suas próprias soluções. Isto permitirá o desenvolvimento contínuo de soluções criativas e inovadoras, e a formação de um cidadão ético e consciente de suas responsabilidades.Para tanto, através da disciplina Computação e Sociedade, o estudante irá desenvolver uma visão crítica sobre a importância da área e sobre o papel dos diversos profissionais de Computação na sociedade. Serão discutidas as demandas de mercado, leis e normas relacionadas à Computação, além de questões éticas, raciais, ambientais, de saúde e de inclusão digital. Outras questões relevantes incluem: propriedade intelectual, software proprietário, software livre, segurança e privacidade, saúde ocupacional, regulamentação da profissão, e códigos de ética profissional.As demais disciplinas também oferecem oportunidades para discutir a ética e a função social do profissional. Além disso, o aluno poderá optar por disciplinas da área de ciências humanas dentro do elenco de disciplinas de núcleo livre.Adicionalmente, as ações de extensão também devem contribuir para a formação ética e para a função social do profissional. Tais ações fazem parte de um processo educativo, cultural e científico que, integrado ao ensino e à pesquisa, permitem reforçar a interação sinérgica da universidade com a sociedade.Por fim, as atividades extracurriculares como a participação em palestras, conferências e congressos são indispensáveis para o amadurecimento do aluno e são incentivadas ao longo do curso. O ambiente universitário oferece ainda diversas oportunidades de relações interpessoais, permitindo a discussão de questões políticas, humanísticas, filosóficas e sociais significativas para a vivência do futuro profissional.", "4.4 A Interdisciplinaridade As disciplinas de Metodologia Científica, Projeto de Final de Curso, assim como as várias disciplinas de Núcleo Livre contribuem para uma formação interdisciplinar e abrangente do aluno. Além disso, a participação sistemática em atividades complementares (palestras, conferências, seminários, cursos de curta duração) auxiliam na construção de uma formação sociocultural abrangente.A interdisciplinaridade também está presente nas atividades de pesquisa relacionadas ao curso de Ciência da Computação. Muitas dessas pesquisas são aplicadas e permitem que alunos de Iniciação Científica possam interagir com alunos, professores, e profissionais de outras áreas.A Pós-graduação é outro elemento importante para a formação interdisciplinar do profissional. Atualmente o Instituto de Informática oferece cursos de mestrado e doutorado em Ciência da Computação, os quais abrem espaço para o envolvimento de um grande número de alunos em diferentes projetos de médio e de longo prazos e com um vasto potencial temático de investigação. A oferta de cursos de especialização também é regular e tem reforçado a interação com o setor produtivo, gerando muitas oportunidades para os alunos em termos de estágio supervisionado.", "8 4.5 A Articulação entre Teoria e Prática A prática permite o envolvimento do aluno com problemas reais, passando este a atuar como sujeito da produção de conhecimento. A articulação entre teoria e prática é considerada como componente curricular que se insere no contexto programático das diversas disciplinas, adequando-se às suas necessidades específicas. A sua viabilização será efetivada por meio de oficinas, laboratórios, seminários e atividades de prática profissionais. Assim, as aulas práticas são indispensáveis para formação adequada do aluno, visto que os laboratórios retratam a realidade do ambiente em que o mesmo irá encontrar nas empresas.A prática também é considerada na participação do aluno nos projetos de pesquisa e de extensão do INF ou de outras unidades acadêmicas da UFG. Inclusive, tal participação, durante a formação do Bacharel em Ciências da Computação, é tida como essencial pelo INF e, portanto, altamente incentivada.Além dessas oportunidades, os alunos poderão conhecer a realidade de empresas da área através da realização de estágio supervisionado, o que permitirá aprofundar a relação teórico-prática.", "5 EXPECTATIVA DA FORMAÇÃO DO PROFISSIONAL 5.1 Perfil do Curso O curso de Bacharelado em Ciência da Computação fornece formação sólida em Computação e Matemática de modo a desenvolver nos egressos forte capacidade de abstração, modelagem e simulação de sistemas computacionais. O curso prepara os alunos para ingressarem em programas de Pós-Graduação e para prosseguir com carreira científica ou acadêmica ou, por outro lado, para atuarem no mercado de trabalho.", "5.2 Perfil do Egresso O egresso deve ter formação sólida em Computação, com profundo conhecimento teórico e prático. Ele deve atuar na fronteira do conhecimento para contribuir com o desenvolvimento científico e tecnológico da Computação e com a sua aplicação no avanço de outras áreas. O egresso deve ser capaz de se adaptar com facilidade às frequentes modificações tecnológicas, caracterizadas pelo dinamismo da área de Ciência da Computação.", "5.2.1 Características Gerais do Egresso  ter profundo conhecimento dos Fundamentos da Computação e formação sólida em Matemática, de modo a lhe conferir forte capacidade de abstração, modelagem, gerência e simulação de sistemas. Deve ter consciência das limitações da computabilidade e ter conhecimento sobre complexidade de algoritmos para analisar soluções de problemas tratáveis computacionalmente; conhecer a estrutura dos sistemas de Computação e os processos envolvidos na sua construção e análise; possuir visão crítica e inovadora sobre soluções, métodos e sistemas computacionais;", "9  possuir a capacidade de criar soluções para problemas complexos e multidisciplinares; ser criativo e inovador com respeito às oportunidades de negócio; ser capaz de se comunicar e desenvolver trabalhos em grupo; ter uma visão humanística e consistente sobre o impacto de sua atuação profissional na sociedade. O egresso deve refletir sobre a construção de sistemas de Computação e entender como eles atingem direta ou indiretamente as pessoas, as organizações e o meio ambiente.", "5.2.2 Competências do Egresso  conhecer e aplicar fundamentos teóricos, científicos e tecnológicos relacionados à área de computação; descrever a solução de problemas computacionais com o uso de algoritmos e embasamento científico; classificar problemas e propor soluções em função de sua computabilidade e complexidade; planejar, desenvolver e gerir projetos visando a construção de soluções com base científica e tecnológica, integrando os conhecimentos teóricos e práticos adquiridos ao longo de sua formação e utilizando metodologias que visem garantir critérios de qualidade ao longo de todas as etapas de desenvolvimento de uma solução computacional; desenvolver e implantar sistemas de comunicação de computadores; elaborar técnicas de representação, organização e armazenamento de dados; identificar e gerenciar os riscos que podem estar envolvidos na operação de equipamentos de computação (incluindo aspectos de dependabilidade e segurança); descobrir novas oportunidades para a aplicação e desenvolvimento de sistemas computacionais; empregar práticas apropriadas em um contexto ético, legal e profissional.", "Em termos gerais, o egresso poderá atuar profissionalmente em quaisquer atividades correlatas, ou afins, à Ciência da Computação, pois o currículo deste curso visa ensinar o aluno a pensar por ele próprio, buscar, explorar com ética e senso crítico suas próprias habilidades intelectuais, criativas e empreendedoras na sua intervenção profissional dentro da sociedade.", "5.2.3 Habilidades do Egresso O profissional de Ciência da Computação deve possuir: raciocínio lógico; capacidade de abstração; capacidade de síntese, de avaliação crítica e de análise; capacidade de comunicação oral e escrita; autodidaxia, ou seja, capacidade de aprender a aprender; adaptabilidade crítica ao novo para acompanhar a evolução tecnológica da computação; criatividade para inovar nas soluções de problemas e influenciar no estado da arte; pró-atividade; capacidade de exercer liderança e de trabalhar em grupo.", "10 6 ESTRUTURA CURRICULAR Nesta seção é apresentada a estruturação geral do curso de BCC. As disciplinas estão organizadas em dois grupos, conforme suas naturezas sejam obrigatória ou optativa, conforme previsto no Regulamento Geral dos Cursos de Graduação da UFG.As disciplinas de natureza obrigatória estão ainda organizadas em três núcleos:núcleo comum, núcleo específico e núcleo livre. As disciplinas do núcleo comum são disciplinas que compõem o Núcleo Básico Comum e, portanto, ocorrem nos três cursos do INF. As disciplinas do núcleo específico dão especificidade à formação do bacharel em Ciência da Computação. As disciplinas do núcleo livre visam promover a interdisciplinaridade e a transdisciplinaridade, possibilitar o aprofundamento de estudo em áreas de interesse do aluno e viabilizar o intercâmbio entre alunos de diferentes cursos da UFG. Por essas razões, são disciplinas de livre escolha do aluno.As disciplinas de natureza optativa também representam oportunidades de escolha do aluno dentro da grade curricular, permitindo-lhe aprofundar seus estudos em um tópico específico ou ter contato com diversos assuntos na área. Portanto, não há a ideia de ênfase por áreas no Curso.", "6.1 Matriz Curricular A Matriz curricular do curso de BCC está organizada em duas tabelas. A tabela 1 lista as disciplinas de natureza obrigatória, indicando as disciplinas que são do núcleo comum (NC), do núcleo específico (NE); as disciplinas atendem às diretrizes nacionais curriculares para os cursos de graduação Ciência da Computação--uma aula corresponde ao tempo de 60 minutos e o número de semanas por semestre é de 16. Na Tabela, constam ainda, a unidade da UFG responsável por cada disciplina, os relacionamentos de pré-requisitos e correquisitos entre elas e as cargas horárias teóricas, práticas e total.O aluno deve cursar obrigatoriamente quatro disciplinas optativas durante o Curso. A tabela lista as disciplinas optativas, a unidade responsável pelas disciplinas, os relacionamentos de pré-requisitos entre elas e suas cargas horárias.A disciplina Tópicos em Computação (linha 72 da tabela 2) é uma disciplina optativa, de tema e bibliografias variáveis cujo objetivo é o de dar ao curso e aos seus professores flexibilidade para ministrarem novos conteúdos que possam surgir devido à grande dinamicidade da área de Computação.", "11 Tabela 1: Disciplinas de Natureza Obrigatória Unid. CH Semestral Disciplinas Pré-Req. CHTot. Núcleo Natureza Resp. Teo. Prat.01 Álgebra Linear IME 64 0 64 NC OBR 02 Algoritmos e Estruturas de Dados 1 INF 26 32 32 64 NC OBR 03 Algoritmos e Estruturas de Dados 2 INF 2 64 0 64 NC OBR 04 Análise e Projeto de Algoritmos INF 21, 03 64 0 64 NC OBR 05 Arquitetura de Computadores INF 21 48 16 64 NC OBR 06 Banco de Dados INF 29 48 16 64 NC OBR 07 Cálculo 1A IME 96 0 96 NC OBR 08 Cálculo 2A IME 7 96 0 96 NE OBR 09 Cálculo Numérico IME 18 64 0 64 NE OBR 10 Circuitos Digitais EMC 21 64 0 64 NE OBR 11 Compiladores INF 03, 28 48 16 64 NE OBR 12 Computação e Sociedade INF 32 0 32 NC OBR 13 Computação Gráfica INF 22 32 32 64 NE OBR 14 Computação Paralela INF 39 48 16 64 NE OBR 15 Eletrônica para Computação EMC 20 96 0 96 NE OBR 16 Engenharia de Requisitos INF 16 48 64 NE OBR 17 Engenharia de Software INF 64 0 64 NC OBR 18 Equações Diferenciais Ordinárias IME 01, 08 64 0 64 NE OBR 19 Física I IF 7 64 0 64 NE OBR 20 Física III IF 19 64 0 64 NE OBR 21 Fundamentos de Matemática para Computação INF 64 0 64 NC OBR 22 Geometria Analítica IME 64 0 64 NE OBR", "12 Unid. CH Semestral Disciplinas Pré-Req. CHTot. Núcleo Natureza Resp. Teo. Prat.23 Inteligência Artificial INF 02, 29, 33 64 0 64 NE OBR 24 Interação Humano-Computador INF 02, 33 32 32 64 NC OBR 25 Introdução à Computabilidade e à Complexidade Computacional INF 04, 28 64 0 64 NE OBR 26 Introdução à Programação INF 48 80 128 NC OBR 27 Linguagens e Paradigmas de Programação INF 26 32 32 64 NC OBR 28 Linguagens Formais e Autômatos INF 21 64 0 64 NE OBR 29 Lógica Matemática INF 21 64 0 64 NC OBR 30 Matemática Discreta INF 21 64 0 64 NE OBR 31 Metodologia de Pesquisa em Computação INF 32 0 32 NE OBR 32 Pesquisa Operacional INF 1 64 0 64 NE OBR 33 Probabilidade e Estatística A IME 7 64 0 64 NC OBR 34 Programação Orientada a Objetos INF 26 32 32 64 NC OBR 35 Projeto de Software INF 17, 34 64 0 64 NC OBR 36 Projeto Final de Curso 1 INF 0 64 64 NE OBR 37 Projeto Final de Curso 2 INF 36 0 64 64 NE OBR 38 Redes de Computadores 1 INF 48 16 64 NE OBR 39 Sistemas Distribuídos INF 38 48 16 64 NE OBR 40 Sistemas Gerenciadores de Banco de Dados INF 6 64 0 64 NE OBR 41 Sistemas Operacionais INF 02, 05 64 0 64 NE OBR 42 Software Básico INF 2 0 64 64 NE OBR 43 Teoria dos Grafos INF 30 64 0 64 NE OBR", "13 Tabela 2: Disciplinas de Natureza Optativa Unid. CH Semestral Disciplinas Resp. Pré-Req. CHTot. Núcleo Natureza Teo. Prat.44 Aprendizagem de Máquina e Mineração de Dados INF 23 32 32 64 NE OPT 45 Armazém de Dados INF 40 48 16 64 NE OPT 46 Avaliação de Desempenho de Sistemas Computacionais INF 33 64 0 64 NE OPT 47 Banco de Dados Distribuídos INF 40 64 0 64 NE OPT 48 Computação Evolucionária INF 32 32 64 NE OPT 49 Computação Móvel e Ubíqua INF 34, 35 16 48 64 NE OPT 50 Computação Verde INF 38 32 32 64 NE OPT 51 Desenvolvimento de Sistemas para Web INF 34 32 32 64 NE OPT 52 Desenvolvimento de Software Dirigido por Modelos INF 02, 34 32 32 64 NE OPT 53 Empreendedorismo Digital INF 32 32 64 NE OPT 54 Engenharia de Sistemas INF 64 0 64 NE OPT 55 Engenharia de Software Baseada em Busca INF 17 32 32 64 NE OPT 56 Fundamentos da Programação Lógica e Funcional INF 27, 29 64 0 64 NE OPT 57 Integração de Dados INF 40 64 0 64 NE OPT 58 Introdução à Língua Brasileira de Sinais FL 64 0 64 NE OPT 59 Introdução à Teoria das Provas INF 29 64 0 64 NE OPT 60 Introdução à Teoria dos Tipos INF 29 64 0 64 NE OPT 61 Jogos Digitais INF 34 16 48 64 NE OPT 62 Meta-heurísticas INF 2 64 0 64 NE OPT 63 Metodologia e Experimentação em Engenharia de Software INF 64 0 64 NE OPT", "14 64 Microcontroladores INF 10, 26 32 32 64 NE OPT 65 Processamento Digital de Imagens INF 01, 26 64 0 64 NE OPT 66 Recuperação de Informação INF 02, 33 64 0 64 NE OPT 67 Redes de Computadores 2 INF 38 32 32 64 NE OPT 68 Redes Neuronais Artificiais INF 23 32 32 64 NE OPT 69 Segurança e Auditoria de Sistemas INF 38 32 32 64 NE OPT 70 Sistemas Multiagentes INF 34 32 32 64 NE OPT 71 Tópicos Avançados em Redes Sem Fio INF 16 48 64 NE OPT 72 Tópicos em Computação INF 64 0 64 NE OPT 73 Tópicos em Teste de Software INF 48 16 64 NE OPT 74 Verificação Formal de Programas INF 29 32 32 64 NE OPT 75 Visão Robótica INF 01, 65 64 0 64 NE OPT 76 Visualização de Informações INF 3 32 32 64 NE OPT 77 Web Semântica INF 34 32 32 64 NE OPT", "Tabela3: Quadro Resumo da Carga Horária Componentes Curriculares Carga Horária Percentual Núcleo Comum (NC) 1.152 34,57% Núcleo Específico Obrigatório 1.696 50,90% Núcleo Livre 128 3,84% Disciplinas Optativas 256 7,68% Atividades Complementares 100 3,00% Carga Horária Total 3.332 100%", "15 6.2 Componentes Curriculares com Ementas e Bibliografias Básicas e Complementares Disciplinas Obrigatórias do Núcleo Comum ÁLGEBRA LINEAR:Sistemas lineares e matrizes. Espaços vetoriais. Transformações lineares. Autovalores e autovetores. Espaços com produto interno.Bibliografia Básica:BOLDRINI, J. L.; COSTA, S. I. R; FIGUEIREDO, V. L; WETZLER, H. G. Álgebra Linear. 3ed. Harbra, São Paulo, 2003.LIPSCHUTZ, S. Álgebra Linear, 2ed. MaKron-Books, SãoPaulo, Brasil, 1974.CALLIOLI, C. A.; DOMINGUES, H. H; COSTA, R. C. F. Álgebra Linear e Aplicações. Atual, Brasil, 1983.Bibliografia Complementar:APOSTOL, T. Linear Algebra: A First Course with Applications to Differential Equations,1st ed. Wiley- Interscience, 1997.HOWARD, ANTON; RORRES, C.Álgebra Linear com Aplicações, 8 ed. Bookman, Porto Alegre, Brasil, 2001.HOFFMAN, KENNETH; KUNZE, R.Álgebra Linear.Polígono, SãoPaulo, 1971.LIMA, E. L. Álgebra Linear: Coleção Matemática Universitária . IMPA, RiodeJaneiro, Brasil, 2006.SHOKRANIAN, S. Introdução a Álgebra Linear e Aplicações, 1ed. Unb, 2004.", "ALGORITMOS E ESTRUTURAS DE DADOS 1:Noções de complexidade de algoritmos (notações de complexidade). Algoritmos de pesquisa: pesquisa sequencial e binária. Algoritmos de ordenação. Tipos abstratos de dados. Estruturas de dados utilizando vetores:pilhas, filas, listas (simples e circulares). Estruturas de dados com alocação dinâmica de memória: pilhas, filas, listas (simplesmente encadeadas, duplamente encadeadas e circulares).Bibliografia Básica:TENENBAUM, A. M., LANGSAM, Y., AUGENSTEIN, M., Estruturas de Dados Usando C, São Paulo , Makron Books, 1995.SZWARCFITER, J. L., MARKENZON, L., Estruturas de Dados e seus Algoritmos. LTC, 2a ediçaõ , 1994.FEOFILOFF, P.Algoritmos em Linguagem C. Editora Campus/Elsevier, 2009.Bibliografia Complementar:CORMEN, T. H. et al. Algoritmos: Teoria e Prática. Rio de Janeiro: Editora Campus, 2. ed., 2002.ZIVIANI, N. Projeto de Algoritmos com implementaçaõ em Javae C++. SãoPaulo: Editora Thomson, 2006.Sedgewick, R. \"Algorithms in C++ (Parts1-4), Addison-Wesley, 3. ed., 1998.SALVETTI, D. D.; BARBOSA, L. M. Algoritmos, MakronBooks, SãoPaulo, 1998.ZIVIANIN. Projeto de Algoritmos com implementaçaõ em Pascal e C. SãoPaulo: Editora Thomson, 3. ed. 2010.", "ALGORITMOS E ESTRUTURAS DE DADOS 2:Árvores: formas de representação, recursão em árvores, árvores binárias, árvores binárias de busca, árvores balanceadas (AVL e rubro-negras). Filas de prioridades. Heaps, Heapsort. Hashing: tipos de funções de hashing;tratamento de colisões. Definições de Grafos. Estruturas de Dados para representação de grafos. Algoritmos básicos em grafos.Bibliografia Básica:TENENBAUM, A. M.; LANGSAM, Y.; AUGENSTEIN, M. Estruturas de Dados Usando C. São Paulo: Makron Books, 1995.SZWARCFITER, J. L.; Markenzon, L. Estruturas de Dados e seus Algoritmos. 2a ediçaõ . LTC, 1994.FEOFILOFF, P. Algoritmos em Linguagem C. Editora Campus/Elsevier, 2009.Bibliografia Complementar:CORMEN, T. et al. Algoritmos: Teoria e Prática .2a ediçaõ , Rio de Janeiro: Editora Campus, 2002.ZIVIANI, N. Projeto de Algoritmos com implementaçaõ em Java e C++. São Paulo: Editora Thomson, 2006.SEDGEWICK, R. Algorithms in C++. 3rd. Edition , Addison-Wesley 1998. (Parts 1-4).SALVETTI, D.D.; BARBOSA, L.M. Algoritmos.São Paulo: Makron Books, 1998.ZIVIANI, N. Projeto de Algoritmos com implementaçaõ em Pascal e. C 3a ediçaõ . SãoPaulo: Editora Thomson, 2010.", "ANÁLISE E PROJETO DE ALGORITMOS:Medidas de complexidade, análise assintótica de limites de complexidade para algoritmos iterativos e recursivos, técnicas de prova de cotas inferiores. Corretude de Algoritmos. Exemplos de análise de algoritmos. Técnicas de projeto de algoritmos: dividir para conquistar, programação dinâmica, algoritmos gulosos. Introdução à NP- Completude.", "16 Bibliografia Básica:CORMEN, T. H.; LEISERSON, C. E.; RIVEST, R. L.; STEIN, C. Algoritmos: Teoria e Prática. 3a ediçaõ , Campus, 2012.BRASSARD, G; BRATLEY, P. Fundamentals of Algorithmics. Upper Saddle River, NJ : Prentice-Hall, Inc., 1996.PAPADIMITRIOU, C. H.; VAZIRANI, U. V.; DASGUPTA, S. Algoritmos. Mc-Graw-Hill, 2009.Bibliografia Complementar:BAASE, S.; GELDER, A. V. Computer Algorithms: Introduction to Design and Analysis. 3rd Edition. Pearson, 1999.SZWARCFITER, J. L.; MARKENZON, L. Estrutura de Dados e seus Algoritmos. 3a ediçaõ . LTC Editora , 2010.MAMBER, U. Introduction to Algorithms. Addison Wesley Publishing Company. 1989.SEDGEWICK, R., WAYNE, K. Algorithms. 4th edition. Addison-Wesley Professional, 2011.AHO, A.V., HOPCROFT, J.E., ULLMAN, J.D. The Design and Analysis of Computer Algorithms, Addison- Wesley Publishing Company, 1974.ISBN 0-201-00029-6.", "ARQUITETURA DE COMPUTADORES:Visão geral dos computadores modernos. Evolução da arquitetura dos computadores. Memória e representação da dados e instruções. Processador, ciclo de instrução, formato e endereçamento. Noções básicas de programação em linguagem de montagem. Dispositivos de entrada e saída. Sistemas de interconexão (barramentos). Interfaceamento e técnicas de entrada e saída. Hierarquia de memória. Introdução a arquiteturas paralelas e métricas de desempenho.Bibliografia Básica:TANENBAUM, A. Organização Estruturada de Computadores. Prentice Hal lBrasil, 2007.STALLINGS, W. Arquitetura e Organizaçaõ de Computadores. 5a ediçaõ . Prentice-Hall, 2010.BRYANT, R.; O’RALLARON, D. Computer Systems: A Programmer’s Perspective. 2nd Edition. Addison Wesley, 2010.Bibliografia Complementar:PATTERSON, D. A.; HENNESSY, J. L. Computer Organization and Design: The Hard- ware/Software Interface. 3rd edition. Morgan Kaufmann, 2007.WEBER, R.F. Fundamentos de Arquiteturas de Computadores. 2a Edição. Editora Sagra- Luzzatto, 2001.MONTEIRO, M. A. Introdução a Organização de Computadores. 4a.edição, RiodeJaneiro: Editora LTC, 2001.HENNESSY, J. L.; PATTERSON, D. A. Computer Architecture: A Quantitative Approach. 4th Edition. Elsevier, 2007.STALLINGS, W. Computer Organization and Architecture: Designing for Performance. 10th Edition. Saddle River, NJ, USA: Prentice-Hall, Inc., 2016.", "BANCO DE DADOS:Conceitos básicos de Banco de Dados. Modelo relacional. Linguagens para Banco de Dados: álgebra relacional, cálculo relacional e SQL. Modelo Entidade-Relacionamento e extensões. Mapeamento ER-relacional. Normalização.Bibliografia Básica:ELMASRI, R.; NAVATHE, S. B. Sistemas de Banco de Dados. 6. ed. Pearson-AddisonWesley, 2011.SILBERSCHATZ, A.;KORTH, H.F.; SUDARSHAN, S. Sistema de Banco de Dados. 5a ed., Rio de Janeiro: Ed.Campus, 2006.HEUSER, C. A. Projeto de Banco de Dados. 6a ediçaõ . Porto Alegre: Bookman, 2009.Bibliografia Complementar:RAMAKRISHNAN, R.; GEHRKE, J. Sistemas de Gerenciamento de Banco de Dados . Tradução da 3a ediçaõ .São Paulo: McGraw-Hill, 2008.GARCIA-MOLINA, H.; ULLMAN, J. D.; WIDOM, J. D. Database Systems: The Complete Book. 2nd edition.Prentice Hall, 2009.DATE, C. J. Introdução a Sistemas de Banco de Dados . Tradução da 8a ediçaõ americana . Rio de Janeiro: Ed.Campus, 2004.TEOREY, T.; LIGHTSTONE, S.; NADEAU, T. Projeto e Modelagem de Bancos de Dados. Rio de Janeiro:Editora Campus, 2007.CONNOLLY, T. M.; BEGG, C. E.; STRACHAN, A. D. Database systems: a practical approach to design, implementation and management. 3rd. Edition. Addison Wesley, 2010.", "CÁLCULO 1A:Números reais. Funções reais de uma variável real e suas inversas. Noções sobre cônicas. Limite e continuidade.Derivadas e aplicações. Polinômio de Taylor. Integrais. Técnicas de Integração. Integrais impróprias. Aplicações.Bibliografia Básica:GUIDORIZZI, H. L. Um Curso de Cálculo. LTC, Rio de Janeiro, Brasil, 2006. Volume1.LEITHOLD, L. O Cálculo com Geometria Analítica 3. ed.São Paulo: Harbra, 1994. Vol. 1.STEWART, J. Cálculo. 5a. ed. São Paulo: Cengage Learning, 2006. Volume 1.", "17 Bibliografia Complementar:FLEMMING, D. M; GONÇALVES, M. B. Cálculo A : Funções, limite, derivação e integração . São Paulo :Makrom Books do Brasil, 2006.HOFFMANN, L. D.; BRADLEY, G. L. Cálculo, Um curso moderno com aplicações, 9.ed. Rio de Janeiro: LTC, 2008.REIS, G. L; SILVA, V. V. Geometria Analítica. 2 ed. Rio de Janeiro: LTC, 1996.ÁVILA, G. S. S. Cálculo: Funções de Uma Variável. 7 ed. Volume 1. Rio de Janeiro: LTC, 1994.SIMMONS, G. F. Cálculo com Geometria Analítica, SãoPaulo: McGraw-Hill do Brasil,1987. Vol. 1.", "COMPUTAÇÃO E SOCIEDADE:História da computação. Estudo e análise de casos de aplicação de computadores na sociedade e para o meio ambiente. Subáreas da computação e áreas interdisciplinares. Importância e desafios da computação no Brasil e no mundo. Cursos de computação e aspectos profissionais: tipos de cursos, perfis profissionais, demanda do mercado, organizações e associações na área, regulamentação da profissão. Leis e normas relacionadas à Informática. Questões ambientais, raciais, de saúde e de inclusão digital relacionadas à Computação. Ética na Computação. Empresas de tecnologia da informação. Incubadoras de empresas.Bibliografia Básica:FONSECA FILHO , C. História da computação : O Caminho do Pensamento e da Tecnologia. Porto Alegre:EDIPUCRS, 2007.VELOSO, R. Tecnologias da Informaçaõ e Comunicaçaõ : Desafios e Perspectivas. SãoPaulo: Saraiva, 2011.MASIERO, P. Ética em Computação. Editora da USP, 2000.Bibliografia Complementar:KACZMARCZYK, L. C. Computers and Society: Computing for Good. Chapman & Hall/CRC Textbooks in Computing.CRC Press, 2011.CHALITA, G. Os Dez Mandamentos da É tica. Editora Nova Fronteira, 2003.DRUMMOND, V. Internet Privacidade e Dados Pessoais. Editora Lumen Juris, 2003.LUCCA, N.; FILHO, A .S. Direito &Internet. Editora Edipro, 2001.PAESANI, L. M. Direito de Informática. Editora Atlas, 2005.", "ENGENHARIA DE SOFTWARE:Requisitos de software. Projeto (design) de software. Construção de software. Teste de software. Manutenção de software. Gerência de configuração de software. Gerência de projeto de software. Processo de engenharia de software. Modelos e métodos de engenharia de software. Qualidade de software. Prática profissional de engenharia de software. Economia para engenharia de software. Fundamentos de engenharia.Bibliografia Básica:PRESSMAN, R.; MAXIM, B. Software Engineering: A Practitioner’s Approach. 8th edition.McGraw-Hill, 2014.SOMMERVILLE, I. Software Engineering, Pearson, 2015.WAZLAWICK, R. S. Engenharia de software: teoria e prática. Campus, 2013.Bibliografia Complementar:Software Engineering Body of Knowledge(SWEBOK), V3, IEEE, 2014.ISO/IEC/IEEE 24765, Systems and software engineering - Vocabulary, 2010, disponível em http://www.iso.org/iso/catalogue_detail.htm?csnumber=50518.MPS.BR. Melhoria de Processos do Software Brasileiro . Disponível em http ://www.softex.br/mpsbr/, último acesso Abril/2014.MAGELA, R. Engenharia de software aplicada. AltaBooks, 2006.Software Engineering Competency Model (SWECOM). IEEE. Disponível em https://www.computer.org/web/peb/swecom.", "FUNDAMENTOS DE MATEMÁTICA PARA COMPUTAÇÃO:Noções de lógica, Introdução a demonstrações, Indução matemática, Recursividade e Relações de Recorrência, Conjuntos e Combinatória. Séries e sequências. Relações e Funções. Representações numéricas e Mudança de base numérica.Bibliografia Básica:GERSTING, J. L. Fundamentos Matemáticos para a Ciência da Computac aõ ed. Rio de Janeiro: Editora LTC, 2004., ̧ 5.SCHEINERMAN, E. R. Matemática Discreta, Uma introduçaõ . Cengage Learning, Thompson Pioneira, 2003.GRIMALDI, R. P. Discrete and Combinatorial Mathematics - An Applied Introduction, 5th ed. Boston: Pearson - Addison-Wesley, 2003.Bibliografia Complementar:ROSS, K. A.; WRIGHT, C. R. B. Discrete mathematics, Prentice Hall, 1998.ROSEN, Kenneth H. Discrete Mathematics and Its Applications, 6th ed., Boston: McGraw-Hill, 2009.", "18 MATTSON, Jr. ,H. F. Discrete Mathematics with applications, New York: John Wiley & Sons 1993.SANTOS, J. P. O. Introdução à Teoria dos Números . Rio de Janeiro : CNPQ-IMPA, 2003. (Coleção Matemática Universitária).GONÇALVES, A. Introdução à Álgebra, 5. ed. Rido de Janeiro: CNPQ-IMPA, 2013.", "INTERAÇÃO HUMANO-COMPUTADOR:Aspectos gerais sobre interação humano-computador. Características humanísticas e biológicas, envolvendo questões sobre genealogia, gênero, aspectos étnicos, raciais e culturais, direitos e aspectos políticos, deficiências, limitações e capacidades, dentre outros. Ciclo da interação e principais problemas. Metas de usabilidade e experiência do usuário. Fatores humanos em software interativo: teoria, princípios e regras básicas. Modelos conceituais e metáforas. Estilos de interação. Elementos de interação (menus, formulários, manipulação direta e outros). Voz, linguagem natural, sons, páginas Web. Padrões para interface. Localização e internacionalização.Princípios de projeto de interfaces humano-computador. Métodos de projeto de interação. Projeto visual (cores, ícones, fontes e outros). Tempo de resposta e retroalimentação. Dispositivos de interação. Métodos de avaliação de interfaces: avaliação heurística, abordagens para testes realizados com apoio de usuários, técnicas de testes para páginas Web, entre outros. Visão geral de ferramentas de desenvolvimento de interfaces humano- computador.Bibliografia Básica:DIX, Alan; FINLAY, J. E.; ABOWD, G. D.; BEALE, R. Human-Computer Interaction.3rd Edition. Upper Saddle River, NJ, USA: Prentice-Hall, 2003.TIDWELL, J. Designing Interfaces: Patterns for Effective Interaction Design. 2. ed. O’Reilly, 2011.ROGERS, Y.; SHARP, H.; PREECE, J. Design de Interaçaõ - Além da Interação Homem - computador. 3a ed.Porto Alegre: Bookman, 2013.Bibliografia Complementar:BARBOSA, S. D. J.; SILVA, B. S. Interação Humano-Computador. 1. ed. Elsevier Editora, 2010.SCOTT, B.; NEIL, T. Designing Web Interfaces: Principles and Patterns for Rich Interactions. O’Reilly Media, 2009.JACKO, J. A. The human-computer interaction handbook: fundamentals, evolving technologies, and emerging applications. CRC Press, 2012.MACKENZIE, I. S. Human-computer Interaction–An Empirical Research Perspective. Morgan Kaufmann, 2013.LAZAR, J.; FENG, J. H.; HOCHHEISER, H. Research Methods in Human-Computer Interaction.Wiley, 2009.", "INTRODUÇÃO À PROGRAMAÇÃO:Introdução a algoritmos. Conceitos básicos de programas: constantes; tipos de dados primitivos; variáveis;atribuição; entrada e saída de dados; expressões; estruturas de decisão; estruturas de repetição. Ponteiro.Estruturas de dados homogêneas e heterogêneas: vetores, matrizes, cadeias de caracteres, registros.Subprogramas: funções; passagens de parâmetros por valor e por referência, recursividade. Manipulação de arquivos: abertura, fechamento, leitura e gravação. Tipos de acesso a arquivos: sequencial e indexado. Tipos de arquivos (texto e binário). Transcrição de algoritmos para uma linguagem de programação. Domínio de uma linguagem de programação: sintaxe e semântica; interpretação e compilação de programas; ambiente de desenvolvimento de programas; estilo de codificação; documentação de código; técnicas de depuração e técnicas de profiling; desenvolvimento e uso de bibliotecas.Bibliografia Básica:FOBERLONE, A. L. V.; EBERSPACHER, H. F., Lógica de Programaçã o: A construçaõ de algoritmos e estruturas de dados. 3. ed., São Paulo: Prentice Hall, 2005.ASCENCIO, A. F. G.; CAMPOS C , E. A. V. Fundamentos da Programaçaõ de Computadores . 3. ed. Editora Pearson, 2010.SCHILDT, H. C Completo e Total. 3a Ed. São Paulo: Makron Books, 1996.Bibliografia Complementar:FEOFILOFF, P. Algoritmos em Linguagem C. Editora Campus/Elsevier, 2009.FARRER, H. et al. Programação Estruturada de Computadores -Algoritmos Estruturados. 3. ed. Rio de Janeiro:LTC, 1989.SEDGEWICK, R. Algorithms in C. 3.ed. Reading, Mss: Addison-Wesley, 1998. ISBN 0201314525.SALVETTI, D. D.; BARBOSA, L. M. Algoritmos, São Paulo: Makron Books,1998.CORMEN, T. H et al., Algoritmos: Teoria e Prática. 2. ed. Rio de Janeiro: Editora Campus, 2002.", "LINGUAGENS E PARADIGMAS DE PROGRAMAÇÃO Estudo dos conceitos de linguagens de programação e dos paradigmas de programação: procedural, funcional, lógico, orientado a objeto e script. Reflexão sobre as características desejáveis em uma linguagem de programação e os critérios de seleção de linguagens de acordo com as especificidades dos domínios de aplicação. Descrição de sintaxe e semântica. Estudo sobre tipos de dados, estruturas de controle, ambientes de execução, variáveis, expressões e subprogramas em linguagens de programação.", "19 Bibliografia Básica:SEBESTA, R. W. Concepts of Programming Languages. 10th ed. Pearson, 2012.SCOTT, M. L. Programming Language Pragmatics, 3rd. ed.Morgan Kaufmann, 2009.GHEZZI, C.; JAZAYERI, M. Programming Language Concepts.3rd ed. Wiley, 1997.Bibliografia Complementar:PRATT, T. W. Z.; ELKOWIT, M. V. Programming Languages: Design and Implementation. 4th ed. Prentice Hall, 2000.VAREJÃO, F. Linguagens de Programaçaõ . 1. ed.Campus, 2004.ROY, P .V.; HARIFI, S. Concepts, Techniques, and Models of Computer Programming.1st ed. The MIT Press, 2004.FRIEDMAN, D. P. Essentials of Programming Languages.3rd ed.The MITPress, 2008.TURBAK, F.; GIFFORD D. Design Concepts in Programming Languages.1st ed. The MIT Press, 2008.", "LÓGICA MATEMÁTICA:Lógica Proposicional e de Predicados. Sistemas Dedutivos. Relações de Consequência. Correção e Completamento. Aplicações em Computação.Bibliografia Básica:SOUZA, J. N. Lógica para Ciência da Computação. 3. ed. Editora Campus, 2015.SILVA, F. C.; FINGER, M.; MELO, A. C. V .Lógica para Computação.Thomson Learning, 2006.HUTH, Michael; RYAN, Mark. Lógica em Ciência da Computação : modelagem e argumentaçaõ sobre sistemas .2. ed. Editora LTC, 2008.Bibliografia Complementar:MORTARI, C. Introdução à Lógica. São Paulo: UNESP. 2001.MENDELSON, E. Introduction to Mathematical Logic. Academic Press, 2000.ENDERTON, H. A. Mathematical Introductionto Logic. Academic Press, 2000.SMULLYAN, R. Lógica de Primeira Ordem. SÃO PAULO: UNESP, 2009.CASANOVA, M. A.; GIORNO, F. A. C.; FURTADO, A. L. Programação em Lógica e a Linguagem PROLOG .Edgard Blucher, 1987.GALLIER, J. H. Logic for Computer Science: Foundations of Automatic Theorem Proving. 2nd ed. Dover Publications Inc., 2015.", "PROBABILIDADE E ESTATÍSTICA A:Estatística descritiva. Noções sobre amostragem. Introdução à teoria de conjuntos. Introdução à teoria de probabilidade: espaço amostral, eventos, frequência relativa, fundamentos de probabilidade, probabilidade condicional, eventos independentes e teorema de Bayes. Variáveis aleatórias: conceitos básicos, esperança e variância. Distribuições discretas de probabilidade: uniforme, binomial e Poisson. Distribuições contínuas de probabilidade: uniforme, exponencial, normal e t-Student. Estimação pontual e intervalar para uma população:média e proporção. Teste de hipóteses para uma população: média e proporção. Correlação linear e regressão linear simples.Bibliografia Básica:WALPOLE, R. E.; MYERS, R. H.; MYERS, S. L.; YE, K.: Probabilidade e Estatística para En - genharia e Ciências. 8. Ed. São Paulo: Pearson, 2009.MAGALHÃES, M. N. Noções de Probabilidade e Estatística. 7a.ed. SãoPaulo: EDUSP, 2010.MEYER, P. L. Probabilidade: Aplicações à Estatística. Rio de Janeiro: LTC, 1969.Bibliografia Complementar:ROSS, S. Probabilidade. Um Curso Moderno com Aplicações. 8.ed. PortoAlegre: Bookman, 2010.MORETTIN, L. G. Estatística básica: probabilidade e inferência. São Paulo: Prentice Hall, 2010.DANTAS, C. A. B.; Probabilidade: um Curso Introdutório. 3. ed. São Paulo: EDUSP, 2008.BUSSAB, W. O.; MORETTIN, P. A. Estatística Básica.6.ed. São Paulo: Saraiva, 2010.TRIOLA, M. F. Introdução à Estatística. 10. Ed. Rio de Janeiro: LTC, 2008.", "PROGRAMAÇÃO ORIENTADA A OBJETOS:Abstração e tipos abstratos de dados. Classes, métodos, encapsulamento, interface. Mensagens, instâncias e inicialização. Herança e composição. Polimorfismo. Uso de uma linguagem orientada a objetos. Noções de UML. Noções de padrões de projeto orientado a objetos.Bibliografia Básica:ECKEL, B. Thinking in Java. Prentice Hall 3rd ed . 2002. ( livro eletrônico de acesso livre : disponível em http://www.mindview.net/Books/TIJ/).BORATTI, I. C. Programação orientada a objetos em Java. Visual Books, 2007.DEITEL, P. J; DEITEL, H. M. Java como programar 6.ed. São Paulo:Prentice Hall, 2005.", "20 Bibliografia Complementar:ZEIGLER, B. P. Objects and Systems: Principled Design with Implementations in C++ and Java. New York, NY, USA: Springer-Verlag, Inc., 1997.SANTOS, R. Introdução à Programação Orientada a Objetos com Java. Campus, 2003.BUDD, T. An Introduction to Object-Oriented Programming. Addison Wesley, 1996.HORSTMANN, C. S. Core Java – Advanced Features. 8. ed. Prentice Hall, 2008.(Volume II).GAMMA, E. Design patterns elements of reusable object-oriented software. Reading:Addison Wesley, 1995.", "PROJETO DE SOFTWARE:Fundamentos de design de software. Questões básicas de design de software: concorrência, controle e tratamento de eventos, persistência de dados, distribuição, tratamento de erro e exceção, tolerância a falhas, interação e apresentação, e segurança. Estrutura e arquitetura de software. Projeto de interface de usuário. Análise de qualidade e avaliação de design de software. Notação de design de software. Métodos e estratégias de design de software. Ferramentas de design de software.Bibliografia Básica:BUDGEN, B. Software Design. 2nd ed. Addison-Wesley, 2003.BASS, L. et al. Software Architecture in Practice. 3rd ed. Addison-Wesley, 2012.LARMAN, C. Utilizando UML e padrões : uma introduçaõ à análise e ao projeto orientados a objetos e ao desenvolvimento interativo. Bookman, 2008.Bibliografia Complementar GAMMA, E. Design patterns elements of reusable object-oriented software Reading: Addison Wesley, 1995.FREEMAN, E. et al. Use a cabeça!: padrões de projetos (design patterns). Alta Books, 2007.BOOCH, G. UML guia do usuário : o mais avançado tutorial s obre Unified Modeling Language (UML).Elsevier, 2006.NYGARD, M. Release It!: Design and Deploy Production-Ready Software. Pragmatic Bookshelf, 2007.(The Pragmatic Programmers).FOWLER, M. Patterns of enterprise application architecture. Addison-Wesley, 2003.", "Disciplinas Obrigatórias do Núcleo Específico CÁLCULO 2A:Sequências e séries numéricas. Séries de potência, convergência. Funções de várias variáveis. Limite e Continuidade. Noções sobre quádricas. Funções diferenciáveis. Derivadas parciais e direcionais. Polinômio de Taylor. Máximos e mínimos. Integrais múltiplas. Mudança de Coordenadas. Aplicações.Bibliografia Básica:ÁVILA, G. S. S. Cálculo: Funções de Uma Variável. 7 ed. Rio de Janeiro: LTC, 2003. volume 2.ÁVILA, G. S. S. Cálculo: Funções de Várias Variáveis. 7 ed. Rio de Janeiro: LTC, 2003. Volume 3.STEWART, J. Cálculo, vol. 2. São Paulo: Cengage Learning, 2006.Bibliografia Complementar:SWOKOWSKI, E. W. Cálculo com Geometria Analítica. São Paulo: McGraw-Hill do Brasil, 1983. Volume 2.HOFFMANN, L. D.; BRADLEY, G. L. Cálculo, Um curso moderno com aplicações . 9. ed. Rio de Janeiro:LTC, 2008.FLEMMING, D. M; GONÇALVES, M. B. Cálculo B: funções de várias variáveis , integrais múltiplas, integrais curvilíneas e de superfície. São Paulo: Pearson Prentice Hall, 2007.THOMAS, G. B. Cálculo. 10 ed. São Paulo: Pearson, 2002. Volume 2.REIS, G. L; SILVA, V. V. Geometria Analit́ ica. 2 ed. Rio de Janeiro: LTC, 1996.", "CÁLCULO NUMÉRICO:Cálculo de raízes de equações. Resolução de sistemas lineares, métodos diretos e métodos iterativos.Interpolação e integração. Resolução numérica de equações diferenciais.Bibliografia Básica:CAMPOS FILHO, F. F. Algoritmos Numérico. 2. ed. Rio de Janeiro: LTC, 2007.FRANCO, N. B. Cálculo Numérico. São Paulo: Pearson Prentice Hall,2007.RUGGIERO, M. A. G.; LOPES, V. L. R. Cálculo Numérico : Aspectos teóricos e computacionais . 2. ed. São Paulo: Makron Books, 1996.Bibliografia Complementar:ARENALES, S. H. V.; DAREZZO FILHO, A. Cálculo Numérico. São Paulo: Thomson Lear- ning, 2008.BURDEN, R. L.; FAIRES, J. D. Análise Numérica.São Paulo: Cengage Learning, 2003.BURIAN, R.; LIMA, A. C. Cálculo Numérico. Rio de Janeiro: LTC, 2007.KINCAID, D.; WARD, C. Numerical Analysis:mathematics of scientific computing. Brooks/Cole-Thomson Learning, 1991.SPERENDIO, D.; MENDES, J. A. T. S. L. H. M. Clculo Numérico : características matemáticas e computacionais dos métodos numéricos. São Paulo: Prentice Hall, 2003.", "21 CIRCUITOS DIGITAIS:Álgebra booleana e portas lógicas. Introdução a Circuitos Combinacionais, Circuitos Seqüenciais e Famílias Lógicas de Circuitos Integrados. Técnicas de minimização e síntese de Circuitos Combinacionais e Circuitos Seqüenciais. Conversores Analógico-Digitais e Digitais-Analógicos. Dispositivos de memória.Bibliografia Básica:TOCCI, R. J.; WIDMER, N. S.; MOSS, G. L. Sistemas Digitais – Princípios e Aplicações . 11 Ed. São Paulo:Pearson Prentice Hall, 2011.MANO, M.; KIME, C. Logic & Computer Design Fundamentals. 5th ed. Pearson, 2015.MENDONÇA, A.; ZELENOVSKY, R. Eletrônica Digital: Curso Práticoe Exercić ios. MZ Editora Ltda, 2004.Bibliografia Complementar:VAHID, F. Digital Design with RTL Design, VHDL, and Verilog. 2nd ed. New Jersey, USA: John Wiley & Sons, Inc, 2011.WAGNER, F. R.; REIS, A. I.; RIBAS, R. P. Fundamentos de Circuitos Digitais . Editora Sagra Luzzato , 2006.(Série Livros Didáticos do Instituto de Informática da UFRGS - Vol. 17).ERCEGOVAC, M.; LANG, T.; MORENO, J. H. Introdução aos Sistemas Digitais. Editora Bo- okman, 2000.FLOYD,TL. Sistemas Digitais – Fundamentos e Aplicações, 9.ed. Editora Bookman, 2007.COSTA, Cesar da. Projetos de Circuitos Digitais com FPGA. São Paulo: Novatec, 2016.", "COMPILADORES:A estrutura de um compilador. Análises léxica e sintática. Definições dirigidas por sintaxe e análise semântica.Organização da tabela de símbolos. Representação intermediária do programa-fonte. Geração do código-objeto da compilação. Introdução à otimização do código-objeto. Implementação de um compilador.Bibliografia Básica:AHO, A. V; LAM, M. S.; SETHI, R.; ULLMAN, J. D. Compiladores - Princípios, técnicas e ferramentas. 2 ed.Pearson-Addison-Wesley; 2008.LOUDEN, K. C. Compiladores – Princípios e Práticas. Editora Thompson, 2004.APPEL, A. W. Modern Compiler Implementation in C - Basic Techiniques.Cambridge University Press, 1997.Bibliografia Complementar:APPEL, A. W. Modern Compiler Implementation in Java.2nd. edition. New York: Cambridge University Press, 2002.HOLMES, J. Modern Compiler Implementation in Java. Prentice Hall, 1995.MUCHNICK, S. S. Advanced Compiler Design and Implementation. Morgan Kaufmann, 1997.HANSON, D. R.; FRASER, C. W. A Retargetable C Compiler: Design and Implementation. Benjamin Cummings Pub., 1995.LEBLANC, R. J.; FISCHER, C. N. Crafting a Compiler with C. Benjamin/Cummings, 1991.", "COMPUTAÇÃO GRÁFICA:Origem e objetivos da Computação Gráfica. Dispositivos Vetoriais x Matriciais. Dispositivos de entrada e saída.Sistemas e equipamentos gráficos. Algoritmos para conversão matricial e preenchimento de primitivas gráficas.Transformações geométricas bi-dimensionais e tri-dimensionais. Transformações de projeção paralela e perspectiva. Recorte e seleção bi-dimensional. Curvas e Superfícies. Representação e Modelagem; Modelos de cor. Visualização tridimensional: iluminação, eliminação de linhas superfícies escondidas, modelos de tonalização (“shading”). Aplicação de texturas. Animação. Noções de processamento digital de imagens.Bibliografia Básica:FOLEY, J. D. at al. Computer Graphics: Principles and Practices, Addison Wesley, 1993.AZEVEDO, E.; CONCI, A. Computação Gráfica: Geração de Imagens. Rio de Janeiro: Editora Campus, 2003.HETEM, A. J., Computação gráfica. Rio de Janeiro: LTC, 2006.Bibliografia Complementar:AZEVEDO, E.; LETA, F. R; CONCI, A. Computação gráfica: teoria e prática. 2. ed.Rio de Janeiro: Elsevier, 2008.AMMERAAL, L. Computação gráfica para programadores Java 2. ed.Rio de janeiro: LTC, 2008.BAKER, M. P.; HEARN, D. Computer graphics with OpenGL. 3rd ed. Upper Saddle River, NJ: Pearson Prentice Hall, 2004.RIBEIRO, M. M. Uma breve introduçaõ à computaçaõ gráfica. Rio de Janeiro, RJ: Ciência Moderna, 2010.ROGERS, D. Procedural Elements for Computer Graphics. Mc-Graw-wHill, 1997.", "COMPUTAÇÃO PARALELA:Fundamentos da computação paralela. Classificação de computadores. Métricas de avaliação de desempenho de programas paralelos. Projeto e análise de algoritmos paralelos. Programação paralela com memória compartilhada. Programação paralela com memória distribuída.", "22 Bibliografia Básica:GRAMA, A.; KUMAR, V.; GUPTA, A.; KARYPIS, G.: An Introduction to Parallel Computing, Design and Analysis of Algorithms, 2.ed. Addison-Wesley, 2003.PACHECO, P. An Introduction to Parallel Programming.Kaufmann Publishers, 2011.KIRK, D.; HWU, W. Programming Massively Parallel Processors: A Hands On Approach. 2nd ed. Morgan Kaufmann Publishers, 2012.Bibliografia Complementar:MATTSON, T.; SANDERS, B.; MASSINGILL, B. Patterns for Parallel Programming.Addison-Wesley, 2004.GROPP, W.; et al. Using MPI: Portable Parallel Programming with the Message-Passing In- terface. 3rd ed. The MIT Press, 2014.MCCOOL, M.; REINDERS, J.; ROBISON, A.: Structured Parallel Programming Patterns for Efficient Computation. Morgan Kaufmann, 2012.CHAPMAN, B.; JOST, G.; PAS, A. V. der. Using Open MP.The MIT Press, 2007.COOK, S. CUDA Programming: A Developer’s Guide to Parallel Computing with GPUs. Morgan Kaufmann, 2013.", "ELETRÔNICA PARA COMPUTAÇÃO:Elementos de circuitos elétricos. Grandezas de corrente e tensão elétrica. Leis de Kirchhoff. Métodos de análise de circuitos resistivos. Teoremas de circuitos. Capacitor e indutor como elemento de circuito. Análise de circuitos elétricos em regime permanente senoidal com fasores e operador de Laplace ('s'). Amplificadores Operacionais: Circuitos básicos. Junção PN. Diodos. Transistor Bipolar de Junção (TBJ). Transistor de Efeito de Campo (FET e MOSFET). Fontes Reguladas.Bibliografia Básica:SADIKU, M. N.; MUSA, S.; ALEXANDER, C. K. Análise de circuitos elétricos com aplicações. Porto Alegre:AMGH (McGraw-Hill - Bookman), 2014. 616p.IRWIN, J. D. Análise Básica de Circuitos para Engenharia. 10ed. SãoPaulo: LTC, 2013. 700 p.SEDRA, A. S.; SMITH, K. C. Microeletrônica. 5a ed. São Paulo: Ed. Pearson do Brasil, 2007. 864 p.Bibliografia Complementar:SVOBODA, J. A.; DORF, R. C. Introdução aos Circuitos Elétricos. 8a ed. São Paulo: LTC, 2012. 836 p.BURIAN JÚ NIOR, Yaro; LYRA, A. C. C. Circuitos Elétricos. 1a ed. São Paulo: Ed. Pearson do Brasil, 2006.JOHNSON, D. E., HILBURN, J. L., JOHNSON, J. R. 4a ed. Fundamentos de Análise de Cir - cuitos Elé tricos.São Paulo: LTC, 1993.BOYLESTAD, R. L.; NASHELSKY, L. Dispositivos Eletrônicos e Teoria dos Circuitos . 11. ed. São Paulo: Ed.Pearson do Brasil, 2013.PERTENCE JÚ NIOR, Antonio. Amplificadores operacionais e filtros ativos : eletrônica ana- lógica. 8. ed. Porto Alegre: Bookman, 2015. 328p. (Série Tekne).", "ENGENHARIA DE REQUISITOS:Definição de Engenharia de Requisitos (ER). Perspectivas. Definição e Tipos de Requisitos. Processo de ER.Ferramentas para apoio a ER. Normas e padrões aplicados a ER.Bibliografia Básica:SOMMERVILLE, I. Engenharia de Software. 9. ed. Sao Paulo: Pearson Prentice Hall, 2011.PRESSMAN, R. S. Engenharia de Software: uma abordagem profissional. 7. ed. Porto Alegre: McGraw-Hill, 2011.PFLEEGER, S. L. Engenharia de software: teoria e prática. 1. ed. São Paulo: Prentice Hall, 2004.Bibliografia Complementar:KOTONYA, G.; SOMMERVILLE, I. Requirements Engineering: Process and Techniques. 2. ed. Chichester:John Wiley & Sons, 1998.LARMAN, C. Utilizando UML e padrões : uma introduçaõ à análise e ao projeto orientados a objetos e ao desenvolvimento interativo. 3. ed. Porto Alegre: Bookman, 2007.SWEBOK v3.0. Guide to the Software Engineering Body of Knowledge Version 3.0. Editado por IEEE Computer Society. Disponível em http://www.swebok.org/.WIEGERS, K. E. Software requirements: practical techniques for gathering and managing requirements throughout the product development cycle. 2 ed. Redmond, Wash: Microsoft Press, 2003.FILHO, W. P. P. Engenharia de Software: fundamentos, métodos e padrões. 3a ed. Rio de Janeiro: LTC, 2009.", "EQUAÇÕES DIFERENCIAIS ORDINÁRIAS:Equações diferenciais ordinárias de primeira ordem lineares e não lineares. Sistemas lineares de equações diferenciais ordinárias. Equações diferenciais ordinárias de ordem superior. Aplicações.Bibliografia Básica:BOYCE, W. E.; DIPRIMA, R. C. Equações diferenciais Elementares e Problemas de Valores de Conto rno. Rio de Janeiro: LTC, 2007.DE FIGUEIREDO , D. G.; NEVES, A. Equações Diferenciais Aplicadas . São Paulo : IMPA, 2001. ( Coleção Matemática Universitária).ZILL, D. G. Equações Diferenciais com aplicações em modelagem. São Paulo: Pioneira Thomson Learning, 2003.", "23 Bibliografia Complementar:AYRES JR, F. Equações Diferenciais. Rio de Janeiro: Makron Books, 1994.BASSANEZI, RODNEY C.; FERREIRA JR., W. C. Equações Diferenciais com Aplicações . São Paulo: Harbra, 1988.CODDINGTON, E. A. An Introduction to Ordinary Differential Equations. New York: Dover Plublications, Inc., 1989.LEIGHTON, W. Equações Diferenciais Ordinárias. Rio de Janeiro: Livros Técnicos e Científicos S.A, 1978.ZILL, D. G. Equações Diferenciais. 3 ed. São Paulo: Makron Books, 2001. Volume 1.ZILL, D. G. Equações Diferenciais, 3 ed. São Paulo: Makron Books, 2001. Volume 2.", "FÍSICA I:Unidades, grandezas físicas e vetores. Cinemática da partícula. Leis de Newton do movimento. Trabalho e energia cinética. Energia potencial e conservação da energia. Momento linear, impulso e colisões. Cinemática da rotação. Dinâmica da rotação de corpos rígidos. Equilíbrio e elasticidade.Bibliografia Básica:YOUNG, H. D.; FREEDMAN, R. A. Física I: Mecânica, v. 1. São Paulo: Addison Wesley.HALLIDAY, D.; RESNICK, R.; WALKER, J. Fundamentos de Física: Mecânica, 1. Rio de Janeiro: LTC.NUSSENZVEIG, H. M. Curso de Física Básica: Mecânica, v. 1. São Paulo: Ed. Edgard Blü- cher Ltda.Bibliografia Complementar:TIPLER, P. A.; MOSCA, G. Física para c ientistas e engenheiros : Mecânica, Oscilações e Ondas , Termodinâmica, v. 1. Rio de Janeiro: LTC.CHAVES, A.; SAMPAIO, J. L. Física Básica: Mecânica, v. 1. São Paulo: LTC.ALONSO, M.; FINN, E. J. Física: um curso universitário, v. 1. São Paulo: E. Blucher.LUIZ, A. M. Problemas de Física, v. 1. Rio de Janeiro: Guanabara Dois.MCKELVEY, J. P. Física, v. 1. São Paulo: Harbra.SEARS, F. W.; ZEMANSKY, M. W.; YOUNG, H. D. Física, v.1.Rio de Janeiro: LTC.SERWAY, R. A.; JEWETT JUNIOR, J. W. Princípios de Fiś ica, v. 1. São Paulo: Thomson.", "FÍSICA III:Carga elétrica e campo elétrico. Lei de Gauss. Potencial elétrico. Capacitância e dielétricos. Corrente e circuitos elétricos. Campo magnético e força magnética. Fontes de campo magnético. Indução eletromagnética.Indutância. Corrente alternada.Bibliografia Básica:YOUNG, H. D.; FREEDMAN, R. A. Física III: Eletromagnetismo, São Paulo: Addison Wesley, 2008. Volume 3.HALLIDAY, D.; RESNICK, R.; WALKER, J. Fundamentos de Física : Eletromagnetismo. Rio de Janeiro: LTC.1996. Volume 3.NUSSENZVEIG, H. M. Curso de Física Básica : Eletromagnetismo. São Paulo: Ed. Edgard Blücher Ltda, 1996.Volume 3.Bibliografia Complementar:TIPLER, P. A. Física para cientistas e engenheiros : Eletricidade e Magnetismo, Ótica 5. ed. Rio de Janeiro:LTC, 2006. Volume 2.CHAVES, A.; SAMPAIO, J. L. Física Básica: Eletromagnetismo. São Paulo: LTC, 2007.ALONSO, M.; FINN, E. J. Física: um curso universitário. SãoPaulo: E. Blucher, 2002. Volume 2.LUIZ, A. M. Problemas de Fiś ica. Rio de Janeiro: Guanabara Dois, 1980. Volume 3.MCKELVEY, J. P. Física. São Paulo: Harbra, 1979. Volume 3.", "GEOMETRIA ANALÍTICA:Matrizes. Determinantes. Sistemas lineares. Vetores. Retas e planos. Curvas. Cônicas. Superfícies cônicas e cilíndricas. Superfícies quádricas.Bibliografia Básica:REIS, G. L; SILVA, V. V. Geometria Analítica. São Paulo: LTC,1993.STEINBRUCH, A.; WINTERLE, P. Geometria Analítica. São Paulo: Mc-Graw-Hill, 1987.OLIVEIRA, I. C.; BOULOS, P. Geometria Analítica: um tratamento vetorial. SãoPaulo: Pearson/ Prentice Hall, 2005.", "Bibliografia Complementar:SWOKOWSKI, E. W. Cálculo com Geometria Analítica , vol. 1. São Paulo : McGraw-Hill do Brasil, 1983.Volume 1.LEITHOLD, L. O Cálculo com Geometria Analítica, 3 ed. São Paulo: Harbra, 1994. Volume 1.BOULOS, P.; CAMARGO, I. Introdução à geometria analítica no espaço. Makron Books do Brasil, 1997.SIMMONS, G. F. Cálculo com Geometria Analítica. SãoPaulo: McGraw-Hill do Brasil,1987. Volume1.", "24 CARVALHO, P. C. P. Introdução à Geometria Espacial . Rio de Janeiro : SBM, 2005. (Coleção do Professor de Matemática).INTELIGÊNCIA ARTIFICIAL:Visão geral da Inteligência Artificial e suas aplicações. Representação do conhecimento. Resolução de problemas por meio de buscas. Incerteza. Lógica Fuzzy. Aprendizado de máquina. Aplicações práticas utilizando técnicas de Inteligência Artificial.Bibliografia Básica:RUSSELL, S; Norvig, P. Inteligência Artificial. 3 ed. Ed. Campus, 2013.LUGER, G. F. Inteligência Artificial. 6 ed. Editora Pearson, 2014.FACELI, K.; LORENA, A. C.; GAMA, J.; CARVALHO, A. C. P. L. F. Inteligência Artificial: Uma Abordagem de Aprendizado de Máquina. LTC, 2011.Bibliografia Complementar:COPPIN, B. Inteligência Artificial, LTC, 2010.COSTA, E.; Simões, A. Inteligência Artificial: Fundamentos e Aplicações. 2 ed. FCA, 2008.ROSA,J. L. G. Fundamentos da Inteligência Artificial. LTC, 2011.NILSSON, N. Artificial Intelligence: a new synthesis. Morgan Kaufmann, 1998.RICH, E.; KNIGHT, K.; Nair, S. B. Artificial Intelligence.3ed. Tata McGraw-Hill, 2009.", "INTRODUÇÃO À COMPUTABILIDADE E À COMPLEXIDADE COMPUTACIONAL:Noções de computabilidade efetiva. Modelos de computação. Tese de Church-Turing. Decidibilidade.Redutibilidade. Problemas indecidíveis. Complexidade de tempo. Complexidade de Espaço. Teoremas de incompletude de Gödel.Bibliografia Básica:SIPSER, M. Introduction to the theory of computation.USA: Cengage Learning, 2013.HOPCROFT, J. E.; MOTWANI, R.; ULLMAN, J. D. Introdução à teoria de autômatos , linguagens e computação. Campus, 2002.LEWIS, H. R.; PAPADIMITRIOU, C. H. Elementos de teoria da computaça.õ 2. ed.Porto Alegre: Bookman, 2000.Bibliografia Complementar:GAREY, M.; JOHNSON, D. Computers and intractability: a guide to the theory of NP- completeness. W. H.Freeman and Company, 1979.KOZEN, D. Theory of computation. London: Springer, 2006.KOZEN, D. Automata and computability.Springer-Verlag, 1997.CARNIELLI, W. A.; EPSTEIN, R. L. Computabilidade: funções computáveis , lógica e os fundamentos da matemática. 2. ed. Unesp, 2009.BALCÁZAR, J.; DIAZ, J.; GABARRÓ, J. Structural complexity I. 2nd ed. Springer, 1994.(In Text in Theoretical Computer Science EATCS Series).", "LINGUAGENS FORMAIS E AUTÔMATOS:Conceitos básicos de linguagens. Mecanismos geradores (gramáticas) e reconhecedores (determinísticos e não determinísticos) de linguagens regulares, livres de contexto e sensíveis ao contexto; relação entre estas classes de linguagens e suas principais propriedades. Hierarquia de Chomsky.Bibliografia Básica:SUDKAMP, T. A. Languages and machines. 3. ed. Addison Wesley, 2006.SIPSER, M. Introduction tot he theory of computation. ITP, 1997.HOPCROFT, J.E.; MOTWANI, R.; ULLMAN, J. D. Introdução à teoria de autômatos : linguagens e computação. Campus, 2002.Bibliografia Complementar:RAMOS, M. V. M.; NETO, J. J.; VEGA, I.S. Linguagens formais: teoria, modelagem e implementação.Bookman, 2009.CARROLL, J.; LONG D. Theory of finite automata. New Jersey: Prentice-Hall International Editions, 1989.LEWIS, H. R.; PAPADIMITRIOU, C. H. Elementos de teoria da computação. 2. ed. Porto Alegre: Bookman, 2000.MENEZES, P. F. B., Linguagens formais e autônomos. 5. ed. Porto Alegre: Sagra Luzzatto, 2005.ROSEN, K. H. Matemática discreta e suas aplicações. 6. ed. Rio de Janeiro: McGraw Hill, 2009.", "MATEMÁTICA DISCRETA:Conjuntos: finito, infinito, enumerável, cardinalidade. Técnica de diagonalização. Tópicos em teoria dos números. Estruturas algébricas e criptografia.Bibliografia Básica:ROSEN, K. H. Matemática Discreta e Suas Aplicações, 6.ed. Boston: McGraw-Hill, 2009.SANTOS, J. P. D. O. Introdução à Teoria dos Números. IMPA, 2006. (Coleção Matemática Universitária).", "25 COUTINHO, S. C. Números Inteiros e Criptografia RSA . 5. ed. IMPA, 2003. (Coleção Matemática e Aplicações).Bibliografia Complementar:GRIMALDI, R. P. Discrete and Combinatorial Mathematics: An Applied Introduction. 5. Boston: Pearson Addison-Wesley, 2003. ematics - An Applied Introduction, 5. ed. Pearson - Addison-Wesley, Boston, 2003.ROSEN, K. H. Elementary Number Theory and Its Application, 7.ed., McGraw-Hill Education, 2011.HERSTEIN, I. Abstract Algebra. 2 ed. Wiley, 1996.GONÇALVES, A. Introdução à Álgebra, 5. ed.Rio de Janeiro: CNPQ-IMPA, 2013.LEMOS, M. J. M. S. Criptografia, Números Primos e Algoritmos. IMPA, 2007.", "METODOLOGIA DE PESQUISA EM COMPUTAÇÃO:Estilos de pesquisa em Computação. Preparação de um trabalho de pesquisa. Escrita do trabalho científico.Apresentação oral do trabalho científico. Apresentação de programas de Iniciação Científica.Bibliografia Básica:MARCONI, M. A.; LAKATOS, E. M. Fundamentos de Metodologia Cientif́ ica. 7. ed. São Paulo: Atlas, 2010.SEVERINO, A. J. Metodologia do Trabalho Cientif́ ico. 22. ed. Revisada e ampliada. São Paulo: Cortez, 2007.WAZLAWICK, R. S. Metodologia de Pesquisa para Ciência da Computação, 1. ed. Elsevier, 2009.Bibliografia Complementar:ANDRADE, M. M. Introdução à metodologia do trabalho científico : elaboração de trabalhos na graduação . 9.ed. São Paulo: Atlas, 2009.BARROS, A. J. S. Fundamentos da Metodologia Científica . 3.ed. SãoPaulo: Pearson Prentice Hall, 2010. (3.Reimpressão).CERVO, Amado L. Metodologia Cientif́ ica: Para uso dos estudantes universitários . 3. ed. São Paulo: Mc Graw Hill, 1983.GIL, A. C. Como Elaborar Projetos de Pesquisa. 5. ed. São Paulo: Atlas, 2010.ZOBEL,J. Writing fo rComputer Science, 3.ed. Springer, 2014.", "PESQUISA OPERACIONAL:Modelagem. Problema de Programação Linear (PL). Resolução gráfica de PL. Algoritmo Simplex. Dualidade.Algoritmo Simplex-Dual. Pós-otimização e Análise de Sensibilidade.Bibliografia Básica:BREGALDA, P. F.; OLIVEIRA, A. A. F.; BORNSTEIN, C. T. Introdução à Programação Linear. 3. ed. Rio de Janeiro: Campus, 1983.GOLBARG, M.; LUNA, H. Otimização Combinatória e Programação Linear. 2. ed. Campus, 2005.TAHA, H. Pesquisa Operacional. 8. ed.Prentice Hall, 2008.Bibliografia Complementar:BAZARAA M.S.; JARVIS, J.J.; SHERALI, H. D. Linear Programming and Network Flows.Wiley, 2009.HILLIER, F. S.; LIEBERMAN, G. J. Introdução à Pesquisa Operacional.9.ed. AmghEditora, 2013.PARLAR, M. Interactive Operations Research with Maple: Methods and Models. Birkhauser, 2000.SILVA, E. M. et al. Pesquisa Operacional: Programação Linear, simulação. 3. ed.Atlas, 1998.WINSTON, W. L. Operations Research Applications and Algorithms.3rd ed. Duxbury Press, 1997.", "PROJETO FINAL DE CURSO 1:Desenvolvimento do projeto acompanhado por professor orientador. Tem como finalidade dar experiência adquiridos durante o curso.Bibliografia Básica:Bibliografia a ser definida sob supervisão de um professor orientador.Bibliografia Complementar:Bibliografia a ser definida sob supervisão de um professor orientador.", "PROJETO FINAL DE CURSO 2:Desenvolvimento do projeto acompanhado por professor orientador. Tem como finalidade dar experiência adquiridos durante o curso.Bibliografia Básica:Bibliografia a ser definida sob supervisão de um professor orientador.Bibliografia Complementar:Bibliografia a ser definida sob supervisão de um professor orientador.REDES DE COMPUTADORES 1:", "26 Fundamentos. Arquitetura de Redes TCP/IP (Internet). Camadas de Aplicação, Transporte, Rede, Enlace e Física. Estudo de Caso de Tópicos Emergentes em Redes.Bibliografia Básica:KUROSE, J.F.; ROSS, K. Computer Networking: A Top-Down Approach. 6th ed. Pearson, 2012.TANENBAUM, A. S. Computer Networks.5th ed. Pearson, 2010.STALLINGS, W. Data and Computer Communications.10th ed. Pearson, 2014.Bibliografia Complementar:PETERSON, L. L.; DAVIE, B.S. Computer Networks: A Systems Approach. 5th ed. Morgan Kaufmann, 2011.DANTAS, M. Redes de Comunicaçao e Computadores: abordagem quantitativa. Florianópolis: Visual Books, 2010.BEHROUZ F. A. Data Communications and Networking, 5th ed. McGraw-Hill Education, 2012.DAY, J. Patterns in Network Architecture: A Return to Fundamentals. 1st ed. Pearson, 2008.TORRES, G. - Redes de Computadores : curso completo. Rio de janeiro: Axcel Books, 2001.SOARES, L .F .G. Redes de Computadores: das LANS, MANS e WANS as Redes ATM. 2ed. rev. e ampl. Rio de Janeiro: Campus, 1995.", "SISTEMAS DISTRIBUÍDOS:Conceitos fundamentais de sistemas distribuídos, caracterização de sistemas de computação distribuída e aplicações distribuídas (características e aspectos de projeto). Objetivos básicos de sistemas distribuídos (transparência, abertura, escalabilidade, etc). Princípios e aplicações dos principais modelos de sistemas distribuídos: sistemas cliente-servidor e sistemas peer-to- peer. Fundamentos de sistemas distribuídos (processos, sincronização, RPC/RMI, comunicação em grupo, comunicação indireta). Objetos distribuídos. Web services.Serviços de sistemas distribuídos: serviços de nomes, serviços de descoberta, compartilhamento de recursos etc.Principais tecnologias, padrões e plataformas de middleware, e seu uso como suporte para o desenvolvimento de aplicações em ambientes distribuídos abertos. Algoritmos distribuídos: relógios lógicos, estado global, coordenação, consenso, exclusão mútua e eleição. Transações distribuídas, replicação e tolerância a falhas em sistemas distribuídos. Tópicos avançados em Sistemas Distribuídos.Bibliografia Básica:COULOURIS, G.F.; DOLLIMORE, J.; KINDBERG T.; BLAIR G. Sistemas Distribuídos: Con- ceitos e Projeto.5. ed. Bookman Editora, 2013.KUROSE, J. F.; ROSS, K. W. Redes de Computadores e a Internet: Uma Abordagem Top-down, 5. Ed. Addison Wesley, 2010.TANENBAUM, A. S; STEEN, M. van. Sistemas Distribuid ́ os: Princípios e Paradigmas. 2.ed. Pearson Education do Brasil, 2008.Bibliografia Complementar:ALEKSY, M.; KORTHAUS, A.; SCHADER, M. Implementing Distributed Systems with Java and CORBA.Berlin Heidelberg: Springer-Verlag, 2005.ANDREWS, G. R. Foundations of Multithreaded, Parallel, and Distributed Programming. Pearson. 2000.LYNCH, A. Distributed Algorithms. Morgan Kaufmann, 1997. (The Morgan Kaufmann series in data management systems).KSHEMKALYANI, D.; SINGHAL, M. Distributed Computing Principles, Algorithms, and Systems.Cambridge University Press, 2008.LININGTON, P.; MILOSEVIC, Z.; TANAKA, A.; VALLECILLO, A. Building Enterprise Systems with ODP.Chapman & Hall/CRC Press, 2011.", "SISTEMAS GERENCIADORES DE BANCOS DE DADOS:Arquitetura. Técnicas de Armazenamento. Indexação. Processamento e Otimização de Consultas. Transações, Controle de Concorrência e Recuperação após Falhas. Segurança.Bibliografia Básica:ELMASRI, R.; NAVATHE, S. B. Sistemas de Banco de Dados. 6.ed. Pearson-Addison Wesley, 2015.GARCIA-MOLINA, H.; ULLMAN, J. D.; WIDOM, J. D. Database Systems: The Complete Book. 2. ed.Prentice Hall, 2009.SILBERSCHATZ, A.; KORTH, H. F.; SUDARSHAN, S. Sistema de Banco de Dados. 5. ed. Rio de Janeiro:Campus, 2006.Bibliografia Complementar:RAMAKRISHNAN, R.; GEHRKE, J. Sistemas de Gerenciamento de Banco de Dados . Tradução da 3. ed. São Paulo:McGraw-Hill, 2008.DATE, C. J. Introdução a Sistemas de Banco de Dados . Tradução da 8.ed. Americana. Rio de Janeiro:Campus, 2004.CONNOLLY, T. M.; Begg, C. E.; Strachan, A. D. Database systems : a practical approach to design, implementation and management. 3rd. ed. Addison Wesley, 2010.DITTRICH, J. Patterns in Data Management: A Flipped Textbook. 1. ed. Create Space Inde- pendent Publishing Platform, 2016.GRAY, G.; REUTER, A. Transaction Processing: Concepts and Techniques. 1. ed., Morgan Kaufmann, 1992.SISTEMAS OPERACIONAIS:", "27 Gerenciamento de processos. Gerenciamento de memória. Sistemas de arquivos. Processamento de entrada/saída. Virtualização. Sistemas multiprocessados.Bibliografia Básica:TANENBAUM, A. S. Sistemas Operacionais Modernos. 3. ed. Pearson, 2009.SILBERSCHATZ, A.; GALVIN, P.; GAGNE, G. Fundamentos de Sistemas Operacionais. 8. ed. LTC, 2010.MAZIERO, C. A Sistemas Operacionais: Conceitos e Mecanismos . Disponível em :http://wiki.inf.ufpr.br/maziero/doku.php?id=so:livro_de_sistemas_operacionais.Bibliografia Complementar:TANEMBAUM, A.; WOODHULL, A. Sistemas Operacionais : Projeto e Implementaçã o. 3. ed.Bookman, 2008.KIFER, M.; SMOLKA, S. OSP: An environment for Operating Systems Projects. Addison- Wesley, 1991.STALLINGS, W. Operating Systems: Internals and Design Principals; 8th ed.Pearson, 2014.VAHALIA, U. UnixInternals. Prentice Hall, 1996.OLIVEIRA, R.; CARISSINI, A.; TOSCANI, S. Sistemas Operacionais. Bookman, 2010. (Série Livros Didáticos Informática UFGRS).", "SOFTWARE BÁSICO:Visão geral de um sistema computacional. Linguagem de montagem. Mapeamento de estruturas de linguagens de alto nível para a linguagem Assembly. Pilha de execução e modelo de chamadas de função. Interrupções e seus tipos. \"Link-edição\" e bibliotecas.Bibliografia Básica:BRYANT, R.; O’HALLARON, D. Computer Systems: A programmer’s Perspective. 2nd ed. Prentice Hall, 2011.DUNTEMANN, J. Assembly Language Step-by-Step: Programming wiht Linux. 3rd. ed. Willey, 1999.WARFORD, J. S. Computer Systems.4th ed. Jones and Bartlet Publishers, 2010.Bibliografia Complementar:CARTER., P. A. PC Assembly Language, 2006. (disponível em: http://www.drpaulcarter.com/pcasm/).CARPINELLI, J. D. Computer systems organization & architecture.Addison-Wesley, 2001.HENNESSY, J. L.; PATTERSON, D. A. Computer organization and design: the hardware / software interface, 2nd ed. Morgan Kaufmann Publishers, 1998.LOVE, R. Linux system programming.O’Reilly, 2007.KERRISK, M. The Linux Programming Interface: A Linux and Unix System Programming Handbook. No Starch Press, 2010.", "TEORIA DOS GRAFOS:Noções e notações básicas de grafos. Árvores. Conectividade. Coloração. Emparelhamento. Conjuntos dominantes. Planaridade. Algoritmos de busca e aplicações. Algoritmos do menor caminho. Grafos Eulerianos e Hamiltonianos. Fluxo em redes. Grafos Infinitos.Bibliografia Básica:BONDY, A.; MURTY, U. S. R. Graph Theory. Springer, 2008.(Graduate Texts in Mathematics).ROSEN, K. H. Matemática Discreta e suas Aplicações. 6. ed. Rio de Janeiro: McGraw Hill, 2009.SZWARCFITER, J. L. Grafos e Algoritmos Computacionais. Campus, 1984.Bibliografia Complementar:WEST, D. Introduction to Graph Theory. Prentice Hall, 2000.BOAVENTURA NETTO, P. O. Grafos: Teoria, Modelos, Algoritmos. Editora Edgard Blucher, 2003.CORMEN, T. H.; LEISERSON, C. E.; RIVEST, R. L. Algoritmos: Teoria e Prática. 3. ed. Cam- pus, 2012.DIESTEL, R. Graph theory.3rd. ed. Springer, 2000.BOLLOBÁS, B. Modern Graph Theory. Springer Verlag, 1998.", "Disciplinas Optativas APRENDIZAGEM DE MÁQUINA E MINERAÇÃO DE DADOS:Conceitos básicos em Aprendizado de Máquina e Mineração de Dados. Preparação de dados. Modelos preditivos. Modelos descritivos. Avaliação de modelos.Bibliografia Básica:FACELI, K.; LORENA, A. C.; GAMA, J.; CARVALHO, A. C. P. L. F. Inteligência Artificial: Uma Abordagem de Aprendizado de Máquina. LTC, 2011.HAN, J.; KAMBER, M.; PEI, J. Data Mining: Concepts and Techniques. 3rd ed. Morgan Kaufmann Publishers, 2011.WITTEN, I. H.; FRANK, E.; HALL, M. A. Data Mining: Practical Machine Learning Tools and Techniques. 3rd ed. Morgan Kaufmann Publishers, 2011.Bibliografia Complementar:", "28 TAN, Pang-Ning; STENBACH M.; KUMAR, V. Introduction to Data Mining. Addison Wesley, 2005.ALPAYDIN, E. Introduction to Machine Learning. MIT Press, 2004.MITCHELL, T. Machine Learning. Mc Graw Hill, 1997.BISHOP, C. M. Pattern Recognition and Machine Learning, Springer, 2006.RUSSELL, S; NORVIG P. Inteligência Artificial. 3. ed. Campus, 2013.", "ARMAZÉM DE DADOS:Conceitos básicos em Data Warehouse. Arquitetura. Projeto conceitual. Projeto lógico. Estudos de Caso.Consultas. Implementação.Bibliografia Básica:KIMBALL, R.; ROSS, M. The Data Warehouse Toolkit: The Complete Guide to Dimensional Modeling. 2. ed.Wiley, 2002.KIMBALL, R., ROSS, M., THORNTHWAITE, W., MUNDY, J., BECKER, B.: The Data Wa- rehouse Lifecycle Toolkit. 2a. Edição. Wiley, 2008.VAISMAN, A., ZIMÁNYI, E.: Data Warehouse Systems: Design and Implementation. 1a. Edição. Springer, 2014.Bibliografia Complementar:ELMASRI, R., NAVATHE, S. B. Sistemas de Banco de Dados, 6a ed Pearson-AddisonWesley, 2015.GARCIA-MOLINA, H., ULLMAN, J. D. e WIDOM, J. D., Database Systems: The Complete Book, 2a.edição, Prentice Hall, 2009.INMON, W. H.: Building the Data Warehouse. 4a. Edição. Wiley, 2005.KIMBALL, R., CASERTA, J.: The Data Warehouses ETL Toolkit: Practical Techniques for Extracting, Cleaning, Conforming, and Delivering Data. 1a. Edição. Wiley, 2004.JARKE, M., LENZERINI, M., VASSILIOU, Y., VASSILIADIS, P.: Fundamentals of Data Wa- ehouses. 2a.Edição. Springer, 2002.", "AVALIAÇÃO DE DESEMPENHO DE SISTEMAS COMPUTACIONAIS:Pilares da avaliação de desempenho. Modelagem analítica. Medições. Simulação. Conceitos básicos de desempenho. Leis Operacionais de desempenho. Redes de filas abertas e fechadas e suas soluções. Planejamento de capacidade. Noções de Teoria de Filas. Aplicação em sistemas de computação e comunicação.Bibliografia Básica:JAIN, R. The Art of Computer Systems Performance Analysis: Techniques for Experimental Design, Measurement, Simulation, and Modeling. John Wiley and Sons, 1991.ROSS, S. M. Introduction to Probability Models. 9th ed. Academic Press, Elsevier 2006.MENASCE, D. A.; ALMEIDA, V. Capacity planning for web services. Upper Saddle River, NJ, USA: Prentice Hall PTR, 2001.Bibliografia Complementar:KLEINROCK, L. Queueing Systems Theory. John Wiley and Sons, Inc., 1975.(Vol. I).KLEINROCK, L. Queueing Systems: Computer Applications. John Wiley and Sons, 1975. (Vol. II).CROVELLA, M.; KHRISHNAMURTHY, B. Internet Measurement: Infrastructure,Traffic and Applications.John Wiley and Sons, 2006.LAZOWSKA, E.; ZAHORJAN J.; GRAHAM, S.; SEVCIK, K. Quantitative System Performance.Prentice-Hall, 1984.ALLEN, A. O. Probability, Statistics, and Queueing Theory with Computer Science Applications.Academic Press, 1990.", "BANCO DE DADOS DISTRIBUÍDOS:Conceitos básicos em banco de dados distribuídos. Arquitetura. Projeto de banco de dados distribuído.Processamento de consultas distribuídas. Processamento de transações distribuídas. Replicação de Dados.Sistemas de banco de dados paralelos.Bibliografia Básica:DOAN, A., HALEVY, A., IVES, Z., Principles of Data Integration. Morgan-Kaufmann, 1a.edição, Morgan- Kaufmann, 2012.GARCIA-MOLINA, H., ULLMAN, J. D. e WIDOM, J. D., Database Systems: The Complete Book, 2a.edição, Prentice Hall, 2009.ÖZSU, M. T., VALDURIEZ, P. Principles of Distributed Database Systems. 3a.edição, Springer, 2011.Bibliografia Complementar:COULOURIS, G.F.; DOLLIMORE, J.; KINDBERG T.; BLAIR G. Sistemas Distribuid ́ os: Conceitos e Projeto.5. ed. Bookman Editora, 2013.GRAY, G., REUTER, A., Transaction Processing: Concepts and Techniques. 1a ed., Morgan Kaufmann, 1992.ELMASRI, R., NAVATHE, S. B., Sistemas de Banco de Dados. 6. ed., Pearson-Addison Wes- ley, 2015.SILBERSCHATZ, A., KORTH, H. F. e SUDARSHAN, S., Sistema de Banco de Dados, 5a ed., Ed. Campus,", "29 Rio de Janeiro, 2006.TANENBAUM, A. S; STEEN, M. van.Sistemas Distribuid ́ os : Princípios e Paradigmas . 2. edição, Pearson Education do Brasil, 2008.", "COMPUTAÇÃO EVOLUCIONÁRIA:Conceito. Histórico. Os principais paradigmas e algoritmos. Projeto de algoritmo. Algoritmos Genéticos e aplicações da Computação Evolucionária.Bibliografia Básica:LIDEN, R. Algoritmos Genéticos. 3. ed. Brasport, 2008.ENGELBRECHT, A. P. Computational Intelligence: An Introduction. New York: Wiley, 2002.DE-JONG, KA. Evolutionary Computation: A Unified Approach. MIT Press, 2006.Bibliografia Complementar:CHENG, R.; GEN, M. Genetic Algorithms and Engineering Optimization. New York: Wiley, 2000. (Wiley series in engineering design and automation).DRÉO, J. Metaheuristics for Hard Optimization Methods and Case Studies. Berlin: Springer Berlin, 2006.RUSSELL, S. J. Artificial Intelligence: a Modern Approach 3. ed. Upper Saddle River: Prentice-Hall, 2010.(Prentice-Hall series in artificial intelligence).ENGELBRECHT, A. P. Fundamentals of computational swarm intelligence. Hoboken, NJ: Wiley, 2005. (Enc.).MITCHELL, M. An introduction to genetic algorithms Cambridge: MIT Press,1996.(enc.)", "COMPUTAÇÃO MÓVEL E UBÍQUA:Computação móvel e ubíqua: conceitos, principais características, internet das coisas, smart spaces, sensibilidade a contexto,tecnologias de comunicação e desafios. Plataformas de desenvolvimento móvel e modelos de negócio para comercialização. Projeto de aplicações móveis: macro e micro arquitetura, padrões de interface com usuário, persistência de dados, segurança, privacidade e comunicação. Programação de aplicações móveis:middlewares, frameworks e sensores. Prática em desenvolvimento de aplicações móveis.Bibliografia Básica:KRUMM, J. Ubiquitous Computing Fundamentals.1st ed. Chapman & Hall/CRC,2009.GREENFIELD, A. Everyware: The Dawning Age of Ubiquitous Computing. 1st ed. New Riders Publishing, 2006.NEIL, T. Padrões de Design para Aplicativos Móveis. O’Reilly, 2012.Bibliografia Complementar:WEISER, M.The computer for the 21st century.SIGMOBILE Mob.Comput.Commun. Rev.3, 3 (July 1999), 3-11.GUBBI, J; BUYYA, R.; MARUSIC, S.; PALANISWAMI M. Internet of Things (IoT): A vision, architectural elements, and future directions. Future Gener.Comput. Syst. 29, 7 September 2013, 1645-1660.GARDNER J. D.; GRIGSBY, J. Head First Mobile Web.O’Reilly, 2011.Android Developers(https://developer.android.com/), acessado em Junho de 2016.Apple Developer(https://developer.apple.com), acessado emJunho de 2016.", "COMPUTAÇÃO VERDE:Introdução a eficiência energética em computação. Eficiência energética em redes de comunicação. Modelos de consumo energético. Algoritmos e protocolos energeticamente eficientes. Tópicos e pesquisas emergentes em computação verde. Estudo de caso através de simulação e ambiente real.Bibliografia Básica:KUROSE, J. F.; ROSS, K. Redes de Computadores e a Internet. 6. ed. Addison Wesley - Pearson Brasil, 2014.STALLINGS, W. Data and Computer Communications.10th ed. Pearson, 2014.TANENBAUM, A. S. Computer Networks.5th ed. Pearson, 2010.Bibliografia Complementar:OLIVEIRA-JR, A. Energy Efficiency for User-centric Routing.PhD Thesis, MAP-i Doctoral Programme in Computer Science.Universities of Minho, Aveiro and Porto, 2014.OLIVEIRA-JR, A.; SOFIA, R. Energy-Awareness in Multihop Routing. Lecture Notes in Computer Science.3ed. Springer International Publishing, p.137-156, 2014.FENG, W-C. The Green Computing Book: Tackling Energy Efficiency at Large Scale. CRC Press, 2014.SMITH, B. E. Green Computing: Tools and Techniques for Saving Energy, Money, and Resources. Auerbach Publications, 2013.HARCHOL-BALTER, M. Performance Modeling and Design of Computer Systems - Queueing Theory in Action, 1st ed. Cambridge University Press, 2013.", "DESENVOLVIMENTO DE SISTEMAS PARA WEB:Abordagens, técnicas, tecnologias e ferramentas para desenvolvimento de sistemas de informação para web tendo em consideração todo o ciclo de vida do desenvolvimento de sistemas.30 Bibliografia Básica:LAUDON, K. C; LAUDON, J. P. Sistemas de informaçaõ gerenciais : administrando a empresa digital . 9. ed., São Paulo: Pearson Prentice-Hall, 2010.MATTOS, A. C. M. Sistemas de informaçaõ : uma visaõ executiva. 2.ed., SãoPaulo: Saraiva, 2010.PRESSMAN, R. S. Software engineering: a practitioner’s approach. 7. ed., McGraw-Hill, 2010.Bibliografia Complementar:BATISTA, E. O. Sistemas de Informaçaõ : o uso consciente da tecnologia para o gerenciamento. 1. ed., São Paulo: Saraiva, 2006.Software Engineering Body of Knowledge (SWEBOK), Version 3.0, IEEE Computer Society , 2014. Disponível on-line em: http://www.computer.org/web/swebok/v3.ELMASRI, R.; NAVATHE, S. B. Sistemas de Banco de Dados. 6.ed. Pearson-AddisonWesley, 2011.TIDWELL, J. Designing interfaces Beijing Sebastopol, CA: O’Reilly, 2006.BAI, Y. Practical Database Programming with Java . Wiley-IEEE Press , 2011. Disponível on -line:http://ieeexplore.ieee.org/xpl/bkabstractplus.jsp?bkn=5988888.", "DESENVOLVIMENTO DE SOFTWARE DIRIGIDO POR MODELOS:Apresentar os conceitos fundamentais relacionados ao desenvolvimento de software dirigido por modelos (DSDM),incluindo abstração, modelagem, meta-modelagem, geração automática de código por meio de transformações, transformações modelo-para-modelo, transformações modelo-para-texto, transformações texto- para-texto, gramáticas e árvores de sintaxe abstrata, técnicas e ferramentas de apoio às atividades fundamentais do método de DSDM, técnicas de desenvolvimento de Linguagens Específicas de Domínio (LED).Bibliografia Básica:MELLOR, S. J.; KENDALL, S.; UHL,A.; WEISE, D. MDA Distilled. Redwood City, CA,USA: Addison Wesley Longman Publishing Co., Inc., 2004.STAHL, T.; VOELTER, M.; CZARNECKI, K. Model-Driven Software Development: Techno- logy, Engineering, Management. John Wiley & Sons, 2006.MELLOR, S. J.; BALCER, M. Executable UML: A Foundation for Model-Driven Architectures. Boston, MA, USA: Addison-Wesley Longman Publishing Co., Inc., 2002.Bibliografia Complementar:Engineering in Practice.1st ed. Morgan & Claypool Publishers, 2012.BETTINI, L. Implementing Domain-Specific Languages with Xtext and Xtend. Packt Pu- blishing, 2013.STEINBERG, D.; BUDINSKY, F.; PATERNOSTRO, M.; MERKS, E. Emf: Eclipse Modeling Framework 2.0.2nd ed. Addison-Wesley Professional, 2009.DAZ, V. G. Advances and Applications in Model-Driven Engineering. 1st ed. Hershey, PA, USA: IGI Global, 2013.VOELTER, M. ; BENZ, S.; DIETRICH, C.; ENGELMANN, B.; HELANDER, M.; KATS, L. C. L.; VISSER, E.; WACHSMUTH, G. DSL Engineering - Designing, Implementing and Using Domain-Specific Languages.dslbook.org, 2013.", "EMPREENDEDORISMO DIGITAL:O perfil e as habilidades do empreendedor. Estudo de mecanismos e procedimentos para ideação, validação e lançamento de uma empresa digital no mercado. Montagem e gerenciamento de equipe. Constituição, tributação e legalização de empresa. Inovação tecnológica na geração de novos produtos e negócios.Marketing e competitividade. Escala e avaliação de desempenho. Financiamento de empre sas digitais. Análise de Casos.Bibliografia Básica:BARON, R. A.; SHANE, S. A. Empreendedorismo: Uma Visaõ do Processo. 1. ed. São Paulo: Editora Thomson Learning, 2011.FARAH, O.; CAVALCANTI, M.; MARCONDES, L. Empreendedorismo Estratégico : Criação e Gestão de Pequenas Empresas. São Paulo: Editora Thomson Learning, 2008.SALIM, C.; HOCHMAN, N.; RAMAL, A.; RAMAL, S. Construindo planos de negócios : todos os passos necessários para planejar e desenvolver negócios de sucesso. 3. ed. Rio de Janeiro: Editora Elsevier, 2005.Bibliografia Complementar:CAVALCANTI, M. Gestão estratégica de negócios : evolução, cenários, diagnóstico e ação . 2. ed. São Paulo :Pioneira Thomson Learning, 2007.CHIAVENATO, I. Empreendedorismo: Dando asas ao espírito empreendedor. 2.ed. São Paulo: Saraiva, 2008.DOLABELA, F. O segredo de Luísa: uma ideia e uma paixaõ e plano denegócios. GMT Editores, 2008.FERRARI, R. Empreendedorismo para computaçaõ : criando negócios de tecnologia . 1. ed.Rio de Janeiro:Elsevier, 2009.IBPQ. GEM – Global Entrepreneurship Monitor . Empreendedorismo no Brasil : Relatório Executivo . Paraná:IBPQ, 2014. Disponível em http://www.ibqp.org.br/", "31 ENGENHARIA DE SISTEMAS:Fundamentos de engenharia: métodos empíricos e técnicas experimentais. Análise estatística; medição. Design.Modelagem, prototipação e simulação. Normas e padrões. Análise de causa raiz. Fundamentos de sistemas:taxonomias de sistema; sistemas de engenharia (sistemas produzidos por engenharia - engineered systems).Sistemas intensivos em software (software-intensive systems). Sistemas de sistemas. Complexidade de sistemas.Propriedades emergentes. Princípios do pensamento sistêmico. Representação de sistemas por modelos. Engenharia de Sistemas: abordagens e metodologias. Partes interessadas (stakeholders) e suas necessidades. Ciclo de vida de sistemas de engenharia (concepção, conceitos operacionais, design, validação de design, construção, validação de construção, implantação, sustentação e descontinuação). Processos do ciclo de vida de sistemas (negociação, preparação para projeto organizacional, gestão técnica, processos técnicos). Qualidade de processo.Bibliografia Básica:SCHNEIDEWIND, N. F. Systems and Software Engineering with Applications. New York, NY: IEEE, 2009.INCOSE. Systems Engineering Handbook: A Guide for System Life Cycle Processes and Activities, version 3.2.2. San Diego, CA, USA: International Council on Systems Engineering (INCOSE), INCOSE-TP-2003-002- 03.2.2, 2012.WIDRIG, D.; LEFFINGWELL, D, Managing Software Requirements: a Unified Approach. Boston: Addison Wesley, 2001.Bibliografia Complementar:MADACHY, R. J. Systems Engineering Principles for Software Engineers.1a.ed. CRC Press, 2016.WILSON, W. E. Conceptos sobre Ingenieria. Buenos Aires. Centro Regional de Ayuda Tecnica, 1968.SILVAFILHO, B. S.; NISE, N. S. Engenharia de Sistemas de Controle, 3ed. LTC, 2002.MAFFEO, B. Engenharia de Software e Especificaçaõ de Sistemas. Rio de Janeiro: Campus, 1992.NASCIMENTO, J. B. Metodologias de Desenvolvimento de Sistemas. SãoPaulo: Erica, 1993.", "ENGENHARIA DE SOFTWARE BASEADA EM BUSCA:Engenharia de Software Baseada em Busca. Problemas de Busca. Meta-heurísticas. Aplicações de SBSE em teste de Software, planejamento, manutenção, segurança e performance.Bibliografia Básica:DRÉO, J. Metaheuristics for Hard Optimization: Methods and Case Studies. Berlin:Springer Berlin, 2006.DE JONG, K. A. Evolutionary Computation a unified approach Cambridge. Mass.: MIT Press, 2006.CHENG, R.; GEN, M. Genetic Algorithms and Engineering Optimization. New York: Wiley, 2000.Bibliografia Complementar:ENGELBRECHT, A. P. Computational Intelligence: An Introduction. New York: Wiley, 2002.LINDEN, R. Algoritmos Genéticos. 3. ed. Brasport, 2008.RUSSELL, S. J. Artificial intelligence a modern approach. 3. ed. Upper Saddle River: Prentice- Hall, 2010.ENGELBRECHT, A. P. Fundamentals of Computational Swarm Intelligence. Hoboken, NJ: Wiley, 2005.HARMAN M.; MCMINN, P.; SOUZA, J. T de; YOO, S. Search based Software Engineering: Techniques, Taxonomy, Tutorial. Berlin, Heidelberg: Springer-Verlag, 2012. (In Empirical Software Engineering and Verification.Bertrand Meyer and Martin Nordio (Eds.)).", "FUNDAMENTOS DA PROGRAMAÇÃO LÓGICA E FUNCIONAL Princípio de resolução. Unificação de primeira ordem. Teorema do ponto fixo. Resolução SLD, correção e completitude. Funções recursivamente computáveis. Noções de teoria de reescrita. Cálculo Lambda e reescrita de ordem superior (computabilidade via reescrita). Confluência e Terminação. Ordens Noetherianas. Algoritmo de completamento de Knuth-Bendix, correção e completitude.Bibliografia Básica:AYALA-RINCÓN, M. ; MOURA, F.L.C. Fundamentos da Programaçaõ Lóg ica e Funcional : O Princip ́ io de Resolução e a Teoria de Reescrita. Notas de Aula.BAADER, F.; NIPKOW, T. Term Rewriting and All That.Cambridge Univ. Press, 1998.GALLIER, J. H. Logic for Computer Science: Foundations of Automatic Theorem Proving. 2nd ed. Dover, 2015.Bibliografia Complementar:LLOYD, J. W. Foundations of Logic Programming. 2. ed. Springer, 1987.FURTADO, A. L.; GIORNO, F.A.C.; CASANOVA, M. A. Programação em Lógica e a Linguagem PROLOG .Blucher, 1987.(Dsponível em www.inf.puc-rio.br/ casanova/Publications/Books/1987-PL.pdf).BEZEM, M.; KLOP, J. W.; VRIJER, R. Term Rewriting Systems by TeReSe.Cambridge UP, 2003.(In Cambridge Tracts in Theoretical Computer Science).KLOP, J. W. Term Rewriting Systems. In: S. Abramsky, D.M. Gabbay and T.S.E. Maibaum, editors. Handbook of Logic in Computer Science. Clarendon Press, 1992. Vol. 2, p. 1-116.GUNTER, C. A. Semantics of Programming Languages: Structures and Techniques. MIT Press, 1992.(Foundations of Computer Series).", "32 INTEGRAÇÃO DE DADOS:Conceitos fundamentais em integração de dados. Arquiteturas de sistemas de integração de dados. Descrição de fontes de dados. Processamento de consultas. Similaridade textual. Pareamento e mapeamento de esquemas.Identificação e eliminação de dados duplicados. Tópicos emergentes em integração de dados.Bibliografia Básica:DOAN, A., HALEVY, A., IVES, Z., Principles of Data Integration. Morgan-Kaufmann, 1a.Edição, Morgan- Kaufmann, 2012.GARCIA-MOLINA, H., ULLMAN, J. D. e WIDOM, J. D., Database Systems: The Complete Book, 2a.edição, Prentice Hall, 2009.ÖZSU, M. T.; VALDURIEZ, P. Principles of Distributed Database Systems.3A .edição, Springer, 2011.Bibliografia Complementar:EUZENAT, J.; SHVAIKO, P. Ontology Matching, 1a ed. Springer, 2007.CHRISTEN, P. Data Matching: Concepts and Techniques for Record Linkage, Entity Resolution, and Duplicate Detection. 1a. Ed., Springer, 2012.KIMBALL, R., CASERTA, J.: The Data Warehouses ETL Toolkit: Practical Techniques for Extracting, Cleaning, Conforming, and Delivering Data. 1a. Edição. Wiley, 2004.TAN, P., STEINBACH, M., KUMAR, V., Introduction to Data Mining. 1a. Edição, Addison Wesley, 2006.VAISMAN, A., ZIMÁNYI, E.: Data Warehouse Systems: Design and Implementation. 1a. Edição. Springer, 2014.", "INTRODUÇÃO À LÍNGUA BRASILEIRA DE SINAIS:Introdução às práticas de compreensão e produção em LIBRAS através do uso de estruturas e funções comunicativas elementares. Concepções sobre a Língua de Sinais. O surdo e a sociedade.Bibliografia Básica:FELIPE, T.; MONTEIRO, M. S. LIBRAS em contexto . Curso Básico . Brasília: Ministério da Educação e do Desporto/Secretaria de Educaçaõ Especial, 2001.PEREIRA, M. C. C., CHOI, D. (et alli). LIBRAS – Conhecimento além dos sinais. São Paulo: Pearson, 2011.PIMENTA, N.; QUADROS, R. M. Curso de LIBRAS 1 – Iniciante. 3ed. Porto Alegre: Pallotti, 2008.Bibliografia Complementar:ALMEIDA, E. C., DUARTE, P. M. Atividades ilustradas em sinais da Libras. São Paulo: Re- vinter, 2004.BRITO,L. F. Por uma gramática de liń gua de sinais . Rio de Janeiro: Tempo Brasileiro,1995. CAPOVILLA, F.C., RAPHAEL, W. D., MAURÍCIO, A. C. L. Dicionário Enciclopédico Ilustrado Trilíngüe da Língua de Sinais Brasileira, v 1 e 2. São Paulo: Editora da Universidade de Saõ Paulo, 2010.CAPOVILLA, F. C.; RAPHAEL, W. D. (ed.). Enciclopédia da Língua de Sinais Brasileira . v. 1 e 2. São Paulo:EDUSP, 2004.GESSER, Audrei. LIBRAS? Que língua é essa ? : Crenças e preconceitos em torno da língua de sinais e da realidade surda. São Paulo: Parábola Editorial, 2009.QUADROS, R. M. de; KARNOPP, L. Língua de sinais brasileira : estudos linguísticos . ART-MED: Porto Alegre, 2004.", "INTRODUÇÃO À TEORIA DAS PROVAS:Provas como objetos matemáticos e o programa de Hilbert. Estrutura geral de provas matemáticas. Teorias de tipos simples. Sistemas de deduçao natural. Sistemas de dedução de Hilbert. Relações entre lógicas clássica, intuicionista e minimal. Sistemas de dedução à la Gentzen (cálculo de sequentes). Equivalência entre sistemas de dedução. Regras estruturais. Regra de corte e eliminação. Tamanho de provas e limites para eliminação da regra de corte. Estrutura de provas normais. Normalização nos sistemas de dedução natural e à la Gentzen.Bibliografia Básica:TROELSTRA, A. S.; SCHWITCHTENBERG, H. Basic Proof Theory.CUP 2000.(Cambridge Tracts in Theoretical Computer Science).NEGRI,S.; VONPLATO, J. Structural Proof Theory. CUP2001.BUSS, S. R. Handbook of Proof Theory. NorthHolland: Elsevier, 1998. (Studies in Logic and the Foundations of Mathematics, Vol. 137).Bibliografia Complementar:PRAWITZ, D. Natural Deduction: A Proof-Theoretical Study. Dover, 2006.TAKEUTI, G. Proof Theory. 2nd ed. Amsterdam: North-Holland, 1987.POHLERS, W. Proof Theory: The First Step into Impredicativity. Universitext.Spriger-Verlag, 2009.ACZEL,P.; SIMONS,H.; WAINER, S. Proof T heory. Cambridge University Press, 1992.VANHEIJENOORT, J. From Frege to Gödel .A source book in mathematical logic, 1879-1931. Harvard University Press, 2002.", "INTRODUÇÃO À TEORIA DOS TIPOS:O cálculo lambda livre de tipos. Definição de tipos à la Curry e à la Church. O isomorfismo de Curry-Howard:correspondência entre verificação de tipos e dedução lógica. Os problemas de inferência e de existência de habitantes de tipos.", "33 Bibliografia Básica:HINDLEY, J. R. Basic Simple Type Theory. Cambridge University Press, 1997.(Cambridge Tracts in Theoretical Computer Science, n. 42).KRIVINE, J-L; CORI, R. Lambda-calculus, types and models. Ellis Horwood Upper Saddle River, NJ, USA, 1993. (Disponível em https://www.irif.univ-paris-diderot.fr/ kri- vine/articles/Lambda.pdf).NEDERPELT, R.; GEUVERS, H. Type Theory and Formal Proof: An Introduction. Cambridge University Press, 2014.Bibliografia Complementar:BARENDREGT, H. P. Lambda Calculus with Types. In: ABRAMSKY, S.; GABBAY, D. M.; MAIBAUM, T.S.E.(Eds.). Handbook of Logic in Computer Science Clarendon Press, 1992. Vol. 2, pages 117-309.KAMAREDDINE, F. D.; LAAN, T.; NEDERPELT, R.A Modern Perspective on Type Theory.Kluewer, 2004.(Number 29 in Applied Logic Series).SORENSEN, M.; URZYCZYN, P. Lectures on the Curry-Howard isomorphism. Elsevier, 1998.(Vol. 149 of Studies in Logic and the Foundations of Mathematics).GIRARD, J.-Y.; LAFONT, Y.; TAYLOR, P. Proofs and Types.Cambridge University Press, 1989.(Cambridge Tracts in Theoretical Computer Science, n. 7).SIMMONS, H. Derivation and Computation: Taking the Curry-Howard Correspondence Seriously. Cambridge University Press, 2000.(Cambridge Tracts in Theoretical Computer Science, n. 51).", "JOGOS DIGITAIS:Conceitos fundamentais de jogos, Storyboard, Mecânica de Jogos, game engines, ambientação e animação em jogos. Aplicação de técnicas de apresentação dos jogos. Deploy de jogos em plataformas. Noções de Mercado e tendências tecnológicas para jogos.Bibliografia Básica:MARTINHO, C.; SANTOS, P.; PRADA, R. Design e Desenvolvimento de Jogos. 1.ed. Lisboa: FCA - Editora de Informática, 2014.SCHELL, J. The Art of Game Design: A book of lenses. Nova Iorque: CRC Press, 2008.SCHUYTEMA. P. Design de Games - Uma Abordagem Prática. 1. ed. Cengage CTP, 2008.Bibliografia Complementar:LIMA, A. Design de personagens para games Next-Gen. Rio de Janeiro: Ed. Ciência Moderna, 2011.FEIJÓ, B.; CLUA, E.; SILVA, F. Introdução à Ciência da Computação com Jogos. Rio de Ja- neiro: Ed. Campus, 2009.PERUCIA, A. S.; BERTHÊM, A.; BERTSCHINGER, G.; CASTRO, R. R. Desenvolvimento de Jogos Eletrônicos – Teoria e Prática. 2. ed. São Paulo: Ed. Novatec, 2007.VASCONCELOS, J. B.; RIBEIRO, N. M. Tecnologias de Programaçaõ de Jogos . 1. ed. Lisboa: FCA - Editora de Informática, 2013.HUIZINGA, J. Homo ludens: O jogo como elemento da cultura. São Paulo: Perspectiva, 1996.", "META-HEURÍSTICAS:Introdução a heurísticas e meta-heurísticas. Algoritmos Gulosos. Busca Local. Busca Populacional. Hiper- heurísticas.Bibliografia Básica:GLOVER, F.; KOCHENBERGER, G. A Handbook of metaheuristics Boston: Kluwer Academic Publishers, 2003. 556 p. (International series in operations research & management science).TALBI, E-G. Metaheuristics from design to implementation Hoboken, N.J.: John Wiley & Sons, 2009.DRÉO, J. Metaheuristics for hard optimization: methods and case studies Berlin: Springer Berlin, 2006.Bibliografia Complementar:CHENG, R.; GEN, M. Genetic algorithms and engineering optimization. New York: Wiley, 2000. (Wiley series in engineering design and automation).ENGELBRECHT, A. P. Fundamentals of computational swarm intelligence Hoboken. NJ: Wiley, 2005.MITCHELL, M. An introduction to genetical gorithms. Cambridge: MIT Press, 1996.ROTHLAUF, F. Representations for genetic and evolutionary algorithms.2nd ed. Heidelberg: Springer, 2006.LIDEN, R. Algoritmos Genéticos. 3a.ed.Brasport, 2008.", "METODOLOGIA E EXPERIMENTAÇÃO EM ENGENHARIA DE SOFTWARE:Metodologia Científica: aplicação de metodologia científica em atividades de Engenharia de Software.Fundamentos da Engenharia de Software Experimental: contexto da experimentação na Engenharia de Software, principais tipos de experimentos aplicados à Engenharia de Software, estudos primários e secundários, revisão e mapeamento sistemático da literatura. Realização de Experimentos em Engenharia de Software.", "34 Bibliografia Básica:JURISTO, N. Basics of Software Engineering Experimentation.Kluwer Academic Publishers, 2001.WOHLIN, C. et al. Experimentation in Software Engineering. 2. ed. Springer, 2012.GETTINBY, G.; GARDINER, W. P. Experimental Design Techniques in Statistical Practice: a Practical Software-based Approach. Horwood Pub., 1998.Bibliografia Complementar:WAZLAVICK, R. S. Metodologia de Pesquisa para Ciência da Computação. Editora Campus, 2009.WOHLIN, C. et al. Experimentation in Software Engineering. Kluwer Academic, 2000.POLYAK, B. T. Introduction to Optimization. Optimization Software. 1987.HALL, E. M. Managing Risk Methods for Software Systems Development. Addison-Wesley, 1998.Qualidade no Setor de Software Brasileiro. Brasília, D. F. : MCT, 1997.", "MICROCONTROLADORES:Introdução e histórico. Famílias de microcontroladores. Arquiteturas de microcontroladores. Elementos de um microcontrolador. Registradores de controle, de estado e de funções especiais. Programação de microcontroladores. Temporizadores e contadores. Interrupções. Interfaceamento eletrônico. Dispositivos de Memória. Protocolos de comunicação. Aplicações.Bibliografia Básica:RAFIQUZZAMAN, M. Microprocessors and Microcomputer based System Design. RC Press, Boca Raton (Fla); 1990.MAZIDI, M. A.; NAIMI, Sarmad; NAIMI, Sepehr.AVR Microcontroller and Embedded Systems: Pearson New International Edition: Using Assembly and C. Pearson Education, Limited, Nov 1, 2013.CRISP, J. Introduction to Microprocessors and Microcontrollers.2. ed. Editora Elsevier, 2004.Bibliografia Complementar:TAUB, H. Circuitos Digitais e Microcontroladores. McGraw-Hill, SãoPaulo, 1984.SOUZA, D. J. Desbravando o PIC: ampliado e atualizado para PIC 16F628A. 6. ed. São Paulo: Érica, 2003. 268 p. ISBN 8571948674.ZELENOVSKY, R. Microcontroladores: programação e projeto com a família 8051, Editora MZ, 2005.PEREIRA, F. Microcontroladores MSP430: Teoria e Prática, Editora É rica, 2005.TITUS, J. A. et al. Microcomputer, analog converter software and hardware interfacing.Howard W. Sams & Co., 1979.", "PROCESSAMENTO DIGITAL DE IMAGENS:Origem e Objetivos do processamento de imagens. Fundamentos de visão computacional e seu relacionamento com a visão humana. Dispositivos e formas de aquisição de imagens. Amostragem e Quantização. Sistemas de cores. Técnicas de modificação de escala de cinza. Suavização. Aguçamento de bordas. Transformada no domínio da frequência: Fourier. Restauração de imagens. Segmentação de imagens. Extração de características e noções de descrição e representação. Reconhecimento de padrões visuais.Bibliografia Básica:GONZALES, R. C.; WOODS, R. E. Processamento Digital de Imagens. 3.ed. São Paulo: Pearson Prentice Hall, 2010.FORSYTH, D. A.; PONCE, J. Computer Vision: A Modern Approach. 2nd ed. Prentice Hall, 2011.SOLOMON C.; BRECKON, T. Fundamentos de processamento digital de imagens : uma abordagem prática com exemplos em Matlab. Rio de Janeiro : LTC, 2013.Bibliografia Complementar:PETROU, M. Image Processing: the fundamentals. 2. ed. Chichester: Wiley, 2010.BRADSKI, G. R.; KAEHLER, A. Learning OpenCV: computer vision with the OpenCV library. Sebastopol:O’Reilly, 2008.NIXON, M. S.; AGUADO, A. S. Feature extraction and image processing. Amsterdam: Academic, 2008.PRATT, W. K. Digital image processing. 4. ed. Hoboken: Wiley-Interscience, 2007.SZELISKI, R. Computer Vision Algorithms and Applications.Springer, 2011.", "RECUPERAÇÃO DE INFORMAÇÃO:Algoritmos e técnicas de Construção de máquinas de busca: representação de vocabulários, técnicas de construção e compressão de índices, processamento de consultas, avaliação em recuperação de informação, modelos de linguagem, máquinas de busca para a Web. Algoritmos e heurísticas para mineração de informações:classificação de textos, agrupamento (clustering) de textos. Tópicos de pesquisa em Recuperação de Informação.Bibliografia Básica:MANNING, C. D.; RAGHAVAN, P.; SCHÜTZE, H. Introduction to Information Retrieval, Cambridge, 2009.BAEZA-YATES, R.; RIBEIRO-NETO, B. Modern Information Retrieval: The Concepts and Technology Behind Search. 2nd ed. Addison Wesley, 2011.CROFT, W. B.; METZLER, D.; STROHMAN, T. Search Engines: information Retrieval in Practice, Addison Wesley, 2010.", "35 Bibliografia Complementar:WITTEN, I. H.; MOFFAT, A.; BELL, T. C. Managing Gigabytes: Compressing and Indexing Documents and Images. 2nd ed. Morgan Kaufmann Publishers, 1999.CHAKRABARTI, S. Mining the Web: Discovering Knowledge from Hypertext Data. Morgan Kaufmann, 2003.(The Morgan Kaufmann series in data management systems).WEISS, S. M.; INDURKHYA, N.; ZHANG, T .Fundamentals of PredictiveText Mining.Springer Science & Business Media, 2010.(Texts in Computer Science).GROSSMAN, D. A.; FRIEDER, O. Information Retrieval: Algorithms and Heuristics. Springer Science & Business Media, 2004.(Kluwer international series on information retrieval, vol. 15).ZAKI, M.J.; MEIRA, W. Data Mining and Analysis: Fundamental Concepts and Algorithms. Cambridge University Press, 2014.", "REDES DE COMPUTADORES 2:Redes sem fio e redes móveis. Redes definidas por software. Virtualização em redes. Avaliação de desempenho em redes. Gerenciamento de redes. Tópicos recentes de pesquisa em redes.Bibliografia Básica:KUROSE, J.F.; ROSS, K. Computer Networking: A Top-Down Approach. 6th ed. Pearson, 2012.STALLINGS, W. Data and Computer Communications.10th ed. Pearson, 2014.TANENBAUM, A. S. Computer Networks.5th ed. Pearson, 2010.Bibliografia Complementar:PETERSON, L. L.; DAVIE, B. S. Computer Networks: A Systems Approach.5th ed. Morgan Kaufmann, 2011.BEHROUZ F. A. Data Communications and Networking.5th ed. McGraw-Hill Education, 2012.MOLISCH, A. F. Wireless Communications. 2nd ed.John Wiley & Sons, 2011.STALLINGS, W. Foundations of Modern Networking: SDN, NFV, QoE, IoT, and Cloud. 1st ed. Addison- Wesley Professional, 2015.GRAYVER, E. Implementing Software Defined Radio. 1st ed. Springer, 2013.", "REDES NEURONAIS ARTIFICIAIS:Conceitos básicos. Redes em camadas com aprendizagem supervisionada. Redes recorrentes e de processamento temporal. Redes auto-organizáveis. Aplicações.Bibliografia Básica:BRAGA, A. P.; CARVALHO, A. P. L. F.; LUDERMIR, T. B. Redes Neurais Artificiais: Teoria e Aplicações. 2 ed. LTC, 2007.SILVA, I. N.; SPATTI, D. H.; FLAUZINO, R. A. Redes Neurais Artificiais para Engenharia e Ciências Aplicadas: Curso Prático. Ed. Artliber, 2010.HAYKIN, S. Redes Neurais: Princípios e Prática. 2. ed. Bookman, 2001.Bibliografia Complementar:FACELI, K.; LORENA, A. C.; GAMA, J.; CARVALHO, A. P. L. F. Inteligência Artificial: Uma Abordagem de Aprendizado de Máquina, LTC, 2011.HAN, J.; KAMBER, M.; PEI, J. Data Mining: Concepts and Techniques, 3rd ed. Morgan Kaufmann Publishers, 2011.WITTEN, I. H.; FRANK, E.; HALL, M. A. Data Mining: Practical Machine Learning Tools and Techniques. 3rd ed. Morgan Kaufmann Publishers, 2011.TAN, P-N.; STENBACH, M.; KUMAR, V. Introduction to Data Mining.Addison-Wesley, 2005.ALPAYDIN, E. Introduction to Machine Learning. MIT Press, 2004.", "SEGURANÇA E AUDITORIA DE SISTEMAS:Auditoria de sistemas. Políticas de segurança. Classificação das informações. Normas de segurança. Ética em segurança da informação. Segurança de sistemas. Ameaças e Ataques. Vulnerabilidades em softwares, serviços e protocolos. Aspectos especiais: vírus, fraudes, criptografia, acesso não autorizado. Engenharia Social. Tópicos Emergentes em Segurança.Bibliografia Básica:IMONIANA, JOSHUA O. Auditoria de Sistemas de Informaçaõ .2.ed. São Paulo: Atlas, 2008.SCHMIDT, P. Fundamentos de Auditoria de Sistemas. São Paulo: Atlas, 2006.STALLINGS, W. Criptografia e segurança de redes : princípios e práticas. 4. ed. Prentice Hal, 2008.Bibliografia Complementar:LYRA, M. R. Segurança e Auditoria em Sistemas de Informação. 1. ed.Ciência Moderna. 2009.KIZZA, J. Computer Network Security. New York: Springer, 2005.KUROSE, J. F. ;ROSS, K. Redes de Computadores e a Internet. 6. ed. Pearson Education, 2013.TCU. Manual de Auditoria Operacional do TCU. TCU, 2010.TIPTO, H. F. Information Security Management Handbook. Auebach Publications, 2004.", "36 SISTEMAS MULTIAGENTES:Introdução à Inteligência Artificial e Agentes Inteligentes. Arquiteturas para construção de Sistemas Multiagentes (SMA). Comunicação e cooperação em SMA. Tomada de Decisão em SMA.Bibliografia Básica:FIPA.Foundation for Intelligent Physical Agents , Standard Specifications , 2002. ( Disponível on -line em <http://www.fipa.org/repository/standardspecs.html>) RUSSELL, S.; NORVIG, P. Inteligência Artificial. 3. ed. Campus, 2013.WOOLDRIDGE, M. An Introduction to MultiAgent Systems. 2. ed. John Wiley and Sons, 2009.Bibliografia Complementar:BELLIFEMINE, F. et al. Jade 4.0 Programmer’s Guide , 2010. ( Disponível on -line em <http://jade.tilab.com/documentation/tutorials-guides/>).BORDINI, R. H.; HÜBNER, J. Documentation for Jason, a Java-besed interpreter for an extended version of AgentSpeak. 2006. (Disponível on-line em <http://jason.sourceforge.net/wp/documents/>).CAIRE, G. Jade 3.7 Programming for Beginners , 2009. ( Disponível on -line em <http://jade.tilab.com/documentation/tutorials-guides/>).SHOHAM, Y.; LEYTON-BROWN, K. Multiagent Systems - Algorithmic, Game-Theoretic, and Logical Foundations. Cambridge University Press2008.(Disponível on-line em <http://www.masfoundations.org/ mas.pdf>).VIDAL, J. M. Fundamentals of Multiagent Systems Using Net Logo , 2010.(Disponívelon-line em <http://multiagent.com/p/fundamentals-of-multiagent-systems.html>).", "TÓPICOS AVANÇADOS EM REDES SEM FIO:Introduzir conceitos atuais, tendências e desafios de pesquisa em redes sem fio. Estudar e explorar as novas aplicações e cenários onde o emprego de rede sem fio é recente (objetivos básicos, características e desafios).Estudar e compreender algumas das principais tecnologias de redes sem fio atuais e futuristas (principalmente soluções desenvolvidas nas camadas Física, de Enlace e de Rede). Estudar e aplicar métodos de avaliação de desempenho através de ferramentas usadas para simular/emular redes sem fio, como também alguns ambientes de testes disponíveis para uso público com objetivo de avaliar abordagens propostas para redes sem fio em um ambiente mais realista. Empregar técnicas/conceitos de metodologia científica para elaboração/identificação de problemas, escrita de artigos e apresentação de trabalhos.Bibliografia Básica:KUROSE, J.F.; ROSS, K. Computer Networking: A Top-Down Approach, 6th ed. Pearson, 2012.STALLINGS, W. Data and Computer Communications.10th ed. Pearson, 2014.TEWART, W. J. Probability, Markov chains, queues and simulation: the mathematical basis of performance modeling, 1st ed. Princeton University Press, 2009.Bibliografia Complementar:PETERSON, L. L.; DAVIE, B.S. Computer Networks: A Systems Approach.5th ed. Morgan Kaufmann, 2011.BEHROUZ F. A. Data Communications and Networking.5th ed. McGraw-Hill Education, 2012.MOLISCH, A. F. Wireless Communications. 2nd. ed. John Wiley & Sons, 2011.STALLINGS, W. Foundations of Modern Networking: SDN, NFV, QoE, IoT, and Cloud. 1st ed. Addison- Wesley Professional, 2015.GRAYVER, E. Implementing Software Defined Radio. 1st ed. Springer, 2013.", "TÓPICOS EM COMPUTAÇÃO:Tópico variável em Ciência da Computação segundo tendências atuais na área.Bibliografia Básica:A bibliografia deve ser definida de acordo com o tema a ser ministrado.Bibliografia Complementar:A bibliografia deve ser definida de acordo com o tema a ser ministrado.", "TÓPICOS EM TESTE DE SOFTWARE:Fundamentos Teóricos. Teste Funcional. Teste estrutural. Análise de Mutantes. Oficina em teste de software:experimentação e análise empírica.Bibliografia Básica:MYERS, G. J. The Art of Software Testing.Wiley, 2011.DELAMARO, M. E.; Maldonado, J. C.; JINO, M. Introdução ao Teste de Software. Campus, 2007.COPELAND, L. A Practitioner’s Guide to Software Test Design.ArtechHouse, 2003.Bibliografia Complementar:PEZZÈ, M., YOUNG, M. Teste e análise de software: processos, princípios e técnicas. Bookman, 2008.BINDER, R. V. Testing Object Oriented Systems: Models, Patterns, and Tools. AddisonWesley, 1999.ISO/IEC/IEEE29119-1. International Standard for Software and systems engineering-Software testing - Part 1:Concepts and definitions, 2013.ISO/IEC/IEEE29119-4. International Standard for Software and systems engineering-Software testing - Part 4:Test techniques, 2015.PERRY, W. E. Effective methods for software testing.2nd. Edition. J. Wiley, 1999.", "37 VERIFICAÇÃO FORMAL DE PROGRAMAS:Sistemas de Dedução Natural para Lógicas Proposicional e de Predicados. Lambda-calculus com tipos simples.Isomorfismo de Curry-Howard-de Bruijn. Extração de código. Tipos Indutivos. Polimorfismo. Produtos Dependentes. Definições Impredicativas. Definições Indutivas. Objetos e Provas Infinitos. Coindução. Subtipos.Checagem de Tipos. Normalização. Provas por reflexão.Bibliografia Básica:NEDERPELT, R.; GEUVERS, H. .Type Theory and Formal Proof: An Introduction. Cambridge University Press, 2014.RAAMSDONK, F. Logic Verification : Course Notes . Vrije Universiteit Amsterdam , 2008.(Disponível em http://www.cs.ru.nl/ freek/courses/tt-2014/public/notes.pdf).CHIPALA, A. Certified Programming with Dependent Types: A Pragmatic Introduction to the Coq Proof Assistant. MIT Press 2013.Bibliografia Complementar:PIERCE, B. C. Advanced topics in types and programming languages. MIT Press, 2005.PIERCE, B. C. Types and Programming Languages. MIT Press, 2002.BERTOT, Y; CASTÉRAN, P. Interactive Theorem Proving and Program Development: Coq’Art: The Calculus of Inductive Constructions. Springer, 2004.(In EATCS Series Texts in Theoretical Computer Science).FRIEDMAN, D. P; EASTLUND, C.The Little Prover.MIT Press, 2015.GUNTER, C. A. Semantics of Programming Languages: Structures and Techniques. MIT Press, 1992.(In Foundations of Computer Series).", "VISÃO ROBÓTICA:Processo de formação de imagens. Transformações 2D e 3D. Modelos de câmeras. Geometria de câmeras. Calibração de câmeras. Filtragem, segmentação e extração de características. Visão estéreo. Rastreamento em vídeo.Bibliografia Básica:HARTLEY, R.; ZISSERMAN, A. Multiple view geometry in computer vision.Cambridge university press, 2003.CORKE, P. Robotics, vision and control: fundamental algorithms in MATLAB. Vol. 73.Springer, 2011.SZELISKI, R. Computer vision: algorithms and applications. Springer Science & Business Media, 2010.Bibliografia Complementar:TRUCCO, E.; VERRI, A. Introductory Techniques for 3-D Computer Vision. Prentice Hall, New Jersey, 1998.DAVIES, E. R.; Computer and machine vision: theory, algorithms, practicalities. Academic Press, 2012.NIXON, M. S.; AGUADO, A. S. Feature extraction & image processing for computer vision.Academic Press, 2012.FORSYTH, D. A.; PONCE, J. \"Computer Vision - A Modern Approach\", Prentice Hall, New Jersey, 2003.GONZALEZ, R. C.; WOODS, R. E. Digital lmage Processing. Prentice Hall, 3th Edition, 2008.", "VISUALIZAÇÃO DE INFORMAÇÕES:Definições, história, modelos e categorias de visualizações de informação. Semiótica e percepção visual.Expressividade e efetividade de visualizações. Interação com o usuário. Exemplos de técnicas de visualização de informações. Metodologias para desenvolvimento de uma visualização de informação. Avaliação de visualizações. Tendências futuras na área.Bibliografia Básica:CARD, S. K.; MACKINLAY, J. D.; SHNEIDERMAN, B. Readings in Information Visualization: Using Vision to Think. Morgan Kaufmann Series in Interactive Technologies, Academic Press, 1999.SPENCE, R. Information Visualization: An Introduction. 3rd edition, Springer, 2014.WARE, C. Information Visualization: Perception for Design. 3rd ed. Morgan Kaufmann Interactive Technologies, 2012.Bibliografia Complementar:FEW, S. Now You See It: Simple Visualization Techniques for Quantitative Analysis. Analytics Press, 2009.TAMASSIA, R. Handbook of Graph Drawing and Visualization (Discrete Mathematics and Its Applications).1st edition, Chapman and Hall/CRC, 2013. (Acesso digital em https://cs.brown.edu/ rt/gdhandbook/).TUFTE, E. R. Visual Explanations: Images and Quantities, Evidence and Narrative. Graphics Press, 1997.TUFTE, E. R. Envisioning Information. Graphics Press, 1990.TUFTE, E. R. The Visual Display of Quantitative Information, 2nd ed.Graphics Press, 2001.", "WEB SEMÂNTICA:Fundamentos e arquitetura da Web Semântica. Linguagens e/ou padrões para especificação de caracteres, localização, sintaxe, estrutura e semântica de informação. Ontologias. Framework para programação de aplicações para Web Semântica.Bibliografia Básica:BREITMAN, K. Web Semântica: a Internet do Futuro. Editora LTC, 2005.DUCHARME, B. Learning SPARQL. 1st ed. O ́Reilly, 2011.HEBELER, J.; DEAN, M.; FISHER, M. Semantic Web Programming.2nd ed. John Wiley & Sons, 2009.", "38 Bibliografia Complementar:ALLEMANG, D.; HENDLER, J. Semantic Web for the Working Ontologist: Effective Modelling in RDFS and OWL.1st ed. Morgan Kaufmann, 2008.BERNERS-LEE, T.; HENDLER, J.; LASSILA, O.The Semantic Web.Scientific American, 2001. 284(5), 28-37.BERNERS-LEE, T. Qual é o futuro da web , segundo o seu criador . 2007.( Disponível em computerworld.uol.com.br/mercado/2007/07/09/idgnoticia.2007-07-09.9970442373/).FENSEL, D.; HENDLER, J.; LIEBERMAN, H.; WAHLSTER, W. Spinning the Semantic Web. 1st ed. The MIT Press, 2005.SEGARAN, T.; EVANS, C.; Taylor, J. Programming the Semantic Web.1st. ed. O’Reilly Media, 2009.", "6.3 Sugestão de Fluxo Curricular 1o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Cálculo 1A 96 Obrigatória Comum Computação e Sociedade 32 Obrigatória Comum Fundamentos de Matemática para Computaçaõ 64 Obrigatória Comum Introdução à Programação 128 Obrigatória Comum TOTAL PERÍ ODO 320h TOTAL GERAL 320h", "2o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Algoritmos e Estruturas de Dados 1 64 Obrigatória Comum Cálculo 2A 96 Obrigatória Específico Física I 64 Obrigatória Específico Geometria Analit́ ica 64 Obrigatória Específico Lógica Matemática 64 Obrigatória Comum TOTAL PERÍ ODO 352h TOTAL GERAL 672h", "3o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Álgebra Linear 64 Obrigatória Comum Algoritmos e Estruturas de Dados 2 64 Obrigatória Comum Física III 64 Obrigatória Específico Matemática Discreta 64 Obrigatória Específico Metodologia de Pesquisa em Computaçaõ 32 Obrigatória Específico Probabilidade e Estatística A 64 Obrigatória Comum TOTAL PERÍ ODO 352h TOTAL GERAL 1.024h", "4o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Circuitos Digitais 64 Obrigatória Específico Equações Diferenciais Ordinárias 64 Obrigatória Específico Pesquisa Operacional 64 Obrigatória Específico Programação Orientada a Objetos 64 Obrigatória Comum Teoria dos Grafos 64 Obrigatória Específico TOTAL PERÍ ODO 320h TOTAL GERAL 1.344h", "39 5o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Análise e Projeto de Algoritmos 64 Obrigatória Comum Arquitetura de Computadores 64 Obrigatória Comum Cálculo Numérico 64 Obrigatória Específico Eletrônica para Computação 96 Obrigatória Específico Software Básico 64 Obrigatória Específico TOTAL PERÍ ODO 352h TOTAL GERAL 1.696h", "6o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Banco de Dados 64 Obrigatória Comum Engenharia de Software 64 Obrigatória Comum ̂ Linguagens Formais e Automatos 64 Obrigatória Específico Linguagens e Paradigmas de Programaçaõ 64 Obrigatória Comum Sistemas Operacionais 64 Obrigatória Específico TOTAL PERÍ ODO 320h TOTAL GERAL 2.016h", "7o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Introdução à Computabilidade e Complexidade 64 Obrigatória Específico Computacional Engenharia de Requisitos 64 Obrigatória Específico Optativa 1 64 Optativa Específico Sistemas Gerenciadores de Banco de Dados 64 Obrigatório Específico Redes de Computadores 1 64 Obrigatório Específico TOTAL PERÍ ODO 320h TOTAL GERAL 2.336h 8o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Computação Gráfica 64 Obrigatória Específico Inteligência Artificial 64 Obrigatória Específico Optativa 2 64 Optativa Específico Projeto de Software 64 Obrigatória Comum Projeto Final de Curso 1 64 Obrigatória Específico Sistemas Distribuídos 64 Obrigatório Específico TOTAL PERÍ ODO 384h TOTAL GERAL 2.720h", "9o PERÍODO DISCIPLINA CHT NATUREZA NÚCLEO Compiladores 64 Obrigatório Específico Computação Paralela 64 Obrigatório Específico Interação Humano-Computador 64 Obrigatória Comum Optativa 3 64 Optativa Específico Optativa 4 64 Optativa Específico Projeto Final de Curso 2 64 Obrigatório Específico TOTAL PERÍ ODO 384h TOTAL GERAL 3.104h", "40 6.4 Atividades Complementares As atividades complementares estão presentes nas estruturas curriculares dos cursos de graduação do INF, sendo regulamentadas em resolução específica do Conselho Diretor do Instituto.As atividades complementares são ações pedagógicas que visam ao enriquecimento da vivência acadêmica do aluno, ao aprofundamento de temáticas desenvolvidas no curso e à sua formação complementar. Definidas como obrigatórias na resolução supracitada, as atividades complementares incluem, dentre outras, atividades de monitoria, representação estudantil, qualificação, publicação e apresentação de trabalhos científicos e participação em projetos de pesquisa e de extensão e cultura.A carga horária das atividades complementares é de, no mínimo, 100 (cem) horas para efeito de integralização curricular no curso de BCC.O cômputo da carga horária de cada atividade complementar deverá observar o proposto em resolução específica e seus anexos. Para fins de aproveitamento, os respectivos comprovantes das atividades complementares deverão ser entregues por meio de sistema de gestão acadêmica ou segundo orientações das coordenações de cursos de graduação do INF.", "7 POLÍTICA E GESTÃO DE ESTÁGIO CURRICULAR O estágio curricular constitui-se em um mecanismo de aperfeiçoamento dos conhecimentos adquiridos pelo aluno durante o curso de graduação e tem caráter teórico-prático com o objetivo principal de proporcionar aos alunos a vivência da realidade profissional, através de experiências técnico-científicas, culturais e de relacionamento humano.O estágio curricular é de caráter não obrigatório. No entanto, caso o aluno deseje realizá- lo, o mesmo poderá fazê-lo a partir do 3º período, desde que tenha cumprido 448 (quatrocentos e quarenta e oito horas) da carga horária do curso. A carga horária semanal do estágio deverá ser compatível com as atividades acadêmicas do aluno, observando que a carga horária do estágio não poderá exceder a 6 (seis) horas/diárias, perfazendo o total de 30 (trinta) horas/semanais.O estágio poderá ser realizado somente em empresas devidamente conveniadas com a UFG ou utilizar-se de agentes de integração conveniados. Além disso, é preciso ter um supervisor no local de estágio e um professor do curso como orientador. Todas as informações sobre o estágio estão disponíveis no Caderno de Estágio que consta no Regulamento de Estágio do BCC.", "8 TRABALHO DE CONCLUSÃO DE CURSO No presente projeto pedagógico, a formação do aluno de Ciência da Computação exige o desenvolvimento de um trabalho acadêmico, denominado Trabalho de Conclusão de Curso (TCC), que visa complementar a diversidade da formação educacional. O TCC é o mecanismo que permite avaliação final e interdisciplinar do aluno, com o exercício das competências adquiridas no curso, a partir da pesquisa e desenvolvimento teórico de temas ligados à computação e da integralização da computação com outras áreas do conhecimento.Na matriz curricular do curso de Ciência da Computação, o TCC é desenvolvido durante as disciplinas de Projeto Final de Curso 1 (PFC1) e Projeto Final de Curso 2 (PFC2).As disciplinas de PFC têm como objetivo prover meios para: o desenvolvimento de projeto na área de Ciência da Computação;", "41  o desenvolvimento da capacidade criativa do aluno; estimular a originalidade e a implementação de ideias empreendedoras; valorizar as atividades de pesquisa e as habilidades de análise e síntese dos alunos; resolver problemas reais com o uso da Computação; solidificar conhecimentos técnicos e científicos adquiridos durante o curso.", "Para atingir esses objetivos, o aluno pode optar por diversos temas de TCC, tais como: projeto de pesquisa, revisão bibliográfica do estado da arte de um tema de pesquisa, desenvolvimento de software, modelagem e simulação computacional, teste e validação empírica de modelos teóricos, aplicação da computação para a solução de problemas interdisciplinares e multidisciplinares, entre outros.Os temas abordados no PFC podem ser desenvolvidos com base em projetos de pesquisa, demandas oriundas de empresas, organizações ou da sociedade, assuntos de interesse do aluno e/ou orientador. Dentro desta perspectiva espera-se que o aluno tenha a oportunidade de produzir conhecimento e aplicar conceitos teóricos em problemas reais.O resultado é uma monografia contendo todo o processo de pesquisa, análise e desenvolvimento realizado no contexto da disciplina. Eventualmente o projeto pode ser desenvolvido em cooperação com órgão ou entidade externa ao INF. O PFC é regulamentado em norma específica do INF.", "9 INTEGRAÇÃO ENSINO, PESQUISA E EXTENSÃO A promoção da integração entre ensino, pesquisa e extensão, incluindo, neste contexto, a integração entre a graduação e a pós-graduação, é um dos pilares do presente projeto pedagógico. Essa integração é realizada através de diversas de atividades curriculares e extracurriculares oferecidas durante o curso. A seguir, as principais atividades de Pesquisa, Pós-Graduação e Extensão desenvolvidas no INF/UFG são descritas, com destaque para os elementos de integração das mesmas com a graduação.", "9.1 Pesquisa Os estudantes são estimulados a se engajar em atividades de pesquisa já na primeira metade curso. Neste contexto, a disciplina Metodologia de Pesquisa em Computação tem como objetivos, além do ensino de técnicas e métodos de pesquisa científica, a apresentação dos programas e projetos institucionais de pesquisas e a divulgação de vagas para participar dos mesmos. No âmbito do INF, existem vários grupos de pesquisa ativos e certificados pelo CNPq, que atuam em diversas áreas da Computação. Muitos dos projetos de pesquisa vigentes contam com auxílio financeiro de agências executoras de políticas de C&T&I, como CNPq, FINEP e FAPEG, e envolvem também alunos de pós-graduação. A infraestrutura física para pesquisa inclui 4 (quatro) laboratórios plenamente equipados e um data center administrado pelo Núcleo de Recursos Computacionais (NRC/INF) para hospedagem de servidores de dados e processamento de alto desempenho.", "42 Apoiando as atividades de pesquisa, a UFG oferece ainda os programas de Iniciação Científica e de Desenvolvimento Tecnológico e Inovação, através da sua Pró-Reitoria de Pesquisa e Inovação, com a possibilidade de que os alunos concorram a bolsas. Anualmente, é realizado o Seminário de Iniciação Científica no escopo do Congresso de Pesquisa, Ensino e Extensão (CONPEEX), no qual são realizadas apresentações dos trabalhos de iniciação científica.As disciplinas optativas do BCC, as quais se concentram nos semestres finais do curso, podem ser ministradas por professores pesquisadores em temáticas inovadoras, permitindo assim que os alunos desenvolvam o interesse e se aprofundem em atividades de pesquisa. Isso culmina, ao final do bacharelado, no Trabalho de Conclusão de Curso (TCC), realizado através de duas disciplinas denominadas Projeto Final de Curso 1 e Projeto Final de Curso2 (PFC1 e PFC2), sob orientação de um professor. É incentivado que o TCC seja baseado nas atividades desenvolvidas em um projeto de pesquisa.", "9.2 Pós-Graduação O INF possui dois programas de pós-graduação stricto sensu em Ciência da Computação: um em nível de mestrado e o outro de doutorado, sendo este último em parceria com a Universidade Federal do Mato Grosso do Sul. Os dois programas estão consolidados, ambos com conceito 4 (quatro) pela avaliação da CAPES. O corpo de docentes permanentes no mestrado é formado por 34 (trinta e quatro) professores e, no doutorado, por 16 (dezesseis) professores, dos quais 12 (doze) são do INF. Até junho de 2016, foram realizadas 163 (cento e sessenta e três) defesas de mestrado e6 (seis) defesas de doutorado.A integração de alunos de graduação com as atividades de pós-graduação ocorre de maneira intensa no escopo dos grupos de pesquisa, através dos projetos de Iniciação Científica e no desenvolvimento de TCCs realizados em colaboração com alunos de pós- graduação. O resultado dessa integração pode ser comprovado no número crescente de produções científicas com a participação de alunos de graduação. Além disso, os alunos de graduação podem participar de palestras científicas, realizadas no escopo da pós-graduação, para aproveitamento de créditos em atividades complementares. Neste contexto, a estrutura curricular dos cursos de mestrado e doutorado incluem a disciplina obrigatória de Seminários, realizada de maneira conjugada entre os cursos, na qual são ministradas diversas palestras por alunos, professores e pesquisadores convidados.Como incentivo à continuação da formação acadêmica superior, os alunos no último ano do curso podem pleitear uma vaga de aluno especial em disciplina ofertada pelo programa de mestrado. Uma vez autorizada a inscrição, se a disciplina for concluída satisfatoriamente e, posteriormente, o aluno for aprovado no mestrado, ele poderá pleitar o aproveitamento de créditos de acordo com as normas específicas da resolução da pós-graduação stricto sensu.", "9.3 Extensão O INF desenvolve regularmente uma variedade de atividades de Extensão Universitária. Essas iniciativas são fundamentais para que o Instituto possa alicerçar-se nas prioridades locais, regionais e nacionais e potencializar a disseminação das pesquisas e do conhecimento acumulado para a sociedade. A graduação é um componente fundamental dessas atividades. Destaca-se, neste contexto, três projetos de extensão de longo prazo que contam com ampla participação de alunos de graduação: a OBI (Olimpíada Brasileira de Informática), a Maratona de Programação e o Apoema. Estes projetos promovem a aproximação da Universidade com o ensino médio e fundamental (a OBI), com alunos de graduação e pós-graduação de outras instituições de ensino superior nacionais e internacionais (a Maratona de Programação) e com empresas de inovação (via o Apoema), respectivamente.", "43 10 METODOLOGIAS DE ENSINO E APRENDIZAGEM O curso de BCC cobre diversos conteúdos, sendo alguns deles fortemente teóricos, enquanto outros possuem com enfoque mais prático. Assim, é importante que haja flexibilidade a fim de que o professor possa adotar a metodologia de ensino e de aprendizagem mais adequada à disciplina e ao contexto da aula. No entanto, alguns procedimentos mínimos são aqui padronizados, além daqueles determinados pelas resoluções da UFG, de forma a obter um melhor comprometimento e aproveitamento do aluno frente à meta de tornar-se um profissional altamente qualificado: o conteúdo ministrado deve, sempre que possível, ser conectado às suas aplicações e aos assuntos das demais disciplinas; deve ser apresentada uma visão histórica da evolução do conteúdo a ser aprendido, bem como as tendências futuras de desenvolvimento do mesmo, de modo que o aluno possa contextualizar a subárea em estudo e perceber novas oportunidades de investigação científica; nesse último aspecto, é importante que o professor faça o vínculo da disciplina com a pesquisa científica, discutindo com os alunos linhas de investigação recentes sobre o tema; os alunos devem ser orientados sobre formas efetivas de estudar o conteúdo e sobre o tempo semanal extraclasse mínimo que, em geral, devem reservar para tanto; devem ser passadas continuamente atividades práticas (a serem realizadas em sala de aula ou extraclasse) que exijam que o aluno se aprofunde no conteúdo visto na aula e que elabore suas próprias soluções para os problemas apresentados; recursos atuais de apoio ao ensino/aprendizado, como ambientes virtuais de aprendizado, redes sociais, vídeo aulas e sistemas computacionais de simulação, podem e devem ser utilizados para promover o maior acesso do aluno ao conhecimento e motivar o seu envolvimento com a disciplina, com o professor e com os demais colegas de turma.O docente, neste processo, deverá utilizar, além do conhecimento específico, um conhecimento pedagógico-didático que o possibilite organizar o programa da disciplina para partilhá-lo de maneira sistemática e motivante com os alunos. O planejamento pedagógico semestral do curso compreenderá atividades para auxiliar os docentes a adquirirem a formação necessária para tal finalidade.O sistema de avaliação do processo de ensino e de aprendizagem deve ser contínuo, atual e transparente, possibilitando ao aluno e ao docente constatarem dificuldades de aprendizado e promoverem meios para saná-las em tempo hábil. A avaliação do aluno poderá ser realizada na forma de provas, trabalhos, seminários, relatórios ou outros modos de produção acadêmica escrita, oral, prática ou audiovisual, segundo o Regulamento Geral dos Cursos de Graduação da UFG. Ela deve, contudo, focar na verificação da capacidade do aluno em aplicar o conteúdo aprendido para a resolução de problemas e para a construção de novas soluções, o que tem mais chances de demonstrar um aprendizado efetivo do que a mera replicação de conhecimento.", "11 SISTEMA DE AVALIAÇÃO DO PROJETO DE CURSO A avaliação do curso é realizada regularmente, e em conformidade com a Política de Avaliação Institucional. A UFG mantém sua Avaliação Institucional, através da Comissão Própria de Avaliação (CPA), que reuni dados relativos às disciplinas, professores, autoavaliações de alunos, Coordenação de Curso, infraestrutura, responsabilidade social, entre outros. Semestralmente, os professores do curso se reúnem para a Semana de Planejamento Pedagógico, prevista no Calendário Acadêmico da UFG. Nesta ocasião, o NDE lidera a análise destes dados e produz um relatório que dá encaminhamento às questões apontadas.", "44 A avaliação interna considera o desenvolvimento das atividades de ensino, pesquisa e extensão no espaço universitário, bem como as relações entre as áreas. A avaliação externa leva em conta informações via formulário Web de profissionais da área, ex-alunos e comunidade em geral, assim como resultados das participações discentes no ENADE e Poscomp (exame nacional para a Pós-Graduação na Computação). Os mecanismos de avaliação interna e externa favorecem oportunidades de avaliação crítica do curso de BCC e da própria Universidade, a fim de identificar os avanços ou possíveis deficiências no tocante a sua oferta para a comunidade local e regional.", "12 POLÍTICA DE QUALIFICAÇÃO DOCENTE E TÉCNICO-ADMINISTRATIVO DA UNIDADE ACADÊMICA Desde a sua criação, o INF apoia a capacitação do seu corpo docente, a qual inclui a meta de que todos os docentes tenham a titulação mínima de doutor. De fato, a liberação de docentes para prosseguirem os seus estudos de pós-graduação é uma prática comum, em consequência, nenhum pedido para afastamento com o propósito de realizar o doutorado foi negado até o momento. Essa política é acrescentada de regras institucionalizadas para a concessão de afastamento para o pós-doutorado e de licença para capacitação.A qualificação de docentes do INF também pode ser obtida pela sua participação em congressos, simpósios, dentre outros eventos, quer seja nos papéis de autor de artigo, organizador de evento, membro de comitê de programa ou avaliador de artigo. O INF ainda financia ou co-financia viagens e inscrições de seus docentes em congressos e simpósios importantes, principalmente quando há publicação de artigo.Em harmonia com a política de capacitação docente, o INF é favorável ao aprimoramento e à capacitação de seu corpo técnico-administrativo em Educação (TAE).Normalmente, os TAEs fazem solicitação ao diretor do INF que lança as intenções de afastamento no plano anual de capacitação, que deve ser aprovado no Conselho Diretor do INF, haja vista que é do seu interesse fomentar a especialização e capacitação dos seus profissionais. É frequente a liberação das atividades de TAE para que possam participar de treinamentos, tanto em cursos esporádicos quanto em programas de pós-graduação. Por exemplo, atualmente um técnico administrativo está afastado para cursar doutorado em Computação. Em tempo, as ações de extensão do INF reservam vagas exclusivas para participação de TAEs, sem necessidade de pagamento (quando for o caso).Do ponto de vista legal, o INF se apoia na Resolução CEPEC N° 1286 de 2014, que regulamenta o afastamento de docentes para cursar Mestrado, Doutorado e estágios Pós- Doutorais, e na Resolução CONSUNI N2#2 002 de 2014, que regulamenta o Programa de Capacitação e o Plano Anual de Capacitação dos TAEs. Em consonância com a Resolução CEPEC N° 1286 de 2014, o INF instrui o afastamento de docentes com a Resolução CD/INF N° 01 de 2014, que dá suporte ao planejamento administrativo e incentiva a participação de seus docentes, em cursos de doutorado, pós-doutorado e capacitação, no País e no exterior, de acordo com a sua política de pessoal para o ensino, a pesquisa, a extensão e a administração.", "13 REQUISITOS LEGAIS E NORMATIVOS O curso de BCC contempla requisitos legais específicos, a saber, Educação das Relações Étnico-raciais e para o Ensino da História e Cultura Afro-brasileira e Indígena, Libras, Política de Educação Ambiental.A atenção a tais requisitos se verifica por meio de disciplinas e de um Programa de Extensão, devidamente institucionalizado na unidade executora do curso, conforme detalhado nas seções seguintes.", "45 13.1 Diretrizes Curriculares Nacionais do Curso No presente PPC, o objetivo do curso, o perfil do egresso, as habilidades e competências do egresso e a matriz curricular estão coerentes com as Diretrizes Curriculares Nacionais, sendo fundamentado na Lei Nº 9.394/96, de diretrizes e bases da educação nacional, e no parecer CNE/CES Nº 136/2012, aprovado em 8 de março de 2012, que institui diretrizes curriculares nacionais para os cursos de graduação em Computação.", "13.2 Diretrizes Curriculares Nacionais para Educação das Relações Étnico-Raciais e para o Ensino de História e Cultura Afro-Brasileira e Indígena A Resolução Nº 1, de 17 de junho de 2004, trata das Diretrizes Curriculares Nacionais para a Educação das Relações Étnico-Raciais e para o Ensino de História e Cultura Afro-Brasileira e Africana.O objetivo é claro: “combater o racismo e as discriminações que atingem particularmente os negros. Nessa perspectiva, propõe a divulgação e produção de conhecimentos, a formação de atitudes, posturas e valores que eduquem cidadãos orgulhosos de seu pertencimento étnico-racial, descendentes de africanos, povos indígenas, descendentes de europeus, de asiáticos.” Tal objetivo pressupõe a “adoção de políticas educacionais e de estratégias pedagógicas de valorização da diversidade”, conforme consta na Resolução, assim como os princípios a serem observados para atendê-la: (a) consciência política e histórica da diversidade; (b) fortalecimento de identidades e de direitos e (c) ações educativas de combate ao racismo e a discriminações.O Art. 7º da Resolução ainda destaca: “as instituições de ensino superior, respeitada a autonomia que lhe é devida, incluirão nos conteúdos de disciplinas e atividades curriculares dos diferentes cursos que ministram, a Educação das Relações Étnico-Raciais, bem como o tratamento de questões e temáticas que dizem respeito aos afrodescendentes.” Tendo em vista o requisito legal estabelecido pela Resolução, duas linhas de atuação são adotadas pelo BCC: inserção de conteúdo pertinente em duas disciplinas curriculares obrigatórias e o Programa Institucional de extensão do Instituto de Informática. Ambas comentadas abaixo.", "Disciplinas de Graduação Obrigatórias As disciplinas Computador e Sociedade e Interfaces Homem-Computador incluem, em seus ementários, tópicos pertinentes às exigências da Resolução. Em particular, remetem para o conhecimento de questões pertinentes ao continente africano e para o conhecimento e respeito à diversidade. Na disciplina Computação e Sociedade, são abordadas questões raciais e de inclusão digital relacionadas à Computação, além de ética na Computação. Na disciplina Interação Humano-Computador foram abordadas características humanísticas e biológicas, envolvendo questões sobre genealogia, gênero, aspectos étnicos, raciais e culturais, direitos e aspectos políticos, deficiências, limitações e capacidades, dentre outros. A Educação das Relações Étnico- Raciais tem por objetivo a divulgação e produção de conhecimentos, bem como de atitudes, posturas e valores que eduquem cidadãos quanto à pluralidade étnico-racial, tornando-os capazes de interagir e de negociar objetivos comuns que garantam, a todos, respeito aos direitos legais e valorização de identidade, na busca da consolidação da democracia brasileira.", "Programa Institucional O Programa Institucional de extensão do Instituto de Informática será realizado por meio de ações, boa parte com ênfase na socialização de conhecimento sobre questões pertinentes à formação dos brasileiros, o que invariavelmente inclui negros e indígenas. Esse conhecimento é indispensável para a promoção da diversidade, do respeito às diferenças e da", "46 igualdade independente das crenças, sexo, idade, cor, e condição social. O INF, por meio desse programa de extensão, dedicado exclusivamente às relações étnico-raciais e ao meio ambiente, oferece atuação contínua sobre esses tópicos, durante toda a permanência dos seus estudantes nessa unidade, sejam de graduação ou pós-graduação. Especificamente, sobre questões de cunho étnico-racial, sem a intenção de ser uma apresentação exaustiva, nem restritiva, são identificadas algumas ações possíveis: ações afirmativas por meio de cursos de extensão; ações para promoção da diversidade; palestras sobre a construção de uma sociedade justa; palestras sobre a diversidade da formação dos brasileiros; palestras sobre a história afro-brasileira, sobre a história africana; palestras sobre os povos indígenas; apresentações artísticas que valorizem a cultura africana e indígena.", "13.3 Disciplina LIBRAS O Decreto 5.626/2005 regulamenta a Lei 10.436, de 24 de abril de 2002, e o artigo 18 da Lei 10.098, de 19 de dezembro de 2000. Segundo esse Decreto, a disciplina curricular Libras é obrigatória para vários cursos, dentre eles, as licenciaturas e os cursos de Fonoaudiologia. O Decreto também estabelece que, nos demais cursos, a disciplina curricular Libras seja optativa, conforme o Capítulo II, § 2º: “a Libras constituir-se-á em disciplina curricular optativa nos demais cursos de educação superior”. A disciplina de Libras faz parte da Matriz Curricular do Projeto Pedagógico do curso de Ciência da Computação como uma disciplina optativa de 32 horas, e será ministrada pela Faculdade de Letras da Universidade Federal de Goiás.", "13.4 Políticas de Educação Ambiental A Lei 9.795, de 27 de abril de 1999, institui a Política Nacional de Educação Ambiental, que é regulamentada pelo Decreto 4.281, de 25 de junho de 2002. Conforme essa Lei, Seção II, Art. 10, “a educação ambiental será desenvolvida como uma prática educativa integrada, contínua e permanente em todos os níveis e modalidades do ensino formal.” Adicionalmente, lê-se na Seção II, Art. 10, § 1º: “a educação ambiental não deve ser implantada como disciplina específica no currículo de ensino”. O destaque (negrito) é do presente documento. O BCC trata a Educação Ambiental por duas linhas contínuas de atuação: uma delas baseada no planejamento das disciplinas e outra em programa institucional do INF, ambas comentadas abaixo.", "Planejamento das Disciplinas Na disciplina Computação e Sociedade, a preocupação com educação ambiental será abordada nos assuntos de lixo eletrônico, reaproveitamento eletrônico, entre outros temas relacionados. Além disso, a matriz curricular conta com uma disciplina optativa chamada de Computação Verde que tem como objetivo proporcionar ao aluno o contato com a sustentabilidade e eficiência energética em computação, Internet e redes de comunicação;estudar a fundamentação teórica e prática de eficiência energética na Internet; identificar, avaliar, aplicar e desenvolver metodologias e técnicas de eficiência energéticas recentes na área de computação; e aplicar técnicas e métodos recentes de computação verde através de estudo de caso em ambiente real e simulado. Com essas abordagens, esperamos cumprir o papel social na política de educação ambiental no curso de Ciência da Computação.", "Programa Institucional A UFG possui um Plano de Logística Sustentável (PLS), que estabelece práticas de sustentabilidade e racionalização de gastos e processos na administração pública, disponível em https://sustentabilidade.prodirh.ufg.br/. Esse plano é internalizado no INF por um Programa Institucional de extensão.", "47 O PLS une o cotidiano da prática acadêmica com atitudes “sustentáveis” por meio de recomendações simples, como a impressão em ambos os lados de uma folha e a redução do uso de copos descartáveis, dentre muitas outras.O Programa Institucional reúne ações que contemplam as orientações do PLS. O objetivo é colocar em prática essas orientações. Por exemplo, enquanto o PLS sugere a coleta seletiva, esse programa cria um repositório para coleta de pilhas e baterias já utilizadas, além de assegurar que aquele material coletado será descartado de forma correta.O Programa Institucional possui objetivos e ações que incluem a educação ambiental. As opções de ações variam. Dentre elas uma é constante: avaliação dos resultados.Dentre as demais: elaboração de material de conscientização sobre consumo parcimonioso de água e energia; palestras e cursos sobre TI Verde (green computing); pesquisa sobre consumo de energia por datacenters; divulgação e destaque de informações sobre o meio ambiente; monitoramento e divulgação de informações ambientes sobre diversas localidades, em particular do estado de Goiás; divulgação de softwares que promovem o meio ambiente, por exemplo, evitam deslocamentos, evitam consumo de energia.", "13.5 Diretrizes Nacionais para Educação em Direitos Humanos A disciplina de Computação e Sociedade trata questões importantes sobre direitos humanos no que tange a: aspectos profissionais; participação de mulheres na computação;evolução de aplicações com acessibilidade; dentre outros nos quais os direitos humanos precisam de discussões mais aprofundadas na Computação. Na disciplina de Interação Humano-Computador as características humanísticas, culturais, de direitos humanos e de aspectos políticos são abordados mais a fundo.", "13.6 Proteção dos Direitos da Pessoa com Transtornos do Espectro Autista A proteção dos direitos da pessoa com transtorno do espectro autista é fundamentada na Lei nº 12.764 de 27 de dezembro de 2012, que institui a política nacional de proteção dos direitos da pessoa com transtorno do espectro autista, e altera o § 3º do art. 98 da Lei no 8.112, de 11 de dezembro de 1990. Esse requisito legal é atendido por meio da disciplina obrigatória Interação Humano-Computador que inclui em seu ementário tópicos pertinentes ao tratamento de características humanísticas e biológicas na construção de interfaces de usuário. Além disso, a disciplina optativa Jogos Digitais tem o objetivo de desenvolver no aluno a capacidade de escrever, ambientar e implementar jogos em 2D ou 3D em computadores, dispositivos móveis e Web possibilitando ao aluno se capacitar a construir jogos para usos diversos desde a educação, reabilitação, diversão e simulação. Existem muitos jogos voltados para diversas necessidades especiais, possibilitando os alunos a conhecer a área de Transtorno do Espectro Autista e se dedicar a produzir jogos para pessoas com tais necessidades especiais."]}