{"title": "Resolucao_CEPEC_2017_1557(RGCG)", "paragraphs": ["SERVIÇO PÚBLICO FEDERAL UNIVERSIDADE FEDERAL DE GOIÁS RESOLUÇÃO - CEPEC Nº 1557R (Reeditada com as alterações introduzidas pelas Resoluções - CEPEC Nº 1612, de 30 de novembro de 2018, Nº 1661, de 29 de novembro de 2019 e CONSUNI Nº 33/2020, de 14 de agosto de 2020)", "Aprova o Regulamento Geral dos Cursos de Graduação (RGCG) da Universidade Federal de Goiás, e revoga as disposições em contrário (as alterações trazidas pela Resolução CONSUNI Nº 33/2020, de 14 de agosto de 2020, são de caráter temporário).", "O CONSELHO DE ENSINO, PESQUISA, EXTENSÃO E CULTURA DA UNIVERSIDADE FEDERAL DE GOIÁS, no uso de suas atribuições legais, estatutárias e regimentais, reunido em sessão plenária realizada 1º de dezembro de 2017 e tendo em vista o que consta do Processo n° 23070.008521/2008-42,", "R E S O L V E:Art. 1º Aprovar o Regulamento Geral dos Cursos de Graduação (RGCG) da Universidade Federal de Goiás, na forma do Anexo a esta Resolução.Art. 2º Esta Resolução entra em vigor conforme o disposto nos artigos 130 e 131 do anexo desta, revogando-se as disposições em contrário.", "Goiânia, 1º de dezembro de 2017.Prof. Orlando Afonso Vale do Amaral - Reitor - ANEXO DA RESOLUÇÃO – CEPEC Nº 1557R", "REGULAMENTO GERAL DOS CURSOS DE GRADUAÇÃO (RGCG) TÍTULO I DAS DISPOSIÇÕES INICIAIS Art. 1º Os cursos de graduação da Universidade Federal de Goiás (UFG) conferirão grau acadêmico bacharelado ou licenciatura, nas modalidades presencial ou a distância.", "Parágrafo único. Os cursos de graduação poderão ter habilitações e/ou ênfases, de acordo com seus projetos pedagógicos.Parágrafo único. Os cursos de graduação poderão ser distinguidos por suas habilitações, bem como possuir ênfases, de acordo com seus projetos pedagógicos. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Art. 2º Os cursos de graduação terão suas atividades acadêmicas e sua estrutura curricular organizadas em períodos letivos, conforme o projeto pedagógico e o presente Regulamento.§ 1º Os períodos letivos terão duração equivalente a um semestre letivo, conforme estabelecido no calendário acadêmico da UFG, aprovado pelo Conselho de Ensino, Pesquisa, Extensão e Cultura - CEPEC.", "§ 2º O semestre letivo independe do semestre civil e deverá ter, no mínimo, 100 (cem) dias letivos.§ 2º O semestre letivo independe do semestre civil e deverá compreender um período necessário para o cumprimento da carga horária dos componentes ofertados.(Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "TÍTULO II DO ENSINO DE GRADUAÇÃO Capítulo I Da Organização dos Cursos de Graduação", "Seção I Do Curso de Graduação e do Projeto Pedagógico do Curso Art. 3º Curso de Graduação compreende conteúdos, experiências, estágios e situações de ensino-aprendizagem, em que se articulam atividades de ensino, pesquisa e extensão, voltados para a formação profissional e humanística de estudantes, constituindo um projeto pedagógico específico, por unidade acadêmica ou unidade acadêmica especial, na modalidade presencial ou a distância e grau acadêmico bacharelado ou licenciatura.", "2 Art. 4º Todo curso de graduação será estruturado por meio de um projeto pedagógico, em consonância com o que dispõem o Estatuto, o Regimento e as resoluções da UFG, as diretrizes curriculares do Conselho Nacional de Educação (CNE), a Lei de Diretrizes e Bases da Educação Nacional (LDB) e as demais normas legais em vigor.", "Art. 5º O Projeto Pedagógico de Curso (PPC) é o documento norteador da ação educativa do curso e explicita os fundamentos políticos, filosóficos e teórico- metodológicos, os objetivos, o tipo de organização, bem como as formas de implementação e avaliação do curso.", "§ 1º A proposta do PPC deverá ser elaborada pelo Núcleo Docente Estruturante (NDE) do curso, designado pela unidade acadêmica ou unidade acadêmica especial responsável pelo curso, com a participação de todas as unidades envolvidas na oferta de componentes curriculares.", "§ 2º No caso de criação de novo curso que não possua NDE constituído, o PPC poderá ser elaborado por comissão designada pela unidade acadêmica ou unidade acadêmica especial responsável.Art. 6º O PPC poderá prever, nos cursos presenciais, aulas de componentes curriculares ministrados na modalidade a distância, de acordo com a legislação vigente.", "Art. 7º O PPC deve contemplar, no mínimo, os seguintes itens:I- apresentação;II- exposição de motivos;III- objetivos (geral e específicos);IV- princípios norteadores para a formação profissional;V- expectativas da formação do profissional;VI- estrutura curricular;VII- política e gestão de estágio curricular obrigatório e não obrigatório;VIII- trabalho de conclusão de curso;IX- integração ensino, pesquisa e extensão;X- sistema de avaliação do processo de ensino e de aprendizagem;XI- sistema de avaliação do projeto de curso;XII- política de qualificação de docentes e técnico-administrativos da unidade acadêmica ou unidade acadêmica especial;XIII- requisitos legais e normativos obrigatórios;XIV- dinâmica das atividades (para os cursos na modalidade à distância);XV- ementas, Bibliografia Básica e Complementar;XVI- referências;XVII- apêndices.", "Parágrafo único. A elaboração de PPC’s, no âmbito da UFG, deve estar de acordo com as políticas do Plano de Desenvolvimento Institucional (PDI)e será regulamentada por norma específica.Seção II Da Estrutura do Currículo do Curso de Graduação", "3 Art. 8º O currículo do curso deve ser estruturado em componentes curriculares, de natureza obrigatória, na forma de Núcleo Comum (NC); de natureza obrigatória e/ou optativa, na forma de Núcleo Específico (NE); na forma de Núcleo Livre (NL) e Atividades Complementares (AC).", "Parágrafo único. Componentes curriculares podem ser vinculados a mais de uma matriz curricular, independente de sua natureza e forma.Art. 9º Componentes curriculares compreendem disciplinas, módulos, seminários de integração e atividades orientadas.", "§ 1º Disciplina é uma das formas pela qual o conhecimento se organiza como saber acadêmico, com vistas à aprendizagem do estudante.§ 2º Módulo é a organização curricular composta de saberes ou conceitos articulados de diferentes áreas do conhecimento.", "§ 3º Seminário de Integração é o conjunto de temas que têm por princípio garantir a integração das disciplinas ou módulos que compõem a matriz curricular do curso, podendo acontecer na forma de atividades interdisciplinares, presencial ou a distância.§ 4º Atividade Orientada é a realizada pelo estudante, sob orientação de um ou mais professores.", "Art. 10. Núcleo Comum (NC) é o conjunto de conteúdos básicos para a formação profissional do estudante.§ 1º O NC será ministrado em componentes curriculares obrigatórios, cujo elenco será definido no PPC.", "§ 2º A carga horária total do NC deverá corresponder a, no máximo, 70% (setenta por cento) da carga horária total de componentes curriculares necessária à integralização curricular do curso.Art. 11. Núcleo Específico (NE) é o conjunto de conteúdos que darão especificidade à formação profissional do curso.", "§ 1º O NE será ministrado em componentes curriculares de natureza obrigatória ou optativa, cujo elenco será definido no PPC.§ 2º A carga horária total do NE deverá correspondera, no mínimo, 20% (vinte por cento) da carga horária total de componentes curriculares necessária à integralização curricular do curso.", "Art. 12. Núcleo Livre (NL) é o conjunto de conteúdos que têm por objetivo:I- ampliar e diversificar a formação do estudante;II- promover a interdisciplinaridade e a transdisciplinaridade;III- possibilitar o aprofundamento de estudo em áreas de interesse do estudante;IV- viabilizar o intercâmbio entre estudantes de diferentes cursos da UFG.", "4 § 1º O NL será ministrado em componentes curriculares criados com esse fim ou com vagas disponíveis, nos termos dos artigos 49, § 1º, e 68 deste RGCG, respectivamente.§ 1º O NL será ministrado em componentes curriculares criados para esse fim ou por meio de liberação de vagas em turmas de componentes obrigatórios ou optativos, nos termos dos artigos 49, § 1º, e 68 deste RGCG, respectivamente. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º Nos cursos presenciais, os componentes curriculares de NL poderão ser cursados apenas por estudantes matriculados em cursos da regional de funcionamento da respectiva unidade acadêmica ou unidade acadêmica especial, exceto nos períodos de verão ou de inverno.§ 2º Nos cursos presenciais, as turmas dos componentes curriculares de NL poderão permitir a matrícula dos estudantes, independente da regional a que esteja vinculado o seu curso. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "§ 3º Componentes curriculares criados como NL deverão ser aprovados pelo Conselho Diretor da unidade acadêmica ou Colegiado da unidade acadêmica especial responsável, com especificação de ementa, carga horária, bibliografia básica e bibliografia complementar.", "§ 4º Em cada curso presencial, a carga horária total do NL deverá ser de, no mínimo, 128 (cento e vinte e oito) horas.§ 5º Na modalidade EAD, a oferta de NL se dará nos casos previstos no PPC.Art. 13. Todos os componentes curriculares dos cursos presenciais terão carga horária total múltipla de 16 (dezesseis).", "§ 1º Esse parâmetro orientador na definição de carga horária é facultativo para os componentes curriculares de estágio e para cursos na modalidade EAD, cujo currículo esteja definido por meio de convênios e/ou programas específicos de turmas de EAD.§ 2º Componentes curriculares, de natureza optativa podem ser vinculados a temas variados, que são temáticas contextuais de áreas específicas, relevantes para a formação do estudante.", "§ 3º Componentes curriculares que são pré-requisitos de outros deverão ter sido cursados anteriormente pelo estudante, com aprovação.§ 4º Componentes curriculares que são co-requisitos de outros deverão ter sido cursados anteriormente pelo estudante, com aprovação, ou concomitantemente.", "§ 5º Componentes curriculares equivalentes são aqueles cursados pelo estudante e reconhecidos como substitutos de componentes curriculares obrigatórios e/ou optativos, a serem cumpridos para integralização curricular. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Art. 14. Atividades complementares (AC) são atividades acadêmicas, escolhidas e desenvolvidas pelo estudante durante o período em que esteja vinculado a seu curso, excetuando-se componentes curriculares.5 Art. 14. Atividades complementares (AC) são atividades acadêmicas, escolhidas e desenvolvidas pelo estudante durante o período em que esteja vinculado a um curso de educação superior, excetuando-se componentes curriculares. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 1º Atividades complementares compreendem a participação em monitorias, pesquisas, projetos de extensão e cultura, estágio curricular não obrigatório, conferências, seminários, palestras, congressos, debates e outras atividades científicas, artísticas e culturais.§ 1º Atividades complementares compreendem a participação em monitorias, tutorias, pesquisas, projetos de extensão e cultura, estágio curricular não obrigatório, conferências, seminários, palestras, congressos, debates e outras atividades científicas, artísticas, culturais, de saúde e qualidade de vida. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º A carga horária das atividades complementares totalizará um mínimo de 100 (cem) horas para efeito de integralização curricular, devendo ser superior nos casos previstos pelo CNE.§ 3º Caberá ao conselho diretor da unidade acadêmica ou ao colegiado da unidade acadêmica especial responsável pelo curso aprovar critérios para a validação da carga horária das atividades complementares, que será computada e registrada pela coordenação de curso.", "§ 4º A validação de atividade de estágio curricular não obrigatório poderá corresponder, no máximo, a 50% (cinquenta por cento) da carga horária prevista para atividades complementares, nos termos definidos no PPC do curso.§ 4º A validação de atividade de estágio curricular não obrigatório poderá corresponder, no máximo, a 60% (sessenta por cento) da carga horária prevista para atividades complementares, nos termos definidos no PPC. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "§ 5º Quando houver, a atividade de tutoria deverá ser, no mínimo, 10% da carga horária prevista para atividades complementares. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) Art. 15. A carga horária do curso será definida em seu projeto pedagógico, em conformidade com o que dispõem os artigos 8º a 14 deste RGCG, e poderá exceder em até no máximo 15% (quinze por cento) a carga horária mínima prevista em resoluções do CNE para cursos de graduação.", "§ 1º Para fins do cômputo da carga horária do curso, que trata o caput deste artigo, não serão consideradas as horas de Atividades Complementares.§ 2º A carga horária do curso prevista no PPC deverá ser mensurada em horas (60 minutos).", "Art. 16. A hora-aula em cursos presenciais será de 60 (sessenta) minutos, sendo 50 (cinquenta) minutos de aulas teóricas e práticas e 10 (dez) minutos de atividades acadêmicas supervisionadas, conforme legislação em vigor.Art. 16. A hora-aula em cursos presenciais será de 60 (sessenta) minutos, sendo 50 (cinquenta) minutos de aulas teóricas e práticas, realizadas no modo remoto, e 10", "6 (dez) minutos de atividades acadêmicas supervisionadas, conforme legislação em vigor.(Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020) § 1º No caso de cursos noturnos, a regional poderá estabelecer como parâmetro de hora-aula 45 (quarenta e cinco) minutos de aulas teóricas e práticas e 15 (quinze) minutos de atividades acadêmicas supervisionadas, conforme legislação em vigor.", "§ 2º No caso de componentes curriculares de estágio e atividades complementares as horas devem ser consideradas de 60 minutos.Seção III Do Estágio Curricular", "Art. 17. Estágio curricular obrigatório e estágio curricular não obrigatório são componentes da formação acadêmica, de caráter teórico-prático, que têm como objetivo principal proporcionar aos estudantes a aproximação com a realidade profissional, com vistas ao desenvolvimento de sua formação técnica, cultural, científica e pedagógica, com vistas ao exercício da profissão e da cidadania.", "§ 1º O estágio curricular obrigatório deve estar previsto no PPC, especificada sua carga horária, de acordo com a legislação vigente.§ 2º O estágio curricular obrigatório será planejado, orientado, acompanhado e avaliado pelos professores da UFG, em conformidade com o PPC, regulamento de estágio de cada curso e plano de ensino, devendo contar com apoio do supervisor ou preceptor do local em que está sendo realizado.", "§ 3º As competências profissionais adquiridas por meio de vínculo formal de trabalho nas áreas de formação do estudante, realizado concomitantemente com o curso, poderão ser equiparadas, parcial ou totalmente, ao estágio curricular obrigatório, quando previsto no PPC e após análise da coordenação de estágio do curso.§ 3º As competências profissionais adquiridas por meio de vínculo formal de trabalho nas áreas de formação do estudante, realizado concomitantemente com o curso, poderão ser equiparadas, parcial ou totalmente, ao estágio curricular obrigatório, quando previsto no Regulamento de Estágio de Curso e mediante análise da coordenação de estágio do referido curso. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 4º Estágio curricular não obrigatório é uma atividade opcional e quando realizado pelo estudante tem o intuito de ampliar sua formação por meio de vivência de experiências próprias da situação profissional, podendo envolver atividades interdisciplinares integrantes do processo formativo proposto pelo curso, previsto no PPC e com os devidos registros no histórico acadêmico.", "Art. 18. Para a realização do estágio curricular obrigatório ou não obrigatório, será necessária a celebração de termo de convênio entre a UFG e o campo de estágio, quando este for externo à UFG, termo de compromisso firmado pelo educando, pela parte concedente e pela UFG, bem como a análise da compatibilidade entre as atividades desenvolvidas no estágio e aquelas previstas no termo de compromisso.", "7 § 1º As condições previstas no caput deste art. não se aplicam ao disposto no § 3º do art. 17 deste RGCG.§ 2º O estágio pode ser intermediado por agentes de integração devidamente conveniados com a UFG, mediante condições e critérios estabelecidos no regulamento de estágio do curso, os quais devem estar em consonância com a política de estágio da UFG.", "§ 3º As atividades de estágio curricular obrigatório serão validadas quando o estudante estiver regularmente matriculado no componente curricular de estágio e com frequência efetiva no curso ao qual está vinculado, salvo em casos de convênios estabelecidos com outras IES ou por meio de programas de intercâmbio ou de mobilidade reconhecidos pela UFG.", "§ 4º Só poderá participar do estágio curricular não obrigatório o estudante que estiver regularmente matriculado e com frequência efetiva no curso ao qual está vinculado.Art. 19. A realização de estágio curricular obrigatório dentro das dependências da unidade acadêmica ou unidade acadêmica especial, que abriga o curso, nas situações em que o professor orientador é também o supervisor, dispensará a celebração do termo de compromisso e plano de atividades de estágio, mediante a matrícula no componente curricular de estágio.", "§ 1º Todos os termos da legislação de estágio são garantidos mediante a matrícula de turma no componente curricular de estágio, bem como inclusão na apólice de seguros.§2º A dispensa descrita no caput deste artigo não desobriga a elaboração, apresentação e entrega do relatório de estágio.", "§ 3º A ementa do componente curricular e o plano de ensino da turma cumprem o papel de plano de atividades do estagiário.Art. 20. O estágio curricular, obrigatório ou não obrigatório, não cria vínculo empregatício entre as partes envolvidas.", "§ 1º Os estágios poderão ser realizados:I- nas unidades acadêmicas, unidades acadêmicas especiais e nos órgãos da UFG;II- com pessoas jurídicas de direito privado e nos órgãos da administração pública direta, autárquica e fundacional de qualquer um dos Poderes da União, Estados, Distrito Federal e dos Municípios;III- com profissionais liberais de nível superior, devidamente registrados em seus respectivos conselhos de fiscalização profissional;IV- produtores rurais devidamente cadastrados em órgão competente.", "§ 2º Nos estágios curriculares obrigatórios, o estagiário:I- poderá receber o pagamento de bolsa da instituição na qual realiza o estágio;II- terá direito à cobertura de seguro de acidentes pessoais paga pela UFG.", "8 § 3º Nos estágios curriculares não obrigatórios, é compulsório que o estagiário receba o pagamento de bolsa estágio ou outra forma de contraprestação que venha a ser acordada no termo de compromisso, bem como auxílio transporte e seguro pagos pela instituição na qual realiza o estágio.", "Art. 21. O estágio curricular obrigatório será desenvolvido em forma de componentes curriculares, mediante atividades em campo específico de atuação do profissional, de acordo com o proposto no PPC.§ 1º A carga horária e a forma do núcleo (NC ou NE) do componente curricular de estágio serão definidos no PPC, respeitando-se o limite máximo de 6 (seis) horas diárias e 30 (trinta) horas semanais.", "§ 2º Para os cursos que preveem estágios sem a concomitância de componentes curriculares no mesmo período letivo, a carga horária poderá ser de até 40 (quarenta) horas semanais, no limite de 8 horas/dia.Art. 22. A periodicidade do componente curricular de estágio curricular obrigatório será definida em cada PPC.", "Art. 23. A Prograd será responsável pela coordenação geral dos estágios dos cursos.§ 1º O coordenador geral de estágios da UFG, lotado na Prograd, terá as seguintes atribuições:", "I. coordenar e avaliar a política de estágios da UFG;II. supervisionar o cumprimento das normas estabelecidas pelas instâncias competentes;III. apoiar os coordenadores de estágios dos cursos em assuntos referentes à realização de estágios e garantia de sua qualidade;IV. promover a troca de experiências e incentivar atividades integradas;V. divulgar experiências de estágio na comunidade universitária e para o público em geral;VI. analisar propostas de convênio e de termos aditivos;VII. manter arquivos atualizados sobre legislação, convênios e outros documentos relativos a estágios na UFG;VIII. coordenar, em conjunto com a Pró-reitoria de Administração e Finanças (PROAD) e o Departamento de Pessoal, o processo de seleção, por meio de edital, de candidatos a estágio não obrigatório na UFG;IX. fazer a gestão dos estágios curriculares não obrigatórios compartilhada com os cursos, podendo assumir a responsabilidade pela assinatura do termo de compromisso, quando houver setor criado e estabelecido para esse fim no âmbito da Prograd.", "§ 2º Cada regional da UFG deverá nomear um coordenador geral de estágios, tendo as atribuições descritas no parágrafo primeiro desse artigo, no âmbito de atuação local.§ 3º Na Regional Goiânia, o coordenador geral de estágios será o coordenador geral de estágio da UFG.", "9 Art. 24. Caberá ao conselho diretor da unidade ou ao colegiado da unidade acadêmica especial a designação de um coordenador de estágio por curso.Art. 24. Caberá ao conselho diretor da unidade ou ao colegiado da unidade acadêmica especial a designação de um coordenador e de um vice-coordenador de estágio por curso. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Parágrafo único. A critério do Conselho Diretor, poderá ser designado um vice-coordenador de estágio para cada curso, que auxiliará o coordenador de estágio em suas atribuições e o substituirá em seus impedimentos.Parágrafo único. O vice-coordenador de estágio auxiliará o coordenador de estágio em suas atribuições e o substituirá em suas faltas e impedimentos. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Art. 25. O coordenador de estágio de cada curso terá as seguintes atribuições:I- articular a elaboração de regulamento que atenda à especificidade de cada curso para o desenvolvimento do estágio, a ser aprovado pelo conselho diretor da unidade acadêmica ou colegiado da unidade acadêmica especial, respeitando-se o Estatuto e Regimento da UFG, resolução específica e a legislação vigente;II- coordenar e acompanhar os estágios curriculares;III- buscar, avaliar e definir os locais de estágio e solicitar a assinatura de convênios;IV- apoiar o planejamento, o acompanhamento e a avaliação das atividades de estágio;V- promover o debate e a troca de experiências no próprio curso e nos locais de estágio;VI- manter documentos atualizados e arquivados relativos aos estágios no respectivo curso, por período não inferior a cinco anos;VII- manter atualizada a lista de estagiários com respectivos campos de estágio;VIII- indicar o professor orientador para o estagiário;IX- assinar e carimbar o termo de compromisso do estudante, atribuição que, na sua ausência, ficará a cargo do vice-coordenador de estágio do curso, quando houver, ou do coordenador de curso.", "Parágrafo único. Na ausência do vice-coordenador de estágio, o termo de compromisso poderá ser assinado pelo coordenador de curso e/ou pelo diretor da unidade acadêmica ou chefe da unidade acadêmica especial do curso do estudante. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Art. 26. O professor orientador de estágio terá as seguintes atribuições:I- auxiliar o estudante na escolha dos locais de estágio, em conjunto com o coordenador de estágio;II- planejar, acompanhar, orientar e avaliar as atividades de estágio, juntamente com o estagiário e o supervisor, preceptor ou profissional colaborador do local do estágio;III- assinar o plano de atividades de estágios e relatórios.", "10 Art. 27. O estagiário terá as seguintes atribuições:I- participar do planejamento do estágio e do processo de avaliação de seu desempenho;II- seguir o regulamento estabelecido para o estágio;III- entregar, na coordenação de estágio do curso, uma via do termo de compromisso de estágio com todas as assinaturas exigidas e respectivos carimbos;IV- atender ao estabelecido no termo de compromisso, celebrado por ocasião do início do estágio;V- elaborar e entregar relatório sobre seu estágio, na forma, no prazo e nos padrões estabelecidos no regulamento de estágio.", "Art. 28. O estágio, obrigatório ou não obrigatório, será interrompido:I- automaticamente, ao término do compromisso;II- por abandono, pelo estagiário, do local de estágio, conforme disposto no termo de compromisso;III- quando o estudante estiver em situação de formando e cumprida carga horária dos núcleos comum, específico e livre previstos no seu curso;III- quando o estudante cumpriu a carga horária dos núcleos comum, específico e livre previstos no seu curso, mas necessita comprovar a carga horária de Atividades Complementares e/ou de componentes curriculares obrigatórios previstos em normas específicas; (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019) IV- quando o estudante integralizar o seu currículo e estiver a 15 dias da data de colação de grau oficial do seu curso; (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) V- quando o estudante for excluído do quadro discente da UFG;VI- a pedido do estagiário, mediante justificativa que será analisada pelo coordenador de estágio do curso e pelo professor orientador de estágio;VII- quando o estagiário tiver comportamento funcional ou social incompatível com as normas éticas e administrativas do local de estágio;VIII- quando o estagiário deixar de cumprir o disposto no Termo de Compromisso;IX- quando as instituições conveniadas deixarem de cumprir o disposto no Termo de Compromisso.", "Art. 29. O estudante poderá solicitar mudança de local de estágio, mediante justificativa que será analisada pelo professor orientador de estágio e pelo coordenador de estágio do curso.Art. 30. O estágio curricular não obrigatório não poderá ser aproveitado como estágio curricular obrigatório.", "Capítulo II Do Ingresso e do Vínculo do Estudante Regular e Do Estudante Especial Seção I 11 Do Ingresso", "Art. 31. O ingresso nos cursos de graduação da UFG dar-se-á, nos termos do Regimento da UFG, a:I- candidatos admitidos por meio de processos de seleção definidos pela Universidade e que tenham concluído o ensino médio ou equivalente;II- portadores de diploma de curso superior;III- estudantes de outras instituições, por meio de transferências obrigatórias ou facultativas;IV- estudantes estrangeiros participantes de acordos ou de convênios entre Brasil e outros países;V- estudantes de outras instituições, nas condições estabelecidas em convênios com a UFG;VI- estudantes com matriculas autorizada nas condições de reciprocidade diplomática, previstas em lei.", "Art. 32. Forma de ingresso é a possibilidade que a UFG apresenta aos candidatos que querem ter acesso aos cursos superiores, em uma das seguintes opções:I- processos seletivos;II- sistemas unificados de seleção;III- transferência exofficio;IV- convênios ou acordos culturais;V- reciprocidade diplomática.", "Parágrafo único. Os critérios de ingresso nos cursos de graduação da UFG serão definidos em legislação específica e/ou em editais.Seção II Do Vínculo do Estudante Regular", "Art. 33. Considera-se estudante vinculado aquele que se encontre, a cada semestre letivo, em uma das seguintes situações:I- matriculado, no mínimo, em um componente curricular;II- com matrícula trancada;III- participando de programa de intercâmbio ou de mobilidade estudantil.", "Art. 34. A matrícula será efetuada pelo estudante em cada semestre letivo, online, conforme calendário acadêmico.Parágrafo único. A matrícula do estudante ingressante será realizada pela coordenação de curso, conforme calendário acadêmico.", "Art. 35. Será permitido ao estudante frequentar as aulas de um componente curricular para o qual tenha solicitado acréscimo ou liberação de pré-requisito e/ou co- requisito, enquanto a solicitação estiver sob análise.12 Art. 35. Será permitido ao estudante frequentar as aulas de um componente curricular para o qual tenha solicitado acréscimo. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 1º No caso de solicitação de acréscimo a permissão está condicionada à apresentação de comprovação da solicitação ao docente do referido componente curricular.§ 1º No caso de solicitação de acréscimo, a permissão está condicionada à apresentação de comprovação da solicitação ao docente do referido componente curricular e valerá enquanto estiver sob análise. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º No caso de solicitação de liberação de pré-requisito e/ou co-requisito a permissão está condicionada à autorização do coordenador do curso com base na quantidade de vagas e na especificidade do componente curricular.§ 2º revogado. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 3º As solicitações de acréscimo de componentes curriculares deverão ser analisadas no prazo estabelecido no calendário acadêmico, salvo solicitações extemporâneas.§ 4º Enquanto as solicitações estiverem sob análise, o professor não poderá informar ao estudante notas de provas, trabalhos ou outras avaliações, nem fornecer declaração ou atestado de frequência.", "§ 5º As notas de provas, trabalhos ou outras avaliações e frequência obtidas pelo estudante em situação de solicitação de acréscimo de componente curricular ou liberação de pré-requisito ou co-requisito só terão validade em caso de deferimento do pedido, no semestre em curso.§ 5º As notas de provas, trabalhos ou outras avaliações e frequência obtidas pelo estudante em situação de solicitação de acréscimo de componente curricular só terão validade em caso de deferimento do pedido, no semestre em curso. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 6º Em caso de indeferimento, a frequência às aulas não garante a matrícula.Art. 36. Ao estudante em situação de exclusão que tenha protocolado recurso contra exclusão, será permitido frequentar aulas, sem garantia de vínculo, enquanto durar a apreciação do recurso e desde que apresente ao coordenador do curso o respectivo protocolo, observado o disposto nos incisos do art. 52 deste RGCG.", "§ 1º Mediante apresentação do protocolo do recurso contra exclusão, o coordenador do curso emitirá autorização para o estudante frequentar aulas e realizar as avaliações dos componentes curriculares dos quais foi autorizado a frequentar aulas.§ 1º Mediante apresentação do protocolo do recurso contra exclusão, o coordenador do curso emitirá autorização para o estudante frequentar aulas e realizar as avaliações dos componentes curriculares dos quais foi autorizado a frequentar aulas, observado o disposto nos parágrafos 3º e 4º do artigo 13. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º A autorização, devidamente assinada pelo coordenador de curso, terá validade até a data de apreciação final do recurso.13 § 3º Enquanto durar a apreciação do recurso, o docente não poderá informar ao estudante notas de provas, trabalhos ou outras avaliações, nem fornecer declaração ou atestado de frequência até a regularização do vínculo do estudante.", "§ 4º Em caso de deferimento do recurso, as notas de provas, trabalhos ou outras avaliações e frequência obtidas pelo estudante deverão ser registradas pelo docente no diário de turma.§ 5º Havendo indeferimento do recurso, os componentes curriculares cursados com aprovação, pelo estudante durante a apreciação do recurso, poderão ser convertidos em componentes curriculares isolados.", "Art. 37. Não será permitido o vínculo simultâneo em mais de um curso de graduação na UFG.Parágrafo único. O estudante deverá ficar vinculado apenas a uma matriz curricular.", "Art. 38. Nos cursos de graduação da UFG, não existe a condição de estudante ouvinte.Seção III Do Estudante Especial", "Art. 39. Considera-se estudante especial aquele que não possui vínculo em cursos de graduação da UFG e está matriculado em componentes curriculares da graduação.§ 1º O componente curricular cursado por estudante especial será denominado componente curricular isolado.", "§ 2º O estudante especial deverá ter concluído, no mínimo, o ensino médio.§ 3º A inscrição do estudante especial em componente curricular isolado não o vincula a nenhum curso da UFG.§ 4º Ao estudante especial se aplicam, no que couberem, as normas referentes à verificação de aprendizagem e disciplinares aplicadas ao estudante regular.", "Art. 40. A aprovação em componente curricular isolado não assegura direito a diploma de graduação, mas, unicamente, a certificado comprobatório, expedido pelo Centro de Gestão Acadêmica (CGA).Art. 41. O estudante regular que tenha, antes de seu ingresso na UFG, cursado componentes curriculares isolados com aprovação poderá solicitar aproveitamento destes no curso de vínculo.", "Art. 42. As condições para ingresso e permanência do estudante especial serão definidas em resolução específica.14 Capítulo III Da Oferta de Turma, Da Matrícula, Do Cancelamento e do Acréscimo, Da Liberação de Pré e/ou Co-Requisito e Do Trancamento de Matrícula", "Seção I Da Oferta de Turma Art. 43. A unidade acadêmica ou unidade acadêmica especial, por meio das coordenações de curso, deverá ofertar, a cada semestre letivo, turmas de componentes curriculares, conforme fluxo curricular do PPC e os prazos previstos no calendário acadêmico, observando o disposto no art. 107 deste RGCG.", "§ 1º Na oferta de turma, deverão ser registrados:I. o curso responsável pela oferta;II. o ano e semestre;III. o câmpus e o local;IV. o número de vagas, incluídas as previstas para NL, se for o caso;V. início e término da turma;VI. as matrizes para as quais as vagas se destinam, com reserva de vagas, se for o caso;VII. os dias da semana e horário;VIII. o docente vinculado.", "§ 2º Quando o componente curricular for de responsabilidade da unidade acadêmica ou unidade acadêmica especial à que o curso se vincula, a oferta da turma será realizada pela coordenação do curso.§ 3º Quando o componente curricular estiver vinculado a dois ou mais cursos de uma unidade acadêmica ou unidade acadêmica especial, a oferta da turma poderá ser realizada pela coordenação de um dos cursos, mediante acordo entre eles.", "§ 4º Quando o componente curricular for de responsabilidade de unidade acadêmica ou unidade acadêmica especial diferente daquela à que o curso se vincula, a coordenação do curso deverá solicitar oferta para a unidade acadêmica ou unidade acadêmica especial responsável pelo componente curricular, indicando, no mínimo, o número de vagas, as matrizes curriculares, o local, o horário e os dias da semana.", "§ 5º Caberá à unidade acadêmica ou unidade acadêmica especial responsável pelo componente curricular analisar e validar a solicitação de oferta de turma, com vinculação do(s) docente(s) com suas respectivas cargas horárias, conforme previsto no § 4º.§ 6º Os componentes curriculares do NC e do NE, de natureza obrigatória, deverão ser oferecidos em pelo menos um dos semestres de cada ano letivo, observada a sugestão de fluxo do PPC.", "§ 7º A oferta dos componentes curriculares do NC e do NE, de natureza obrigatória, cuja carga horária seja 100% prática e que exija locais fora da sede do curso para serem ministrados, poderá ocorrer em período de verão ou de inverno, desobrigando o cumprimento do § 6º. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "15 § 8º Os componentes curriculares do NC e do NE, de natureza obrigatória com número de discentes aptos a cursá-los, além da previsão de vagas regulares do curso, deverão ser oferecidos semestralmente, salvo se, comprovadamente, não houver disponibilidade de docente para turmas além do fluxo curricular do PPC, bem como o disposto no art. 63.", "§ 9º A oferta de componentes curriculares do NE, de natureza optativa, deverá respeitar a sugestão de fluxo curricular do PPC.§ 10. No caso de cursos oferecidos por meio de convênios ou na modalidade a distância, a frequência da oferta de turmas poderá diferir do descrito nos §§ 6º a 8º deste artigo.", "§ 11. No caso de turmas com previsão de início e/ou término diferente da estabelecida no calendário acadêmico, as coordenações de curso deverão registrar as respectivas datas de início e término.Art. 44. Quando houver mais de um docente vinculado a uma mesma turma, a carga horária (teórica e/ou prática) do componente curricular deverá ser distribuída entre os respectivos docentes, de forma que a somadas cargas horárias atribuídas seja menor ou igual à carga horária total do componente curricular, exceto nos casos previstos no PPC.Art. 44. Quando houver mais de um docente vinculado a uma mesma turma, a soma das cargas horárias a eles atribuídas poderá ultrapassar a carga horária total do componente curricular, ainda que não previsto no PPC, desde que aprovado no Conselho Diretor da Unidade Acadêmica ou no Colegiado da Unidade Acadêmica Especial. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Parágrafo único. A exceção mencionada no caput deste artigo dar-se-á pela identificação no PPC dos componentes curriculares cujas somas das cargas horárias atribuídas a cada um dos docentes vinculados às turmas poderão ultrapassar a carga horária total do componente curricular.", "Art. 45. A unidade acadêmica ou unidade acadêmica especial responsável pelo curso divulgará os componentes curriculares que serão oferecidos no semestre letivo seguinte.Art. 46. As unidades acadêmicas ou unidades acadêmicas especiais, por meio das coordenações de curso, poderão ofertar componentes curriculares nos períodos de verão ou de inverno, conforme calendário acadêmico, desde que a oferta seja aprovada nos respectivos conselhos diretores ou colegiados.", "§ 1º No período de verão ou de inverno, só poderão ser oferecidos componentes curriculares cuja carga horária não ultrapasse 20 (vinte) horas semanais, exceto quando se tratar de estágio curricular obrigatório.§ 1º No período de verão ou de inverno, só poderão ser oferecidos componentes curriculares cuja carga horária não ultrapasse 25 (vinte e cinco) horas semanais, exceto quando se tratar de estágio curricular obrigatório. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º A oferta de turmas no período de verão ou de inverno obedecerá ao disposto nos §§ 1º ao 5º do art. 43 deste RGCG.16 § 3º No caso de turmas com previsão de início e/ou término das aulas diferente da estabelecida para os períodos de inverno e verão, definidos no calendário acadêmico, as coordenações de curso deverão registrar as respectivas datas de início e término.", "Art. 47. A oferta de componentes curriculares em período de verão ou inverno não desobriga a unidade acadêmica ou unidade acadêmica especial da oferta regular nos semestres letivos.Art. 48. Caberá ao coordenador do curso decidir sobre o aumento do número de vagas nas turmas ofertadas, bem como sobre a oferta de novas turmas, se necessário.", "Parágrafo único. Se a turma ofertada for de componente curricular de uma unidade acadêmica ou unidade acadêmica especial diferente daquela do coordenador de curso, o aumento do número de vagas da turma só será permitido com anuência da unidade responsável pelo componente curricular.", "Art. 49.Cada curso deverá ofertar um número de vagas igual ou maior à sua demanda em componentes curriculares de NL, calculado da seguinte forma:em que:NA = número de estudantes matriculados no curso.DiNL = número de componentes curriculares de NL que alcance a carga horária mínima de NL do curso, considerando 64h (sessenta e quatro horas) cada componente curricular.DMC = duração média do curso, em semestres, conforme PPC.", "§ 1º Os componentes curriculares ofertados como NL para atender à demanda prevista no caput desse artigo não poderão ter pré-requisitos ou co-requisitos.§ 1º Os componentes curriculares ofertados exclusivamente como NL para atender à demanda prevista no caput desse artigo não poderão ter pré-requisitos ou co- requisitos. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º Poderão ter pré-requisito ou co-requisito os componentes curriculares de NL cujas vagas ofertadas ultrapassem a demanda prevista no caput desse artigo.Art. 50. Uma oferta de turma poderá ter vinculação de docentes de diferentes unidades acadêmicas ou acadêmicas especiais, desde que a unidade ofertante tenha anuência das unidades de vínculo dos docentes.", "Seção II Da Solicitação de Matrícula e da Matrícula em Componentes Curriculares e Da Solicitação de Liberação de Pré-requisito e/ou Co-requisito Art. 51. A solicitação de matrícula é uma etapa obrigatória para os estudantes veteranos, cujo período de realização é definido no calendário acadêmico.", "Parágrafo único. O estudante da UFG participante de programas de mobilidade deverá confirmar essa situação durante o período de matrícula.17 Art. 52. Durante o período de solicitação de matrícula, o estudante selecionará componentes curriculares de seu interesse, observando:", "I- os pré-requisitos e co-requisitos do componente curricular;II- a ausência de sobreposição de horários das aulas;III- a carga horária mínima e a máxima a ser cursada por semestre, quando estabelecidas nos PPC’s;IV- não ter cursado o componente curricular com aprovação, exceto tratando-se de componente com tema variado. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 1º Durante o período de solicitação de matrícula, o estudante poderá alterar as suas solicitações, dentro das possibilidades ofertadas, sem qualquer prejuízo acadêmico.§ 2º No caso de solicitação de matrícula em componentes curriculares de temas variados, o estudante poderá selecionar mais de uma vez o mesmo componente curricular, desde que os temas variados sejam diferentes.", "Art. 53. As solicitações de matrícula serão efetivadas em ordem decrescente do Índice de Prioridade (IP) obtida pelo estudante e dos critérios de desempate, até o limite de vagas ofertadas na turma.Parágrafo único. O caput deste art. não se aplica ao estudante ingressante ou aquele que irá iniciar o segundo semestre na UFG e obteve trancamento de matrícula no semestre de ingresso.", "Art. 54. O Índice de Prioridade (IP) está representado pela taxa de aprovação (TA), taxa de integralização de componentes curriculares (TI) e quantidade de reprovações por faltas (QR), conforme o seguinte cálculo:IP = 100*TA + 10*TI – 3*QR em que:TA = (CHA/CHC);TI = (CHI/CHT).Se TI > 1, será considerado TI = 1;QR =número de reprovações por faltas nos mesmos períodos utilizados para cálculo da TA Onde:CHA =carga horária total de componentes curriculares nos quais o estudante foi aprovado nos dois últimos períodos cursados, excetuando-se os períodos de verão ou de inverno, trancamentos e afastamentos por intercâmbios;CHC =carga horária total de componentes curriculares cursados pelo estudante nos dois últimos períodos utilizados para cálculo da CHA;CHI =carga horária integralizada em componentes curriculares do NC e NE, considerando NE ≤ 100%;CHT =carga horária total do curso em componentes curriculares do NC e NE.", "§ 1º Para estudantes com apenas um período cursado, TA, QR, CHA e CHC serão calculados considerando-se apenas o período cursado.§ 2º No caso de apenas um período cursado, se CHC for menor que 256h (duzentas e cinquenta e seis horas) então CHC será igual a 256h (duzentas e cinquenta e seis horas).", "18 § 3º No caso dos dois últimos períodos cursados, se CHC for menor que 512h (quinhentas e doze horas), então CHC será igual a 512 (quinhentas e doze horas).§ 4º O valores máximos de TA e IP serão, respectivamente, 1 (um) e 110 (cento e dez).", "§ 5º Os valores de TI, TA e IP serão calculados com a precisão de 2 (duas) casas decimais, sem arredondamentos.§6º No caso de reingresso, os estudantes serão tratados como ingressantes para efeito de aplicação da fórmula para cálculo do índice de prioridade.", "Art. 55. Para efeito de desempate na prioridade da matrícula em componentes curriculares, serão considerados os seguintes critérios:I- estudante com maior TA;II- estudante com maior TI;III- estudante com menor QR;IV- estudante com maior média relativa;V- estudante com maior média global;VI- estudante com maior porcentual médio de frequência nos semestres utilizados no cálculo da TA.", "Art. 56. A média global do estudante (MGE) será obtida pela seguinte fórmula:N  CHD * ND i i MGE = i =1 N", " CHD i =1 i em que:N = número de componentes curriculares cursados, dispensados e aproveitados com nota computáveis para a integralização da matriz curricular do estudante, durante o seu vínculo no curso.CHDi = carga horária do componente curricular “i”;NDi = nota final do estudante no componente curricular “i”, independente da situação final (aprovado, reprovado, dispensado e aproveitado com nota).", "§ 1º A MGE é a somatória dos produtos das notas finais de cada componente curricular e sua carga horária, dividida pela somatória de carga horária desses componentes curriculares.§ 2º Para fins de cálculo da MGE, conforme caput do art. 56 e § 1º, considera-se componentes curriculares todos aqueles cursados pelo estudante, bem como aqueles em que obteve dispensa e aproveitamento com nota, durante o seu vínculo no curso.", "§ 3º O valor de MGE será calculado com a precisão de uma casa decimal com o seguinte critério para arredondamento:19 I- se a segunda casa decimal for menor que cinco (< 5), a primeira casa decimal permanece inalterada;II- se a segunda casa decimal for maior ou igual a cinco (≥ 5), a primeira casa decimal é acrescida de uma unidade.", "Art. 57. A média global do curso (MGC) será obtida pelo seguinte cálculo:em que:MGEi = média global do estudante i;NEC = número de estudantes na matriz curricular.", "Art. 58. A média relativa do estudante será obtida pelo seguinte cálculo:em que:MGE = média global do estudante;MGC = média global do curso.", "Art. 59. O número de vagas oferecidas, o Índice de Prioridade (IP) e a classificação do discente serão de livre acesso a todos os estudantes que solicitaram matrícula na turma ofertada.Art. 60. Não terá sua matrícula ou trancamento efetivado o estudante que estiver com pendência com:", "I- o Sistema de Bibliotecas (SiBi) da UFG;II- a Pró-Reitoria de Assuntos da Comunidade Universitária (PROCOM).II- a Pró-Reitoria de Assuntos Estudantis (PRAE). (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Art. 61. O estudante, no semestre de ingresso, será matriculado, pela coordenação de curso, nos componentes curriculares do primeiro período do curso, conforme sugestão de fluxo constante do PPC.Art. 62. Nos períodos de verão ou de inverno, a matrícula ocorrerá nos temos dos artigos 51 ao 55 deste Regulamento.", "Parágrafo único. Havendo vaga, estudantes que tenham cursado apenas um semestre na UFG ou trancado matrícula desde o seu ingresso poderão se matricular em turma oferecidas no período de verão ou de inverno, no respectivo período de acréscimo, conforme calendário acadêmico.", "Art. 63. É facultado às unidades acadêmicas e unidades acadêmicas especiais a manutenção da oferta de turma que não tenha alcançado o número mínimo de 5 (cinco) estudantes matriculados.20 Art. 63. Excepcionalmente, as Unidades Acadêmicas e Unidades Acadêmicas Especiais deverão manter as turmas já ofertadas que não tenha alcançado o número mínimo de 5 (cinco) estudantes matriculados. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Art. 64. Em período definido no calendário acadêmico, o estudante poderá solicitar a liberação de pré-requisito e/ou co-requisito de componentes curriculares da matriz curricular a qual o estudante está vinculado.Art. 64. O estudante terá direito à liberação de pré-requisito e/ou co- requisito de componentes curriculares da matriz curricular a qual está vinculado, mediante à existência de vaga na turma do componente, objeto da liberação, e desde que atenda a pelo menos uma das seguintes condições: (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "I- ter cursado e ter sido reprovado com nota final igual ou maior a 5,0 (cinco) no(s) pré-requisito(s) e/ou no co-requisito(s) e/ou no componente equivalente, desde que a equivalência esteja prevista no PPC; (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) II- ter integralizado, no mínimo, 85% (oitenta e cinco por cento) do currículo. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 1º Cabe ao conselho diretor da unidade acadêmica ou colegiado da unidade acadêmica especial a análise das solicitações, consultado o Núcleo Docente Estruturante (NDE) do curso do estudante.§ 1º A UFG deixará de conhecer as solicitações de liberação de pré e/ou co- requisito que não se enquadrem numa das condições estabelecidas no caput e nos incisos deste artigo. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º Nos casos em que disciplinas ou módulos do curso forem de responsabilidade de outra unidade acadêmica ou unidade acadêmica especial, será consultado, também, o Vice-Diretor ou Vice-Chefe, respectivamente.§ 2º Caberá ao coordenador do curso do estudante se manifestar sobre a existência de vaga conforme condição prevista neste artigo. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 3º O conselho diretor da Unidade Acadêmica ou colegiado da Unidade Acadêmica Especial deverá apreciar as solicitações em prazo definido no calendário acadêmico.§ 3º Havendo demanda de pedidos superior ao número de vagas disponíveis, será matriculado o estudante que tenha, na ordem que se segue: (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "I- maior Índice de Prioridade; (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) II- maior porcentual de carga horária integralizada; (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) III- maior média relativa. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "21 § 4º O período para solicitação para liberação de pré-requisito e/ou co- requisito deverá constar do Calendário Acadêmico. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Art. 64-A O Conselho Diretor da Unidade Acadêmica ou Colegiado da Unidade Acadêmica Especial, ouvidos os respectivos NDE´s dos cursos, deverão avaliar a possibilidade de liberação de pré-requisitos e/ou co-requisitos ou conversão de pré-requisito em co-requisito dos componentes nas matrizes curriculares, para aplicação em caráter temporário. (Incluído pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Seção III Do Cancelamento e do Acréscimo em Componentes Curriculares Art. 65. O estudante poderá, em data prevista no calendário acadêmico, cancelar componentes curriculares.", "§ 1º A carga horária mínima de componentes curriculares a ser cursada por semestre, quando estabelecida nos PPCs, deverá ser respeitada.§ 2º Serão canceladas automaticamente inscrições em componentes curriculares cujos co-requisitos tenham tido inscrições canceladas.", "Art. 66. O discente poderá solicitar cancelamento de componente curricular após datas previstas em calendário acadêmico, desde que considerado caso excepcional devidamente comprovado.Art. 66. O discente poderá solicitar cancelamento de componente curricular após datas previstas em calendário acadêmico até o término das aulas, desde que considerado caso excepcional devidamente comprovado. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019) Art. 66. O discente poderá solicitar cancelamento de componente curricular após datas previstas em calendário acadêmico até o término das aulas, mediante justificativa.(Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "§ 1º As solicitações de cancelamento de componentes curriculares serão analisados pelo coordenador de curso, no caso de componentes da matriz do discente, ou pelo coordenador do curso responsável pela oferta, no caso de Núcleo Livre.§ 2º São considerados casos excepcionais para cancelamento de componentes curriculares:", "I- doença do estudante ou de pessoa de seu núcleo familiar que exija envolvimento direto do interessado, impossibilitando-o de frequentar o componente curricular objeto de cancelamento;II- ingresso ou mudança de horário em emprego/cargo superveniente à inscrição no componente curricular, quando incompatível com horário de aulas do componente curricular;III- ingresso em estágio curricular obrigatório superveniente à inscrição no componente curricular, cujo horário de atividades seja incompatível com o horário de aulas do componente curricular;", "22 IV- obtenção de bolsa institucional oferecida pela UFG superveniente à inscrição no componente curricular, cujo horário de atividades seja incompatível com o horário de aulas do componente curricular;V- alteração de horário do componente curricular pelo coordenador de curso que impossibilite o estudante de continuar a frequentá-lo;VI- por erro ou omissão ou fato interno à UFG que, de alguma forma, tenha prejudicado o estudante no componente curricular.VII- outro motivo, devidamente justificado, que será analisado pelo coordenador de curso.", "Art. 67. O estudante poderá, em data prevista no calendário acadêmico, solicitar acréscimo de componente curricular ao Coordenador de curso ou ao Coordenador do Curso responsável pela oferta do componente.§ 1º O acréscimo de componente curricular estará condicionado à observância dos seguintes critérios:", "I- vaga disponível;II- aprovação nos pré-requisitos do componente curricular, se houver;III- inscrição nos co-requisitos do componente curricular, se houver;IV- ausência de sobreposição de horário das aulas;V- carga horária máxima a ser cursada por semestre, quando estabelecida no projeto pedagógico do curso.", "§ 2º Havendo demanda de pedidos superior ao número de vagas disponíveis, será priorizado o estudante com o maior Índice de Prioridade ou o maior porcentual de carga horária integralizada.§ 3º O atendimento de vagas disponíveis poderá ser preferencialmente para os estudantes do curso ofertante. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 4º Será de inteira responsabilidade do estudante a recuperação do conteúdo já ministrado e a observância da frequência mínima exigida no componente curricular por ele acrescentado.Art. 68. Após o processamento da solicitação de matrícula, as vagas remanescentes nas turmas ofertadas poderão ser disponibilizadas como NL, respeitados os pré-requisitos, os co-requisitos e as exigências específicas de cada componente curricular.", "Art. 69. Os pedidos de acréscimo de componentes curriculares, solicitados após os períodos estabelecidos em calendário acadêmico, serão analisados pelo coordenador de curso ou coordenador do curso responsável pela oferta do componente curricular.§ 1º A análise do pedido de acréscimo de componente curricular deverá observar todas as condições seguintes:", "I- justificativa comprovada do impedimento para solicitar acréscimo no período previsto em calendário acadêmico;I- justificativa do impedimento para solicitar acréscimo no período previsto em calendário acadêmico; (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "23 II- vaga disponível;III- aprovação nos pré-requisito do componente curricular, se houver;IV- matrícula nos co-requisitos do componente curricular, se houver;V- carga horária máxima a ser cursada por semestre, quando estabelecida no projeto pedagógico do curso;VI- ausência de sobreposição de horários de aulas;VII- possibilidade de cumprir a frequência mínima de 75% (setenta e cinco por cento) da carga horária do componente curricular.", "§ 2º Havendo demanda de pedidos superior ao número de vagas disponíveis, será priorizado o estudante com o maior Índice de Prioridade ou maior porcentual de carga horária integralizada.Art. 70. O estudante regularmente matriculado em curso oferecido na modalidade a distância da UFG poderá cursar componentes curriculares em curso presencial, mediante o cumprimento das seguintes condições:", "I- ter sido reprovado no componente curricular de seu curso e este não ter previsão de nova ofertada;II- o componente curricular do curso presencial ser equivalente quanto ao conteúdo e à carga horária do componente curricular do curso do estudante;III- anuência dos coordenadores dos cursos envolvidos.", "§ 1º O estudante de curso na modalidade a distância poderá cursar, no máximo, dois componentes curriculares em cursos na modalidade presencial da UFG, exceto quando o PPC previr a quantidade de disciplinas.§ 2º Ficará a cargo do estudante a responsabilidade por cursar o componente curricular na modalidade presencial.", "Art. 71. O estudante regularmente matriculado em curso presencial da UFG poderá cursar componente curricular em curso a distância da UFG, mediante o cumprimento das seguintes condições:I- ter sido reprovado no componente curricular de seu curso e este não ser mais ofertado;II- o componente curricular do curso a distância ser equivalente quanto ao conteúdo e à carga horária ao componente curricular do curso do estudante;III- anuência dos coordenadores dos cursos envolvidos.", "§ 1º O estudante de curso presencial poderá cursar, no máximo, dois componentes curriculares na modalidade a distância, exceto quando o PPC previr a quantidade de disciplinas.§ 2º Ficará a cargo do estudante a responsabilidade por cursar o componente curricular na modalidade a distância.", "Seção IV 24 Do Trancamento de Matrícula Art. 72. Será permitido o trancamento de matrícula, em período definido no calendário acadêmico.", "§ 1º Cada trancamento terá validade de apenas um semestre letivo.§ 2º Não será computado, no prazo de integralização do curso, o semestre correspondente ao de trancamento de matrícula.§ 2º O prazo de integralização do curso em decorrência de trancamento será prorrogado no máximo dois semestres letivos, independente do número de trancamentos efetuados. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019) § 2º Não será computado, no prazo de integralização do curso, o semestre correspondente ao de trancamento de matrícula. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "§ 3º A partir do terceiro trancamento, o semestre correspondente ao de trancamento de matrícula será computado no prazo de integralização do curso. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) § 3º [suspenso]. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Art. 73. O trancamento de matrícula não poderá ocorrer por mais de 4 (quatro) semestres letivos, consecutivos ou alternados.Art. 73. O trancamento de matrícula não poderá ocorrer por mais de 6 (seis) semestres letivos, consecutivos ou alternados. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Parágrafo único. No semestre letivo em que o estudante não possa, excepcionalmente, se matricular em componente curricular necessário para a integralização curricular, por falta de oferta, será permitido o trancamento de matrícula, ainda que exceda o limite definido no caput deste artigo.", "Art. 74. Fica vedado trancamento de matrícula ao estudante regularmente matriculado na UFG em turmas especiais, exceto se previsto em editais específicos do processo seletivo.Parágrafo único. Entende-se por turma especial aquele curso de graduação ofertado por meio de convênio, na modalidade presencial ou a distância.", "Art. 75. Fica vedado ao estudante regularmente matriculado na UFG o trancamento de sua matrícula no semestre de ingresso, exceto nos seguintes casos:I- doença do interessado ou de pessoa de seu núcleo familiar que exija envolvimento direto do interessado, devidamente comprovado por relatório médico original, ouvido órgão competente da UFG, se necessário;II- mudança de horário ou de município em função do emprego/cargo, ocorrido após a realização do processo seletivo e/ou ingresso do estudante na UFG, devidamente comprovado;III- cumprimento de serviço militar obrigatório.", "25 Parágrafo único. Excepcionalmente, poderá ter sua matrícula trancada o estudante que justificar a impossibilidade de cursar turmas no modo remoto. (Incluído pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Art. 76. Fica vedado ao estudante regularmente matriculado na UFG o trancamento de sua matrícula fora do prazo previsto no calendário acadêmico, exceto nos seguintes casos:I- doença do interessado ou de pessoa de seu núcleo familiar que exija envolvimento direto do interessado, devidamente comprovado por relatório médico, ouvido o órgão competente da UFG, se necessário;II- mudança de horário ou de município em função do emprego/cargo, devidamente comprovado, ocorrido após o encerramento do prazo do trancamento de matrícula;III- cumprimento de serviço militar obrigatório.", "Art. 77. Terão direito ao trancamento de matrícula os estudantes que não disponham de tempo hábil para cumprir a frequência mínima obrigatória dos componentes curriculares previstos no PPC para o semestre de ingresso.Art. 78. Estudantes que estejam com matrícula trancada poderão solicitar vaga em componentes curriculares oferecidos nos períodos de verão ou de inverno.", "Art. 79. No semestre correspondente ao trancamento de matrícula, o estudante ficará impedido de realizar estágio curricular não obrigatório e perderá benefícios cuja concessão exija a sua frequência no curso.Art. 80. A UFG poderá atribuir trancamento compulsório de matrícula aos estudantes que não regularizaram seu vínculo num determinado semestre, observado o limite máximo de quatro trancamentos definidos no caput do art. 73.", "Parágrafo único. Entende-se por trancamento compulsório de matrícula a manutenção de vínculo do estudante que, no semestre imediatamente anterior, encontrava-se numa situações previstas no previstas no art. 33.Art. 81. O trancamento também poderá ser de ofício, conforme previsto no art.117, § 2º, deste RGCG.", "Parágrafo único. O trancamento de ofício não será incluído no limite máximo de 4 (quatro) trancamentos definidos no caput do art. 73 deste RGCG.Parágrafo único. O trancamento de ofício não será incluído no limite máximo de 4 (quatro) trancamentos definidos no caput do art. 73 e nem estará sujeito ao disposto nos §§ 2º e 3º do art. 72 deste RGCG. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Capítulo IV 26 Da Avaliação, Da Segunda Chamada de Avaliação, Da Revisão de Nota, Da Frequência, Da Revisão de Frequência, Do Aproveitamento de Componentes Curriculares e de Atividades Complementares", "Seção I Da Avaliação Art. 82. A nota final do estudante no componente curricular variará de 0,0 (zero) a 10,0 (dez), com uma casa decimal, seguindo o mesmo critério de arredondamento do art. 56, § 3º.Art. 82. A nota final do estudante no componente curricular variará de 0,0 (zero) a 10 (dez), com uma casa decimal, seguindo o mesmo critério de arredondamento do art. 56, § 3º. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 1º A nota final será resultado de, no mínimo, duas avaliações que podem ser provas, trabalhos, seminários, relatórios ou outras formas de produção acadêmica escrita, oral, prática ou audiovisual do estudante.§ 2º Será aprovado no componente curricular o estudante que obtiver nota final igual ou superior a 6,0 (seis) e frequência igual ou superior a 75% (setenta e cinco por cento) da carga horária total do componente curricular, observado o disposto no art. 87 deste RGCG.", "§ 3º Nos cursos a distância, será aprovado no componente curricular o estudante que obtiver nota igual ou superior a 6,0 (seis) e participação de, no mínimo, 75% (setenta e cinco por cento) das atividades presenciais e não presenciais.§ 4º Nos cursos a distância, os resultados das avaliações em momentos presenciais deverão corresponder ao mínimo de 51% (cinquenta e um por cento) da composição da nota final.", "§ 5º O docente responsável pelo componente curricular só poderá realizar uma nova avaliação após disponibilizar, no sistema acadêmico, a nota obtida na avaliação anterior, com antecedência de pelo menos 4 (quatro) dias letivos.§ 5º O docente responsável pelo componente curricular só poderá realizar uma nova avaliação após disponibilizar ao estudante, a nota obtida na avaliação anterior, com antecedência de pelo menos 4 (quatro) dias. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 6º Em casos de turmas com avaliações de periodicidade igual ou inferior a 15 (quinze) dias, a nota obtida na última avaliação deverá ser disponibilizada antes da próxima avaliação. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) § 7º O docente responsável pelo componente curricular deverá devolver os originais de trabalhos ou provas ao estudante até cinco dias após a disponibilização da nota, exceto trabalhos de conclusão de curso e relatórios de estágios, que serão arquivados na instituição.", "§ 8º Cabe ao professor responsável pelo componente curricular registrar as notas das avaliações, as faltas e consolidar a turma no sistema acadêmico, em prazos estabelecidos no calendário acadêmico.27 § 9º O registro no sistema acadêmico ficará disponível para consulta pelo coordenador e secretário de curso e vice-diretor da unidade acadêmica ou subchefe da unidade acadêmica especial responsável pelo componente curricular.", "§ 10. Os processos e critérios de avaliação e o cronograma de avaliações, relativos ao processo de ensino-aprendizagem, deverão estar previstos no plano de ensino do componente curricular, observado o disposto no art. 109 deste RGCG.Seção II Da Segunda Chamada de Avaliação", "Art. 83. O estudante que deixar de realizar avaliações do componente curricular poderá solicitar ao professor segunda chamada, até 7 (sete) dias após a data de realização da avaliação.Art. 84. O estudante poderá solicitar segunda chamada de avaliação de componentes curriculares à unidade acadêmica ou à unidade acadêmica especial responsável pelo componente curricular, até 7 (sete) dias após a data da realização da avaliação.", "Parágrafo único. Nos cursos a distância, o pedido de segunda chamada deverá ser entregue ou enviado por meio eletrônico ao coordenador de curso, e, caso seja deferido, caberá à coordenação do curso definir a data da nova avaliação.Seção III Da Revisão de Nota de Avaliação", "Art. 85. O estudante poderá solicitar ao professor revisão de nota de avaliação, no prazo máximo de 7 (sete) dias,a partir da data de entrega do trabalho ou da prova.Art. 86. O estudante poderá solicitar revisão de nota de avaliação de componentes curriculares, no prazo máximo de 7 (sete) dias, à unidade acadêmica ou à unidade acadêmica especial responsável pelo componente curricular.", "Parágrafo único. Nos cursos a distância, o pedido de revisão de nota de avaliação deverá ser entregue ou enviado por meio eletrônico ao coordenador de curso.Seção IV Da Frequência", "Art. 87. Será obrigatória ao estudante a frequência mínima de 75% (setenta e cinco por cento) da carga horária de cada componente curricular, nos cursos presenciais.§ 1º Nos componentes curriculares de estágio obrigatório, a frequência exigida será de 100% (cem por cento) e o coordenador de curso, orientador e/ou coordenador de estágio deverá oferecer formas de reposição para compensação das faltas justificadas, a fim de cumprimento de carga horária em sua totalidade.", "28 § 2º O registro das faltas às aulas, no sistema acadêmico, será de responsabilidade do professor do componente curricular.§ 2º O registro das faltas às aulas, no sistema acadêmico, será de responsabilidade do professor do componente curricular, que deverá estar atualizado e disponível ao discente. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 3º O registro no sistema acadêmico ficará disponível para consulta pelo coordenador e secretário de curso e vice-diretor da unidade acadêmica ou subchefe da unidade acadêmica especial responsável pelo componente curricular.§ 4º A frequência será computada por meio de participação nas atividades previstas nos planos de ensino do componente curricular. (Incluído pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Art. 88. Será obrigatória ao estudante a frequência de participação mínima de 75% (setenta e cinco por cento) do total das atividades presenciais e não presenciais previstas no componente curricular, nos cursos a distância.§ 1º O registro das faltas nas atividades presenciais e não presenciais será de responsabilidade do professor do componente curricular.§ 1º O registro das faltas nas atividades presenciais e não presenciais será de responsabilidade do professor do componente curricular, que deverá estar atualizado e disponível ao discente. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º O registro no sistema acadêmico ficará disponível para consulta pelo coordenador e secretário de curso e vice-diretor da unidade acadêmica ou subchefe da unidade acadêmica especial responsável pelo componente curricular.Seção V Da Revisão de Frequência", "Art. 89. O estudante poderá solicitar revisão de frequência ao professor do componente curricular até 5 (cinco) dias após a data limite para consolidação do componente curricular, prevista no calendário acadêmico.Art. 90. O estudante poderá solicitar em até 5 (cinco) dias após a data limite para consolidação do componente curricular, prevista no calendário acadêmico, revisão de frequência de componentes curriculares à unidade acadêmica ou à unidade acadêmica especial responsável pelo componente curricular.", "Seção VI Do Aproveitamento de Componente Curricular e de Atividades Complementares Art. 91. O estudante terá direito a requerer aproveitamento de componente curricular cursado na educação superior antes de seu ingresso no curso atual na UFG.", "§ 1º Componentes curriculares cursados pelo estudante antes de ingressar no curso atual, não aproveitados como Núcleo Comum ou Específico, poderão ser aproveitados como Núcleo Livre, desde que existentes no banco de componentes curriculares cadastrados na UFG.", "29 § 2º Componentes curriculares cursados pelo estudante na própria UFG em outro(s) vínculo(s), que sejam de mesmo código ou que sejam equivalentes do componente do vínculo atual, deverão ser aproveitados. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 3º O aproveitamento de componente curricular poderá abreviar a duração do curso de graduação para um tempo inferior ao médio previsto no PPC, de acordo com a legislação em vigor.§ 4º Componentes curriculares, como monografia ou projeto final de curso, não poderão ser aproveitados, salvo se cursados na UFG e em cursos cuja titulação seja a mesma conferida no diploma do curso atual.", "§ 5º No caso de componente curricular de Estágio, este só poderá ser aproveitado quando tiver sido realizado no mesmo curso, grau acadêmico e habilitação, se houver.Art. 92. Componentes curriculares cursados pelo estudante em outra Instituição de Ensino Superior (IES) de forma paralela ao curso atual na UFG não serão aproveitados, senão em casos de convênios estabelecidos com outras IES ou por meio de programas de intercâmbio ou de mobilidade reconhecidos pela UFG.Art. 92. Componentes curriculares cursados remotamente pelo estudante de forma paralela ao curso atual na UFG poderão ser aproveitados, desde que em Instituições Públicas de Ensino Superior (IPES) ou estrangeiras que participam dos programas de intercâmbio ou de mobilidade reconhecidos pela UFG. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Art. 93. O coordenador de curso poderá autorizar o estudante a cursar, em outra IES reconhecida, no máximo dois componentes curriculares, nas seguintes situações:Art. 93. O coordenador de curso poderá autorizar o estudante formando a cursar, em outra IES reconhecida, no máximo quatro componentes curriculares, desde que mantenha o vínculo com a UFG, respeitando-se os pré-requisitos e co-requisitos e conforme o disposto no art. 94 deste RGCG. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "I- não existência de componente curricular equivalente em novas matrizes curriculares dos cursos da UFG;I- [suspenso]; (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020) II- impossibilidade da UFG oferecer o componente curricular no mesmo período em que o estudante tenha condições de concluir o curso, respeitando-se os pré-requisitos e co-requisitos e conforme o disposto no art. 94 deste RGCG.II- [suspenso]. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "Art. 94. A análise do pedido de aproveitamento de componente curricular far-se-á com base na equivalência de seus conteúdos programáticos e que tenha, pelo menos, 75% (setenta e cinco por cento) da carga horária do componente curricular da UFG.30 § 1º O parecer sobre o aproveitamento do componente curricular deverá ser emitido pelo coordenador do curso, ouvindo-se, se necessário, o NDE ou a unidade acadêmica ou unidade acadêmica especial responsável pelo componente curricular.", "§ 2º Os componentes curriculares aproveitados deverão constar do histórico e do extrato acadêmico, conforme previsto nos artigos119 e 120 deste RGCG.§ 3º No caso de aproveitamento de componente curricular de estágio, a equivalência que trata o caput deste artigo deverá ser 100% da carga horária do componente de estágio da UFG.", "Art. 95. O estudante que cursou componente curricular de NL no curso ao qual está vinculado poderá requerer aproveitamento deste como NC ou NE, se houver equivalência de seus conteúdos programáticos e com carga horária igual ou superior ao componente curricular a ser aproveitado.", "§ 1º O aproveitamento fica condicionado ao cumprimento dos pré e/ou co- requisitos do componente a ser aproveitado.§ 1º O aproveitamento fica condicionado ao cumprimento prévio dos pré e/ou co-requisitos do componente a ser aproveitado e à manutenção do vínculo do estudante no semestre em que foi cursado o componente curricular de NL. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 2º O componente curricular originalmente cursado será retirado do extrato acadêmico, constando apenas o componente curricular aproveitado.§ 2º O componente curricular originalmente cursado será retirado do extrato e/ou histórico acadêmico, constando apenas o componente curricular aproveitado. (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "§ 3º Após o encerramento do vínculo do estudante no curso, por qualquer motivo, o aproveitamento de que trata este artigo não poderá ser desfeito. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) Art. 96. O aproveitamento de componentes curriculares cursados em programas de mobilidade estudantil obedecerá ao disposto em resolução específica.", "Art. 97. O aproveitamento de disciplinas realizadas em programas de pós- graduação stricto sensu (mestrado e doutorado) da UFG ou no Centro de Ensino Pesquisa Aplicada (CEPAE) da UFG, cursadas paralelamente ao atual curso de graduação, obedecerá ao disposto em resolução que trate da integração entre diferentes níveis de formação na UFG.", "Art. 98. O estudante poderá requerer à coordenação do curso aproveitamento de atividades complementares feitas para outro curso superior.Parágrafo único. O pedido de aproveitamento de atividades complementares será analisado com base nos critérios estabelecidos pela unidade acadêmica ou unidade acadêmica especial.", "Seção VII Da Dispensa de Componente Curricular por Extraordinário Domínio de Conteúdo 31 Art. 99. É facultado ao estudante solicitar dispensa de cursar componente curricular que integra a matriz curricular de seu curso, com justificativa de extraordinário domínio de conteúdo, mediante avaliação específica aplicada por banca examinadora.", "§ 1º A dispensa de cursar componente curricular poderá abreviar a duração do curso de graduação para um tempo inferior ao médio previsto no PPC, de acordo com a legislação em vigor.§ 2º O disposto no caput deste artigo não se aplica às disciplinas de Estágio Curricular Obrigatório, Trabalho de Conclusão de Curso ou Monografia e de Núcleo Livre.", "Art. 100. O pedido de avaliação será requerido pelo estudante, acompanhado de justificativa fundamentada, uma única vez para cada componente curricular, sendo facultativo às unidades acadêmicas a definição do período de realização das avaliações.Parágrafo único. São requisitos para o estudante solicitar a avaliação:", "I- estar devidamente vinculado à UFG;II- não ter sido reprovado por falta ou por nota no componente curricular em que pretende ser avaliado;III- ter média global igual ou superior a 8,0 (oito), à exceção do estudante que, no semestre de ingresso na UFG, solicitar a avaliação.", "Art. 101. O pedido de avaliação será analisado pelo coordenador de curso do estudante.Parágrafo único. Caberá ao coordenador do curso:I- verificar se o estudante preenche os requisitos;II- julgar se o pedido é pertinente;III- se atendidas as condições previstas nos incisos I e II, solicitar ao diretor da unidade acadêmica ou ao chefe da unidade acadêmica especial responsável pelo componente curricular a nomeação de uma banca examinadora de reconhecida competência na área, composta de três membros efetivos e um suplente.", "Art. 102. A banca examinadora deverá definir e divulgar os critérios e a sistemática de avaliação e fazer constar em ata os procedimentos e os resultados do processo avaliativo.§ 1º O professor responsável pelo componente curricular deverá fazer parte da banca examinadora.", "§ 2º O conteúdo a ser avaliado deve constar do plano de ensino vigente do componente curricular, aprovado no conselho diretor da unidade acadêmica ou colegiado da unidade acadêmica especial.§ 3º Considera-se aprovado aquele estudante que obtiver a nota igual ou superior a 8,0 (oito) na avaliação da banca.", "32 Art. 103. Caberá ao diretor da unidade acadêmica ou ao chefe da unidade acadêmica especial responsável pelo componente curricular apresentar o resultado da avaliação da banca examinadora para homologação do respectivo conselho diretor ou colegiado.", "Art. 104. Se aprovado na avaliação, o estudante obterá dispensa de cursar o componente curricular, sendo registrada no seu histórico acadêmico a nota conferida pela banca examinadora e a carga horária total do componente curricular.Parágrafo único. O registro deverá ser feito pelo coordenador de curso do estudante.", "Art. 105. O estudante da UFG com média global igual ou superior a 8,0 (oito) e nota final igual ou superior a 8,0 (oito) num componente curricular, ficará na condição de aprovado, mesmo não tendo alcançado a frequência mínima exigida de acordo com art. 87, exceto em componente do tipo Estágio, por exigência da legislação, e Trabalho de Conclusão de Curso ou Monografia.", "Parágrafo único. Será considerada a média global do estudante, a qual se refere o caput deste artigo, aquela atualizada em data prevista pela Prograd e divulgada no sitio eletrônico desta Pró-reitoria.CapítuloV Do Calendário Acadêmico, Dos Horários de Aulas de Componentes Curriculares, Do Plano de Ensino do Componente Curricular, da Avaliação e Acompanhamento dos Cursos", "Seção I Do Calendário Acadêmico Art. 106. A proposta do calendário acadêmico, elaborada por comissão designada pelo Reitor, será aprovada pela Câmara Superior de Graduação e pelo CEPEC.", "Seção II Dos Horários de Aulas de Componentes Curriculares Art. 107. O horário de aulas será proposto pela Câmara de Graduação de cada uma das Regionais para os turnos matutino, vespertino e noturno e aprovado pela Câmara Superior de Graduação, na forma de resolução específica.", "§ 1º O horário de cada um dos turnos (matutino, vespertino e noturno) será único na regional, observando-se o disposto no art. 16 deste RGCG.§ 2º Os componentes curriculares deverão ser ofertados de acordo com o horário de aulas de cada regional, ouvindo-se as unidades acadêmicas ou unidades acadêmicas especiais envolvidas.", "§ 3º Os componentes curriculares de NL, estágios, monografias ou trabalho de conclusão de curso poderão ser ofertados em turno diferente do previsto para o curso.33 § 4º Os componentes curriculares de NE optativos poderão ser ofertados em turno diferente do previsto para o curso, desde haja oferta também no turno do curso, nos termos do § 8º, art. 43 deste RGCG.", "Art. 108. As alterações dos horários da oferta do componente curricular, após a efetivação da matrícula de estudantes no semestre letivo, somente poderão ser efetuadas mediante anuência de todos os matriculados, do professor do componente curricular e do coordenador de curso.", "Seção III Do Plano de Ensino de Componentes Curriculares Art. 109. Cada componente curricular terá plano de ensino elaborado pelo respectivo professor ou grupo de professores, a ser aprovado pelo conselho diretor da unidade acadêmica ou colegiado da unidade acadêmica especial responsável pelo componente curricular, nos termos do Regimento da UFG e deste RGCG, em consonância com o PPC.", "§ 1º O plano de ensino deve ser composto de, no mínimo:I- identificação;II- ementa;III- objetivo;IV- conteúdo programático e cronograma;V- metodologia;VI- atividades supervisionadas;VII- processos e critérios de avaliação e o cronograma de avaliações;VIII- referências bibliográficas (básica e complementar).", "§ 2º O detalhamento do conteúdo ministrado por aula deverá ser registrado pelo professor no diário de turma.§ 3º O plano de ensino e o diário da turma ficarão disponíveis no sistema acadêmico para consulta pelo coordenador do curso e vice-diretor da unidade acadêmica ou subchefe da unidade acadêmica especial responsável pelo componente curricular.", "Art. 110. O programa do componente curricular é o documento que sintetiza o plano de ensino para fins de apresentação em outras instituições de ensino.§ 1º O programa do componente curricular deverá conter os seguintes itens do plano de ensino:", "I- identificação;II- ementa;III- conteúdo programático;IV- bibliografia básica e complementar.", "§ 2º Os programas dos componentes curriculares devem estar disponíveis nos sítios das unidades acadêmicas ou unidades acadêmicas especiais responsáveis pelos cursos.34 Art. 111. O professor deverá disponibilizar no sistema acadêmico os planos de ensino dos componentes curriculares sob sua responsabilidade nos primeiros 15 (quinze) dias de aula.", "Art. 112. O não cumprimento integral do plano de ensino do componente curricular e sua respectiva carga horária, pelo professor responsável, sem justificativa apropriada, acarretará aplicação de sanções previstas na legislação.Seção IV Da Avaliação e Acompanhamento dos PPC’s", "Art. 113. A avaliação e o acompanhamento dos PPCs serão feitos conforme resoluções da UFG, observado o que dispõem o Regimento da UFG e a legislação federal pertinente.Capítulo VI Da Exclusão de Estudantes e Das Vagas Remanescentes", "Seção I Da Exclusão de Estudantes Art. 114. Será excluído do quadro discente da UFG o estudante que:I- for reprovado por falta em todos componentes curriculares em que foi matriculado no semestre de ingresso, mesmo havendo o registro de aproveitamento de disciplinas ou módulos;I- [suspenso]; (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020) II- não regularizar o vínculo por dois semestres letivos, consecutivos ou alternados, nos termos do art. 33 deste RGCG;II- não regularizar o vínculo em um semestre letivo, nos termos do artigo 33 e após cumprimento do artigo 80; (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019) III- tiver esgotado seu prazo para integralização curricular;III- [suspenso]; (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020) IV- for reprovado por média e falta (RMF) em todas as disciplinas ou módulos, em dois semestres consecutivos, mesmo havendo trancamento entre eles. (Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019) IV- [suspenso]. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "§ 1º A exclusão também se aplica nos casos de desligamento por decisão do reitor, conforme previsto no Regimento da UFG, ou por decisão judicial.§ 2º A relação de estudantes em situação de exclusão será divulgada por meio de Edital, a ser publicado em data prevista no Calendário Acadêmico.", "35 § 3º Será atribuído trancamento compulsório de matrícula, uma única vez, ao estudante que não regularizar o vínculo no semestre, desde que não ultrapasse quatro trancamentos conforme o art. 73 deste RGCG.", "Seção II Das Vagas Remanescentes Art. 115. Vagas Remanescentes são as não preenchidas após a realização da última chamada para matrícula dos candidatos selecionados por meio de processos seletivos e as vagas resultantes da inativação do registro acadêmico.", "Parágrafo único. A apuração do número de vagas remanescentes e os critérios para preenchimento serão previstos em resolução específica.Capítulo VII Do Tratamento Excepcional e Do Tratamento Excepcional de Ofício", "Art. 116. De acordo com legislação vigente, será assegurado tratamento excepcional no processo de ensino-aprendizagem aos estudantes nas seguintes situações:I- gestantes;II- com afecções congênitas ou adquiridas, infecções, traumatismos ou outras condições caracterizadas por incapacidade física e/ou psicológica, incompatível com a frequência às atividades acadêmicas;III- com necessidades educacionais especiais;IV- com descendentes com afecções congênitas ou adquiridas, infecções, traumatismos ou outras condições caracterizadas por incapacidade física e/ou psicológica, incompatível com a frequência em suas atividades acadêmicas.", "§ 1º O disposto no caput deste artigo aplica-se apenas aos estudantes regulares, vinculados à UFG nos termos do art. 33 deste RGCG.§ 2º O pedido de tratamento excepcional, acompanhado de relatório médico, deverá ser protocolado até 20 (vinte) dias após a data do relatório.§ 2º O pedido de tratamento excepcional, acompanhado de relatório médico, deverá ser protocolado até 40 (quarenta) dias após a data do relatório. (Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "§ 3º O pedido de tratamento excepcional deverá ser acompanhado de relatório médico em que conste a classificação da doença (CID), justificativa e período de afastamento e o CRM do médico, bem como de exames comprobatórios da doença.§ 4º Nos casos previstos inciso III deste artigo, o pedido de tratamento excepcional deverá ser acompanhado do relatório médico, conforme § 3º e/ou relatório emitido pelo Núcleo de Acessibilidade da UFG.", "§ 5º No caso de estudante gestante, sem complicações obstétricas, o pedido de tratamento excepcional poderá ser feito a partir do oitavo mês de gestação, acompanhado do atestado médico que deve informar a idade gestacional, ou da certidão de nascimento, de acordo com a legislação vigente.", "36 § 6º Para fins de homologação, o relatório médico deverá ser avaliado pelo órgão competente da UFG, que procederá à avaliação presencial do estudante ou de seu descendente se necessário, exceto se for caso previsto no § 5º desse artigo.", "§ 7º Caberá ao coordenador de curso a análise dos pedidos de tratamento excepcional, ouvido o Núcleo de Acessibilidade da UFG quando for o caso, estando a concessão condicionada à viabilidade da continuidade do processo didático-pedagógico.Art. 117. Ao estudante em tratamento excepcional poderá ser atribuído exercício domiciliar, sob orientação dos professores dos componentes curriculares em que estiver matriculado, conforme legislação em vigor.", "§ 1º Quando não houver a garantia do disposto no § 7º do art. 116 deste RGCG, no tocante a um ou mais componentes curriculares em que o estudante estiver matriculado, o coordenador de curso poderá determinar seu cancelamento.§ 2º Quando não houver a garantia do disposto no § 7º do art.116 deste RGCG, no tocante ao conjunto dos componentes curriculares nos quais o estudante estiver matriculado, o coordenador de curso determinará o trancamento de ofício.", "Art. 118. O tratamento excepcional de ofício poderá ser requerido à Prograd pelo coordenador de curso, diretor da unidade acadêmica ou chefe da unidade acadêmica especial responsável pelo curso.§ 1º O requerimento deverá estar acompanhado de relatório circunstanciado, com a exposição de todos os fatos que motivaram a solicitação de tratamento excepcional.", "§ 2º Caberá à Prograd decidir sobre os pedidos de tratamento excepcional de ofício, após parecer do órgão competente da UFG, de acordo com legislação vigente.§ 3º O parecer deverá indicar a pertinência ou não da continuidade da frequência do estudante às atividades acadêmicas, bem como o prazo estimado para tratamento excepcional.", "§ 4º Deferido o pedido, o coordenador de curso deverá adotar as providências cabíveis.§ 5º Ao estudante em tratamento excepcional de ofício poderá ser atribuído o exercício domiciliar nos termos do art. 117 deste RGCG.", "Capítulo VIII Do Histórico e do Extrato Acadêmico Art. 119. O histórico acadêmico é o documento oficial, disponibilizado pela UFG, que apresenta o registro acadêmico do estudante.", "§ 1º Constarão no histórico acadêmico:37 I- os componentes curriculares em que o estudante obteve aprovação, reprovação, aproveitamento, dispensa ou validação, suas respectivas cargas horárias, semestre letivo e ano;II- a nota final dos componentes curriculares cursados e dispensados;III- a nota final dos componentes curriculares cursados como NL e aproveitados nos termos do art. 95 deste RGCG;IV- a nota final dos componentes curriculares cursados em outras instituições de ensino superior por meio de programas de mobilidade e aproveitados nos termos do art. 96 deste RGCG;IV- a nota final dos componentes curriculares cursados em outras instituições de ensino superior nacionais por meio de programas de mobilidade e aproveitados nos termos do art. 96 deste RGCG;(alteração incluída pela Resolução CEPEC Nº 1612, de 30 de novembro de 2018) V- a média global do estudante e a média global do curso;VI- a carga horária das atividades complementares;VII- as ocorrências relacionadas ao vínculo do estudante;VIII- demais componentes cujo registro seja exigido em legislação específica.", "§ 2º Deverão constar no histórico acadêmico os componentes curriculares cursados pelo estudante da UFG em programas de mobilidade interna e/ou externa.§ 3º Após a integralização curricular o estudante terá direito ao histórico acadêmico sem os componentes curriculares com reprovação, exceto quando houver impedimento por decisões administrativas e/ou judiciais.", "Art. 120. O extrato acadêmico é o documento oficial, disponibilizado pela UFG, para acompanhamento, pelo estudante, de sua situação acadêmica.§ 1º Constarão no extrato acadêmico:I- o código da matriz curricular;II- os componentes curriculares em que o estudante obteve aprovação, reprovação, aproveitamento, dispensa ou validação, suas respectivas cargas horárias, semestre letivo e ano, natureza (obrigatória ou optativa), forma do núcleo (NC, NE e NL) e código da turma;III- a nota final e frequência obtida pelo estudante nos componentes curriculares cursados e dispensados;IV- a nota final dos componentes curriculares cursados como NL e aproveitados nos termos do art. 95 deste RGCG;V- a nota final dos componentes curriculares cursados em outras instituições de ensino superior por meio de programas de mobilidade e aproveitados nos termos do art. 96 deste RGCG;V- a nota final dos componentes curriculares cursados em outras instituições de ensino superior nacionais por meio de programas de mobilidade e aproveitados nos termos do art. 96 deste RGCG;(alteração incluída pela Resolução CEPEC Nº 1612, de 30 de novembro de 2018) VI- a média global do estudante e a média global do curso;", "38 VII- a carga horária cursada por forma e natureza dos componentes curriculares (NC, NE Obrigatório, NE Optativo e NL);VIII- a carga horária das atividades complementares;IX- a carga horária da Prática como Componente Curricular (PCC), quando se tratar de curso de licenciatura;X- as ocorrências relacionadas ao vínculo do estudante;XI- demais componentes cujo registro seja exigido em legislação específica.", "Capítulo IX Da Integralização Curricular e do Prazo de Integralização Curricular e Da Colação de Grau Seção I Da Integralização Curricular e do Prazo de Integralização Curricular", "Art. 121. A integralização curricular dar-se-á pela conclusão dos componentes curriculares e das atividades complementares, previstos no PPC, além de componentes curriculares obrigatórios previstos em normas específicas.§ 1º O estudante que concluir seu curso nos períodos de verão ou inverno será considerado concluinte do semestre imediatamente anterior.", "§ 2º O estudante deverá concluir o curso até o prazo máximo para integralização curricular definido no PPC.§ 2º O estudante deverá concluir o curso até o prazo máximo para integralização curricular, excepcionalmente definido pela UFG em Resolução específica.(Redação dada pela Resolução CONSUNI Nº 33/2020, de 14/08/2020)", "§ 3º Ficará dispensado da obrigatoriedade de cumprir a CH de NL o estudante formando 2020/1 ou o provável formando de 2020/2. (Incluído pela Resolução CONSUNI Nº 33/2020, de 14/08/2020) Art. 122. Fica vedado ao estudante com currículo integralizado efetuar matrícula, no mesmo curso, no semestre letivo seguinte.", "Parágrafo único. Fica vedado também ao estudante efetuar a matrícula no semestre seguinte, caso tenha cumprida toda a carga horária em componentes curriculares prevista no PPC, mas que necessita comprovar o cumprimento da carga horária de atividades complementares e/ou componentes curriculares obrigatórios previstos em normas específicas.(Incluído pela Resolução CEPEC Nº 1661, de 29/11/2019)", "Seção II Da Colação de Grau Art. 123. Estará apto a colar grau o estudante que integralizar o currículo do curso ao qual está vinculado, conforme dispõe o artigo 121 deste RGCG.", "§ 1º Caberá ao coordenador do curso verificar o cumprimento dos componentes curriculares, Enade e atividades acadêmicas exigidas para a concessão do grau.39 § 2º A verificação da integralização curricular será feita semestralmente pelo CGA/Prograd.", "§ 3º O CGA é o órgão responsável pela elaboração da lista oficial de concluintes aptos a participar da cerimônia de Colação de Grau da turma.§ 4º A colação de grau é condição para a diplomação do estudante.Art. 124. Os procedimentos para as cerimônias de colação de grau serão regulamentados em resolução específica.", "Capítulo X Dos Direitos e Deveres do Corpo Discente Art. 125. Os direitos e deveres do corpo discente são os previstos no Capítulo III (Do Corpo Discente) do Título XI (Da Comunidade Universitária) do Regimento Geral da UFG, observado o disposto na legislação vigente.", "§ 1º Os atos que oficializam sanções aplicadas a estudantes serão encaminhados ao CGA para arquivamento.§ 2º O estudante que se manifestar contra qualquer estudante “calouro”, a título de “trote”, estará sujeito ao regime disciplinar conforme resolução específica da UFG.", "TÍTULO III DAS DISPOSIÇÕES FINAIS Art. 126. É dever do estudante manter seus dados cadastrais atualizados, incluindo endereço domiciliar, telefones e endereço eletrônico.", "Parágrafo único. A atualização pode ser feita a qualquer momento por meio do Portal do Discente, desde que o estudante esteja regularmente vinculado à instituição.Art. 127. A UFG utilizará o endereço eletrônico ou o endereço domiciliar cadastrados para comunicar resultados de solicitações acadêmicas de interesse do estudante.", "Parágrafo único. Os resultados mencionados no caput deste artigo também serão comunicados por meio do endereço eletrônico ou endereço domiciliar informado pelo estudante no respectivo requerimento.Art. 128. O trâmite das solicitações previstas neste regulamento será determinado por normas específicas.", "Art. 129. Os recursos relativos às decisões dos conselhos deliberativos serão regulamentados conforme o que consta do Regimento Geral e do Estatuto da UFG.Art. 130. Este Regulamento entrará em vigor na data de sua publicação, salvo o disposto no art. 131, revogando-se as disposições em contrário.", "40 Art. 131. Entrarão em vigor até o início do 1º semestre letivo de 2019:Art. 131. Entrarão em vigor até o início do 2º semestre letivo de 2019:(alteração incluída pela Resolução CEPEC Nº 1612, de 30 de novembro de 2018) Art. 131. Entrarão em vigor no decorrer do 1º semestre letivo de 2020:(Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)", "I- art. 54, caput e §§2º, 3º e 4º (ajuste no Índice de Prioridade);II- art. 56, § 2º (disciplinas aproveitadas com nota);III- art. 56, § 3º (critério de arredondamento);IV- art. 60 (efetivação de matrícula ou trancamento);V- art. 66, inciso VII (motivo de cancelamento fora do prazo);VI- art. 82, (critério de arredondamento);VII- art. 119, incisos III e IV (disciplinas aproveitadas com nota);VIII- art. 120, inciso IV e V (disciplinas aproveitadas com nota).", "Parágrafo único. As regras citadas no caput deste artigo poderão ter vigência anterior ao 1º de semestre de 2019, conforme viabilidade técnica.Parágrafo único. As regras citadas no caput deste artigo poderão ter vigência anterior ao 2º de semestre de 2019, conforme viabilidade técnica. (alteração incluída pela Resolução CEPEC Nº 1612, de 30 de novembro de 2018) Parágrafo único. revogado (Redação dada pela Resolução CEPEC Nº 1661, de 29/11/2019)"]}